{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_attacker",
  "kw_cracking",
  "lg_en",
  "kw_cracked",
  "kw_sniff"
 ],
 "key": "0nT5eVUb",
 "pasteDate": "Feb 20, 2018, 5:57:37 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "BYOND Key: Sokkxx\nCharacter Name: Spinat\nAlignment: Neutral Evil\nCharacter Age: 18\nRace Applying for: Elite Saiyan\nElite Saiyan Topic: Explain your natural superiority to your fellow Saiyans and how you hold and maintain your power over the lower class\nTopic Rp: \nThe cold wind carried the hunter's mane of brown hair...this cool stillness, the restless thumping present in his chest, and the blessing of the lone crescent in the sky coupled with the devoid and starless night was precisely the type of night that Spinat had relished when beginning a hunt. Taking a high perch upon a plateau as he often did he'd sniff the air defiantly, almost as if he claimed tonight as HIS, the Wild Hunt would ensue...but, where to start?\n\n\"*sniff* Ghn, what a night....\"\n\nCarefully applying his pelt and armoring, the Saiyan would keep his ears acute with sharp senses, and an unreal amount or poise. Almost like clockwork though his heightened ability would pick up a faint bustling and commotion in the distance. \n\nSomewhere off in the northeast he presumed as his tail cracked at the air behind him and he dove off of the cliff, blasting off in a silent boom. Now initiating his stealth-like perception so he could best figure out how to tackle the situation, this trait allowed him much advantage over most others, and allowed his reputation to expand as a competent tracker.\n\nAs he arrived he was able to make out, what seemed to be a group of unruly and angry Low Classed Saiyans, hell the hunter may had mistaken them for Tuffles if he didn't view legitimate tails swaying in discontent from their bodies. They had set up at the site of the future Ground God Temple, and it seemed they were quite unhappy with any credence paid in tribute to the green Alien.\n\nHe'd land down in front of the group, taller than all but two. Looking about their filthy and lowborn faces Spinat wold simply cross his arms in annoyance as he grunted in discontent, though perhaps here he'd get to measure his growth after facing his Braalian neighbors.\n\n\"W-what!? DAMN!! It be the God talker! He hunt for them and tell them things!! He's no Saiyan!!\" One of the average height lowies would blurt out shaking his hands in impotent wrath.\n\nAs his eyes fell upon him, Spinat would take a step forward, shaking the ground with the difference in power he could see with hids scouter, as he was the only Saiyan to have one at the moment. Clicking it and reading single to triple digits, and two at about 1000 he'd sigh and answer them.\n\n\"I don't speak for the gods, I speak for the Hunt and the Harvest. The only aid I give benefits those two things, and if you all wish to upset the gods by parading over this construction, that means no harvest, no HUNT....Which means that I'd have to use you low-born scum as my game..\" A wild smirk would follow these words, as it had been a while since Spin had gotten to face so many opponents at once.\n\nA majority of the Lowies would step back in a bit of a tremble as the two aforementioned \"brutes\" would look down at Spinat from their stature cracking their knuckles, still smiling before them Spinat would look between the two of them and ask a final question before cracking his neck.\n\n\"Left or right?\"\n\nBearing down upon him in a vicious flurry the first attacker would throw wild punches and hay-makers that Spinat casually avoided, his arms still crossed as he moved his head weaving out of the way of the blows without stepping from his spot. \n\nWith a prompt and hyper sonic elbow his arm would disappear briefly as he dug into the Lowie's gut, casing his eyes to bulge in pain and spit to fly out his mouth, and with a swift smack with his tail the man would be crashed through the adjacent tree, only stopped by Spinat's knee to his face as he caught up to him in a flash step, now stomping on his right arm crushing it, effectively quelling him effortlessly.\n\n\"Right it is...\"\n\nSpin had grown since his days as a solitary hunter, having trained hard, and used his natural ability he was leagues beyond these Saiyans in an almost laughable manner. The Zenkais he'd received from godly spars had only furthered his pride in his own ability..\n\nBut as he basked for that brief triumph, he'd hear a distinct and familiar whistle from the other Low-Class...and in response Spinat would duck in a split second as a Strieger dashed overhead cleaving at the air and slashing a bit of the trees directly in half.\n\nRecovering and raising an eyebrow it seemed this adversary had come prepared...in an almost kamikaze esque move he'd used a sacred call to summon one of the most formidable and dangerous carnivores on Braal...the Vegetan equivalent to a tiger had serrated fangs",
 "title": "Sokkxx's Elite Saiyan App(Unfinished)"
}