{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_attack"
 ],
 "key": "0riWGEGz",
 "pasteDate": "Feb 18, 2018, 7:34:36 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Gallic Wars\n- Lost. In a war whose ending foreshadows the next 2000 years of French history, France is conquered by of all things, an Italian. \n\nNorse Invasions: Lost. King Charles the Simple buys peace with the Norsemen by giving them Normandy. \n\nMoorish Invasions: Lost. Charlemagne scoots behind the Pyrennes. \n\nThird Crusade: Philip Augustus gets mad at Richard the Lion Heart and goes home. \n\nSeventh Crusade: Lost. St. Louis' crusade to Egypt resoundingly crushed. \n\nEighth Crusade: Lost. St. Louis goes to Tunis\n\n\n- Hundred Years War\n- Mostly lost, saved at last by female schizophrenic who inadvertently creates The First Rule of French Warfare; \"France's armies are victorious only when not led by a Frenchman.\" Sainted.\n\n- Italian Wars\n- Lost. France becomes the first and only country to ever lose two wars when fighting Italians.\n\n- Wars of Religion\n- France goes 0-5-4 against the Huguenots\n\n- Thirty Years War\n- France is technically not a participant, but manages to get invaded anyway. Claims a tie on the basis that eventually the other participants started ignoring her.\n\n- War of Devolution\n- Tied. Frenchmen take to wearing red flowerpots as chapeaux.\n\n- The Dutch War\n- Tied\n\n- War of the Augsburg League/King William's War/French and Indian War\n- Lost, but claimed as a tie. Three ties in a row induces deluded Frogophiles the world over to label the period as the height of French military power.\n\n- War of the Spanish Succession\n- Lost. The War also gave the French their first taste of a Marlborough, which they have loved every since.\n\n- American Revolution\n- In a move that will become quite familiar to future Americans, France claims a win even though the English colonists saw far more action. This is later known as \"de Gaulle Syndrome\", and leads to the Second Rule of French Warfare; \"France only wins when America does most of the fighting.\"\n\n- French Revolution\n- Won, primarily due the fact that the opponent was also French.\n\n- The Napoleonic Wars\n- Lost. Temporary victories (remember the First Rule!) due to leadership of a Corsican, who ended up being no match for a British footwear designer.\n\n- The Franco-Prussian War\n- Lost. Germany first plays the role of drunk Frat boy to France's ugly girl home alone on a Saturday night.\n\n- World War I\n- Tied and on the way to losing, France is saved by the United States [Entering the war late -ed.]. Thousands of French women find out what it's like to not only sleep with a winner, but one who doesn't call her \"Fraulein.\" Sadly, widespread use of condoms by American forces forestalls any improvement in the French bloodline.\n\n- World War II\n- Lost. Conquered French liberated by the United States and Britain just as they finish learning the Horst Wessel Song.\n\n- War in Indochina\n- Lost. French forces plead sickness; take to bed with the Dien Bien Flu\n\n- Algerian Rebellion\n- Lost. Loss marks the first defeat of a western army by a Non-Turkic Muslim force since the Crusades, and produces the First Rule of Muslim Warfare; \"We can always beat the French.\" This rule is identical to the First Rules of the Italians, Russians, Germans, English, Dutch, Spanish, Vietnamese and Esquimaux.\n\n- War on Terrorism\n- France, keeping in mind its recent history, surrenders to Germans and Muslims just to be safe. Attempts to surrender to Vietnamese ambassador fail after he takes refuge in a McDonald's.\n\nThe question for any country silly enough to count on the French should not be \"Can we count on the French?\", but rather \"How long until France collapses?\"\n\n\"Going to war without France is like going deer hunting without an accordion. All you do is leave behind a lot of noisy baggage.\"\n\nOr, better still, the quote from last week's Wall Street Journal: \"They're there when they need you.\"\n\n\n\nWith only an hour and a half of research, Jonathan Duczkowski provided the following losses:\n\nNorse invasions, 841-911.\nAfter having their way with the French for 70 years, the Norse are bribed by a French King named Charles the Simple (really!) who gave them Normandy in return for peace. Normans proceed to become just about the only positive military bonus in France's [favour] for next 500 years. \n\nAndrew Ouellette posts this in response:\n\n1066 A.D. William The Conquerer Duke and Ruler of France Launches the Largest Invasion in the history of the world no other was as large until the same trip was taken in reverse on June 6th 1944 William Fights Harold for the Throne of England Which old king Edward rightfully left to William but Harold Usurped the throne Will fights the Saxons (English)wins and the French Rule England for the Next 80 Years. then the French start the largest building and economic infrastructure since the fall of the Roman Empire the Norman Economy skyrockets and the Normans inadvertantly start England to become a major world Power Vive La France- \n\nMatt Davis posts this in response to Andrew Ouellette above:\n\nOh dear. We seem to have overlooked some basic facts. Firstly, Philip the First (1060 - 1108) was King of France at the time of the Norman invasion of 1066 - William was Duke of Normandy and, incidentally, directly descended from the Vikings. William was, therefore, as alien to France as the experience of victory. Since Philip did not invade England, the victory at Hastings was Norman - not French. Normandy may be a part of France now but it most certainly wasn't in 1066. Therefore, William's coronation as King of England had nothing whatsoever to do with the French. As usual, they were nowhere near the place when the fighting was going on. The mistaken belief that 1066 was a French victory leads to the Third Rule of French Warfare; \"When incapable of any victory whatsoever - claim someone else's\". \n\nMexico, 1863-1864.\nFrance attempts to take advantage of Mexico's weakness following its thorough thrashing by the U.S. 20 years earlier (\"Halls of Montezuma\"). Not surprisingly, the only unit to distinguish itself is the French Foreign Legion (consisting of, by definition, non-Frenchmen). Booted out of the country a little over a year after arrival. \n\nPanama jungles 1881-1890.\nNo one but nature to fight, France still loses; canal is eventually built by the U.S. 1904-1914. \n\nNapoleonic Wars.\nShould be noted that the Grand Armee was largely (~%50) composed of non-Frenchmen after 1804 or so. Mainly disgruntled minorities and anti-monarchists. Not surprisingly, these performed better than the French on many occasions. \n\nHaiti, 1791-1804.\nFrench defeated by rebellion after sacrificing 4,000 Poles to yellow fever. Shows another rule of French warfare; when in doubt, send an ally. \n\nIndia, 1673-1813.\nBritish were far more charming than French, ended up victors. Therefore the British are well known for their tea, and the French for their whine (er, wine...). Ensures 200 years of bad teeth in England. \n\nBarbary Wars, middle ages-1830.\nPirates in North Africa continually harass European shipping in Meditteranean. France's solution: pay them to leave us alone. America's solution: kick their asses (\"the Shores of Tripoli\"). [America's] first overseas victories, won 1801-1815. \n\n1798-1801, Quasi-War with U.S.\nFrench privateers (semi-legal pirates) attack U.S. shipping. U.S. fights France at sea for 3 years; French eventually cave; sets precedent for next 200 years of Franco-American relations. \n\nMoors in Spain, late 700s-early 800s.\nEven with Charlemagne leading them against an enemy living in a hostile land, French are unable to make much progress. Hide behind Pyrennes until the modern day. \n\nFrench-on-French losses (probably should be counted as victories too, just to be fair): \n\n1208: Albigenses Crusade, French massacared by French.\nWhen asked how to differentiate a heretic from the faithful, response was \"Kill them all. God will know His own.\" Lesson: French are badasses when fighting unarmed men, women and children. \n\nSt. Bartholomew Day Massacre, August 24, 1572.\nOnce again, French-on-French slaughter. \n\nThird Crusade.\nPhilip Augustus of France throws hissy-fit, leaves Crusade for Richard the Lion Heart to finish. \n\nSeventh Crusade.\nSt. Louis of France leads Crusade to Egypt. Resoundingly crushed. \n\n[Eighth] Crusade.\nSt. Louis back in action, this time in Tunis. See Seventh Crusade. \n\nAlso should be noted that France attempted to hide behind the Maginot line, sticking their head in the sand and pretending that the Germans would enter France that way. By doing so, the Germans would have been breaking with their traditional route of invading France, entering through Belgium (Napoleonic Wars, Franco-Prussian War, World War I, etc.). French ignored this though, and put all their effort into these defenses. \n\nThomas Whiteley has submitted this addition to me:\n\nSeven year War 1756-1763\nLost: after getting hammered by Frederick the Great of Prussia (yep, the Germans again) at Rossbach, the French were held off for the remainder of the War by Frederick of Brunswick and a hodge-podge army including some Brits. War also saw France kicked out of Canada (Wolfe at Quebec) and India (Clive at Plassey). \n\nRichard Mann, an American in France wants to add the following:\n\nThe French consider the departure of the French from Algeria in 1962-63, after 130 years on colonialism, as a French victory and especially consider C. de Gaulle as a hero for 'leading' said victory over the unwilling French public who were very much against the departure. This ended their colonialism. About 2 million ungrateful Algerians lost their lives in this shoddy affair.",
 "title": ""
}