{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_password",
  "lg_en",
  "kw_security",
  "re_url"
 ],
 "key": "1BP7S03N",
 "pasteDate": "Feb 24, 2018, 2:12:08 PM",
 "relevancy": 6.0,
 "relevant": false,
 "text": "# HelloFresh Senior Backend Developer Test\n\nHello and thanks for taking the time to try this out.\n\nThe goal of this test is to assert (to some degree) your coding and architectural skills. You're given a simple problem so you can focus on showcasing development techniques. We encourage you to overengineer the solution a little to show off what you can do - assume you're building a production-ready application that other developers will need to work on and add to over time.\n\nYou're **allowed and encouraged** to use third party libraries, as long as you put them together yourself **without relying on a framework or microframework** to do it for you. An effective developer knows what to build and what to reuse, but also how his/her tools work. Be prepared to answer some questions about those libraries, like why you chose them and what other alternatives you're familiar with.\n\nAs this is a code review process, please avoid adding generated code to the project. This makes our jobs as reviewers more difficult, as we can't review code you didn't write. This means avoiding libraries like _Propel ORM_, which generates thousands of lines of code in stub files.\n\n_Note: While we love open source here at HelloFresh, please do not create a public repo with your test in! This challenge is only shared with people interviewing, and for obvious reasons we'd like it to remain this way._\n\n## Prerequsites\n\nWe use [Docker](https://www.docker.com/products/docker) to administer this test. This ensures that we get an identical result to you when we test your application out, and it also matches our internal development workflows. If you don't have it already, you'll need Docker installed on your machine. **The application MUST run in the Docker containers** - if it doesn't we cannot accept your submission. You **MAY** edit the containers or add additional ones if you like, but this **MUST** be clearly documented.\n\nWe have provided some containers to help build your application in either PHP, Go or Python, with a variety of persistence layers available to use.\n\n### Technology\n\n- Valid PHP 7.1, Go 1.8, or Python 3.6 code\n- Persist data to either Postgres, Redis, or MongoDB (in the provided containers).\n    - Postgres connection details:\n        - host: `postgres`\n        - port: `5432`\n        - dbname: `hellofresh`\n        - username: `hellofresh`\n        - password: `hellofresh`\n    - Redis connection details:\n        - host: `redis`\n        - port: `6379`\n    - MongoDB connection details:\n        - host: `mongodb`\n        - port: `27017`\n- Use the provided `docker-compose.yml` file in the root of this repository. You are free to add more containers to this if you like.\n\n## Instructions\n\n1. Clone this repository.\n- Create a new branch called `dev`.\n- Run `docker-compose up -d` to start the development environment.\n    - If you want to use Go, uncomment the Go container in the `docker-compose.yml` file. Add the commands you need in there to execute the application.\n    - If you want to use Python, uncomment the Python container in the `docker-compose.yml` file first. Add the commands you need in there to execute the application.\n- Visit `http://localhost` to see the contents of the web container and develop your application.\n- Create a pull request from your `dev` branch to the master branch. This PR should contain setup instructions for your application and a breakdown of the technologies & packages you chose to use, why you chose to use them, and the design decisions you made.\n- Reply to the thread you're having with our HR department telling them we can start reviewing your code.\n\n## Requirements\n\nWe'd like you to build a simple Recipes API. The API **MUST** conform to REST practices and **MUST** provide the following functionality:\n\n- List, create, read, update, and delete Recipes\n- Search recipes\n- Rate recipes\n\n### Endpoints\n\nYour application **MUST** conform to the following endpoint structure and return the HTTP status codes appropriate to each operation. Endpoints specified as protected below **SHOULD** require authentication to view. The method of authentication is up to you.\n\n##### Recipes\n\n| Name   | Method      | URL                    | Protected |\n| ---    | ---         | ---                    | ---       |\n| List   | `GET`       | `/recipes`             |          |\n| Create | `POST`      | `/recipes`             |          |\n| Get    | `GET`       | `/recipes/{id}`        |          |\n| Update | `PUT/PATCH` | `/recipes/{id}`        |          |\n| Delete | `DELETE`    | `/recipes/{id}`        |          |\n| Rate   | `POST`      | `/recipes/{id}/rating` |          |\n\nAn endpoint for recipe search functionality **MUST** also be implemented. The HTTP method and endpoint for this **MUST** be clearly documented.\n\n### Schema\n\n- **Recipe**\n    - Unique ID\n    - Name\n    - Prep time\n    - Difficulty (1-3)\n    - Vegetarian (boolean)\n\nAdditionally, recipes can be rated many times from 1-5 and a rating is never overwritten.\n\nIf you need a more visual idea of how the data should be represented, [take a look at one of our recipe cards](https://ddw4dkk7s1lkt.cloudfront.net/card/hdp-chicken-with-farro-75b306ff.pdf?t=20160927003916).\n\n## Evaluation criteria\n\nThese are some aspects we pay particular attention to:\n\n- You **MUST** use packages, but you **MUST NOT** use a web-app framework or microframework.\n- Your application **MUST** run within the containers. Please provide short setup instructions.\n- The API **MUST** return valid JSON and **MUST** follow the endpoints set out above.\n- You **MUST** write testable code and demonstrate unit testing it (for clarity,  PHPUnit is not considered a framework as per the first point above. We encourage you to use PHPUnit or any other kind of **testing** framework).\n- You **SHOULD** pay attention to best security practices.\n- You **SHOULD** follow SOLID principles where appropriate.\n- You do **NOT** have to build a UI for this API.\n\nThe following earn you bonus points:\n\n- Your answers during code review\n- An informative, detailed description in the PR\n- Setup with a one liner or a script\n- Content negotiation\n- Pagination\n- Using any kind of Database Access Abstraction\n- Other types of testing - e.g. integration tests\n- Following the industry standard style guide for the language you choose to use - `PSR-2`, `gofmt`, etc.\n- A git history (even if brief) with clear, concise commit messages.\n\n---\n\nGood luck!",
 "title": ""
}