{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en",
  "kw_sec"
 ],
 "key": "3NyEXyzF",
 "pasteDate": "Feb 25, 2018, 11:29:04 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "CaraXXSigma: mama^^\nCaraXXSigma: hihi -Mews and reaches paws up to her purring and yawns-\nAisuSkyWolven: /me smiles and scoops her up and cuddles her and Sakeo \"hi bbg\"\nCaraXXSigma: ish nap time-Mewls and cuddles into mama and Sakeo purring softly and suckling on her paw purring contently and softly-\nCaraXXSigma: ((gots to get going))\nCaraXXSigma: wuvs and fishes ^^\nGuest_SakeoJujistsu: bkish]\nGuest_HoneyBee89: -curls up watching everyone-\nGuest_SakeoJujistsu: hihi\nRevThornwood: hihi\nGuest_SakeoJujistsu: mews mommy say is only come here and her kingdom for now\nRevThornwood: where else would i go\nGuest_SakeoJujistsu: not chu\nGuest_SakeoJujistsu: mews ....\nRevThornwood: ahh\nGuest_SakeoJujistsu: mommy had me well rather beged mews mommy let mews still come here cause its family her said ok since zones was up\nRevThornwood: ohhh i see\nRevThornwood: im sorry she couldnt come for a while, i hope this fixes things\nGuest_HoneyBee89: i having a duh moment who is moonstorm o.o\nGuest_SakeoJujistsu: oo\nRevThornwood: idk then\nRevThornwood: them\nGuest_HoneyBee89: sakeo tell my mother to check skype\nAisuSkyWolven: back\nRevThornwood: wb\nAisuSkyWolven: ty and hello\nAisuSkyWolven: bubbs hun you didn't have to stick around if you didn't want to.....yes I did say that I wanted to see family members in the pack as well as the kingdom today, but it's sad that it has to resort to somone asking people to come home\nGuest_HoneyBee89: you know im always here hun, when i am on im on to see my family. and i dont know what this week brings, and when i will be able to get on again so i figured i would hang here if its okay\nAisuSkyWolven: of course\nGuest_HoneyBee89: i might go slightly im still covered in grease and dirt from working on my car but im here\nAisuSkyWolven: awww\nAisuSkyWolven: hopefully it's working right for ya\nGuest_HoneyBee89: after spending 6k on parts it better\nAisuSkyWolven: right\nAisuSkyWolven: lol I wanna take a nap but it's tolate in the day for me to take one\nGuest_HoneyBee89: same i was up at 5am workin on my car im so damn tired but im have to get some clothes washed up for work and the kids for school that if i lay down it wont get done lol\nAisuSkyWolven: I've been doing laundry all day and then had to make dinner: fish, spaghetti, coleslaw and garlic bread\nGuest_HoneyBee89: yum\nAisuSkyWolven: it was deliscious\nGuest_HoneyBee89: lol.\nGuest_HoneyBee89: i think i am gonna go grab a bite to eat now lol\nGuest_HoneyBee89: afk\nAisuSkyWolven: and a nice tall glass of peach/mango tea with some lemon cake for dessert\nAisuSkyWolven: tyt\nGuest_SakeoJujistsu: aaaaaaaaaa why is my neice a over meladramtifc kid aaaaaaaaaa\nAisuSkyWolven: ??\nGuest_HoneyBee89: bkk snd o.o\nGuest_SakeoJujistsu: ill b bk sec storm is her babysitter atm and she passed out after giving her meds that would heal her oi oi oi oi fp\nAisuSkyWolven: oh my\nGuest_SakeoJujistsu: youy have no idea some my brothers kids are nuts\nGuest_HoneyBee89: well family i gotta hope off here and get the kiddos and myself ready for bed\nAisuSkyWolven: night Bubbs\nGuest_HoneyBee89: nini\nGuest_SakeoJujistsu: i need poop oooooo\nGuest_SakeoJujistsu: runs to shitter love ya bubs is doggi prarring rn\nGuest_HoneyBee89: gross tmi\nGuest_HoneyBee89: love ya both i will be on skype if ya need me\nGuest_HoneyBee89: talk about tall dark and handsome lmfao\nGuest_HoneyBee89: kiddin\nAisuSkyWolven:  Welcome to SkyWolven Pack, the Alphas are Aisu SkyWolven and her mate Iru. Betas  are Koori and her mate Dark. Please be in furry or neko form, unless you're a Vampire, Scaly, Elf, or anything Fantasy. After you have loaded please post a 3 + LINE PARA ROLE PLAY ENTRANCE that includes what brings you to our lovely pack. HUMANS AND FLASHING LIGHT TRIGGERS WILL GET AUTO BOOT. NO DRAMA OF ANY KIND OR YOU WILL BE BOOTED & PERMA BLOCKED.\nDaxtonTempestWolf: {is 3 lines the max or can i do more?\nDaxtonTempestWolf: }\nAisuSkyWolven: (you're welcome to do more if you like)\nGuest_SakeoJujistsu: bk\nAisuSkyWolven: wb\nAisuSkyWolven: I'm here ...ish just working on my badges\nGuest_SakeoJujistsu: tyt is with momma to rn\nAisuSkyWolven: hi momma\nRobin772004: Hey bbg\nAisuSkyWolven: hru?\nRobin772004: Good and you bbg? And thanks for asking\nAisuSkyWolven: awesome as always thanks\nGuest_SakeoJujistsu: hihi aunty robin\nRobin772004: yvw bbg and hello my Neice\nAisuSkyWolven: it's a little quiet right now and should be pickg up in a little but\nRobin772004: oh ok thats fine hun\nAisuSkyWolven: how has your day been?\nRobin772004: Did any of the family come on today when you wanted someone to bbg?\nAisuSkyWolven: Bubbs and Mads came on\nRobin772004: Well it started off good but man my almost 15 year old is getting on my last nurve with her brattyness\nRobin772004: thats good that they did\nAisuSkyWolven: awww\nRobin772004: I'm getting ready to slap her small again lol\nAisuSkyWolven: lol\nGuest_SakeoJujistsu: Guest_SakeoJujistsu: uncy i sware we live in kindergarden in the midst of a soap opera gone wrong on seene 3\nAisuSkyWolven: what's that about?\nGuest_SakeoJujistsu: life\nRobin772004: -sighs-\nAisuSkyWolven: oh okay. you alright momma?\nRobin772004: no both my kids are fighting real bad and with my mom as well. I just don't know what to do anymore I really don't.\nAisuSkyWolven: aww I'm sorry to hear that\nRobin772004: it's ok I guess\nAisuSkyWolven: have they given you a date for you other surgery yet?\nAisuSkyWolven: your*\n: your*\nGuest_SakeoJujistsu: ill b bk few\nAisuSkyWolven: tyt",
 "title": "SkyWolven 2/25/18 thru 8:30 pm"
}