{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_vi"
 ],
 "key": "4VqxAJRw",
 "pasteDate": "Feb 8, 2018, 1:15:34 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Trong cuc sng, nu ai mun t c mt thnh cng no  th ngi  nht nh phi c lng kin tr, bn b khng chu u hng trc bt k mt kh khn th thch no. V ngi xa  tng c rt kinh nghim  qua cu tc ng C cng mi st c ngy nn kim.\nTrc ht cu ny mun ni ln thc t rng khi c mt cc st nu ta c kin tr bn b mi gia n th n mt ngy no , cc st to kia s tr thnh mt chic kim nh. T cu tc ng ny, cha ng ta mun khuyn rn chng ta rng: bt c vic g con ngi cng c th lm c, min l phi chu kh kh luyn, bit kin tr nhn ni, khng qun gian lao vt v.\nCu ni ny khng bit ra i t bao gi v cho n ny n vn l mt cu ni quen thuc i vi mi ngi. Chng ta c th chng minh c tnh ng n ca cu tc ng qua thc t.\n\n\ni vi nhng ngi hc sinh chng ta lng kin tr cng rt cn thit. Ai i hc cng mong mun mnh tr thnh mt hc sinh gii, nhng  t c iu  li khng phi l chuyn n gin. Bi kin thc l v tn, s hiu bit ca hc sinh cn hn ch, nu ta u hng trc nhng bi vn, bi ton kh th ta s khng th hc tt c. Thc t c nhng bn khi c u  ca mt bi ton thy kh thng nn ch khng t lm na ri dn dn thnh thi quen, c gp nhng bi ton kh l b th chc chn bn  s khng th t c kt qu cao trong hc tp, cn nu trc cc bi ton hc ba ta c chu kh my m, mt ting khng gii c th hai ting v c th hn na chc chn ta s lm c, t  to cho ta mt thi quen kin tr hc tp khng h nn lng trc bt k kh khn no. \n\n\nTrong i sng ta cng bt gp nhiu tm gng sng v  ch s kin tr bn b vt ln kh khn  tr thnh mt con ngi c ch cho x hi. Trong  c tm gng thy Nguyn Ngc K. Ngi ta thng ni Giu hai con mt kh i bn tay, y vy m anh Nguyn Ngc K  b lit i tay t khi cn rt nh. Chc chn khi  ai cng ngh rng c cuc i ny anh s tr thnh con ngi tn ph th nhng chnh bng  ch s kin tr bn b anh  tn dng s lnh ln ca i chn  vit nhng nt ch u tin, lc u cn nguch ngoc v khng bit  bao ln anh b chut rt co qup c chn, au n bc mnh anh  vt tt c vo x nh nh s khng hc na, nhng ri anh li kin tr tp dn mi ngy mt t v anh  thnh cng, khng nhng th ch anh cn rt p. Vy l anh c th i hc bnh thng nh cc bn khc, mc d vo nhng ngy ng trn vic i li khng h d dng th nhng anh  vt qua tt c  tr thnh con ngi c tri thc. V trong cuc sng hng ngy, anh cng c gng lm nhng vic c th lm c  gip  m cha. Hn th anh cn lm nhng vic tng chng nh khng th  l vt bo, bm bo Tt c nhng vic lm  rt kh khn i vi anh th nhng anh  lm c. Chng ta hiu rng  chnh l  ch ngh lc lng kin tr, quyt tm  gip anh tr thnh con ngi c ch cho x hi. Anh  tr thnh mt nh gio. y chnh l mt minh chng cho cu tc ng xa C cng mi st c ngy nn kim.\nNgy nay cng c nhiu bn hc sinh  vt ln kh khn vt v ca cuc sng  c i hc v tr thnh hc sinh gii.  l nhng bn do hon cnh gia nh nn ngy ngy ngoi gi hc cn phi i bn v s hay ph gip cha m bn hng  c tin n hc. Cc bn lun tranh th thi gian  hc tp v thng t kt qu cao,  t v thnh nhng cng dn c ch cho x hi.\nTrong thc t cng chng minh rng nu ta khng kin tr bn b trong hc tp cng nh trong cc cng vic khc th chc chn ta s khng th thnh cng trong bt c cng vic g. Chng hn nh ta mun hc tht gii nhng bui ti ma ng ngi hc mt lt ta li ngh n chic ging m p v vi v hc tht nhanh  i ng trong khi bi c vn cha hc xong, bi tp c gio cho v nh cha lm, cha chun b bi cho ngy hm sau. Ri c khi trc nhng cng vic c giao ch cn c cht kh khn l  chn bc th chc chn ngi  s chng lm c vic g tt c.\nDo vy cho n tn ngy nay v c l cho n mun i th cu tc ng C cng mi st c ngy nn kim  tr thnh chn l.  l mt li khuyn, li nhc nh i vi mi chng ta trn con ng hng ti tng lai.\n\n\nRng c v nh l phi xanh ca con ngi. Chnh v vy, bo v rng chnh l bo v cuc sng ca chng ta.\nRng l ni cy xanh pht trin. Nh ta  bit, cy xanh khi quang hp s tip nhn kh cc-bo-nc v thi ra kh -xi  rt cn thit cho qu trnh h hp ca con ngi ni ring v nhiu loi ng vt trn th gii ni chung.\nNh cy xanh m bu khng kh tr nn trong lnh, gim thiu nhng tc nhn gy  nhim mi trng. Ngoi ra, rng phng h, rng u ngun,  gp phn phng chng thin tai, bo l vn gy ra nhiu thit hi v ngi v ca. Khng nhng th, rng cn c trng v mc ch pht trin kinh t. Rng l ngun cung cp g cho cc nh my sn xut  ni tht, lm giy, Rng cng l ni c tr ca nhiu loi ng vt qu him c nguy c b tuyt chng: h, kh, hu,  Nh c rng, h sinh thi c cn bng.\nTuy nhin, d vai tr quan trng ca rng nhng nn khai thc rng vn din ra tng ngy. Ch v ci li trc mt, h b qua nhng li ch lu di m rng em li. Rng u ngun b cht ph lm cho l lt xy ra trin min, lm xi mn t ai, nhiu ngi mt ca ci v thm ch l thit mng. Nhiu cy qu him trong rng b cht ph khin cho nhiu loi ng vt b mt i ni tr ng ca mnh. Nn t rng lm nng ry cng lm cho din tch rng suy gim nghim trng.\n bo v rng, chng ta cn c nhng hnh ng thit thc ngay t by gi. Cn tuyn truyn, nng cao  thc ca ngi dn trong vic bo v rng. Nhng vng thng hay xy ra thin tai, bo l cn trng rng u ngun. Bn cnh , chng ta cng cn tch cc trng cy ph xanh i trc. i vi nn ph rng, Nh nc cn c nhng chnh sch cht ch cng nh bin php x l nghim minh nhm rn e mi ngi.\nBo v rng khng phi l vn  ca ring ai. V sc khe ca bn thn, gia nh v x hi, chng ta hy cng chung tay gp sc bo v rng!\n bo v rng, chng ta cn c nhng hnh ng thit thc ngay t by gi\n\n\n\nT thu con ngi xut hin trn Tri t, mi trng sng l mt iu kin khng th thiu cho s sinh tn ca s vt v con ngi. Hin nay, do nhu cu i sng vt cht cao nn t ai quan tm n v lm cho mi trng ngy cng tr nn xu i do nhng k v lng tm ph hoi.\n\nMi trng l khng gian sng ca con ngi, ng vt,...Bao gm tt c nhng g xung quanh ta v c phn thnh hai loi: mi trng t nhin v mi trng nhn to. Mi trng t nhin l cc yu t thin nhin nh khng kh, nc, t, rng,... L l phi xanh ca Tri t, l nhng ngn ni cao hng v, l nh sng rng ngi,... Mi trng rt quan trng i vi i sng ca mi ngi. V th, chng ta phi bo v mi trng chnh l bo v sc khe ca chnh mnh\n\nMi trng l bu khng kh cho ta ht th. Nhng by gi th bu khng kh y ang b  nhim do nhng nh my, x nghip m ta  t ho dng ln, th kh c nghi ngt, lm cho mt giy Tri t nng thm mt tn bi. Nhng chic xe  t, xe my tp np lin tc chy trn ng, khi x ra en bi c ng ph. Lm cho khng kh tr nn ngt ngt nng n. T , tng -zn ngn cn sc nng ca Mt Tri cng ang b thng ngy mt ln hn. Sc nng y lm bng tan ra v trn vo t lin gy ngp lt, bo, v sng thn. Khng ch th, khng kh b  nhim gy ra ma a-xit lm h hi ma mng, ph hy nhiu rng cy v i sng ca cc sinh vt cng b e da.\n\nCy xanh l ngun cung cp khng kh trong lnh. Cy cn ngn l, cho bng mt, bo v i sng con ngi. V th, cy xanh cng rt quan trng trong mi trng. Nhng c mt s ngi khng hiu iu , cht ph cy, t rng, xut hin t trng i trc. Mu xanh dn dn bin mt, kh hu tr nn ngt ngt. L lt trn v gy nhiu thit hi. Nhng ngun li qu gi nh g, nguyn liu lm thuc,...dng nh cng b cun vo nhng li ca ph hoi rng. Ch mt hnh ng tn nhn   ph hoi v p thin nhin, m con ngi khng th to ra.\n\nu ch c vy, rng cn l ni c tr ca cc loi ng vt hoang d, qu bu m thin nhin  ban tng cho chng ta. Con ngi  sn bn th qu him bn cho nhau. Ch v ci li trc mt m tn ph thin nhin. By gi mt s loi  v ang ng trc nguy c tuyt chng. Chng ta nn bo v, xy dng nhiu khu bo tn  bo v cc th vt qu him.\n\nThnh phn tip theo cng c khng t vai tr quan trng  chnh l nc. Nc l vt cht khng th thiu trong i sng sinh hot ca con ngi v s vt. V d nh: lm nc ung, giao thng ng bin, v nhiu sinh hot khc. Hy ngh xem nu mt ngy khng c nc th mi vt s ra sao? S cht dn, ho dn v mt nc, kh khan. iu  s xy ra nu chng ta c phung ph, khng bit s dng hp l. Ngi ta thng ni \"rng vng, bin bc\" m gi y mt bin li bp bnh ton rc thi. Nhng ao, h b  nhim do rc ca con ngi qu nhiu lm cho c, tm cht, nhim bnh hng lot. Ri con ngi li s dng ngun nc , nh hng n sc khe, sinh bnh. i, tht kinh khng! Ngun nc b  nhim chng nhng khng s dng c m cn gy  nhim mi trng do mi hi thi. Nh mi ngi cng  bit, H Gm l ni rt sch p, dnh cho mi ngi i tham quan, ngm cnh  y. Nhng cch y khng lu c mt bi bo a tin v vic  thc ngi dn b gim st lm cho h b  nhim, mt i v p vn ha ca H Gm.\n\nHin nay, s  nhim mi trng  n mc bo ng. Chng ta nn bo v mi trng bng nhng hnh ng thit thc. Khng kh b  nhim th cn phi c nhng bin php lc khng kh. Ngun nc b  nhim th phi bo v v tit kim nc. Rng b tn ph th phi trng thm cy. Tch cc tham gia cc hot ng phong tro nh: Ma h xanh, Ngy ch nht,...Nu mi ngi ng gp mt t th chng bao lu mi trng s ngy cng xanh ti.\n\nMi trng sng l rt quan trng. Nu khng c mi trng th s khng c chng ta, khng c s sng. Nhng  c n th phi bit gi gn, bo v. Chng ta khng nn c thm hnh ng no ph hoi mi trng. Hy bt u t nhng vic nh nht nht  hnh tinh lun xanh ti.",
 "title": ""
}