{
 "espireDate": "N",
 "format": "yaml",
 "jSonReasons": [
  "kw_operations",
  "lg_fr"
 ],
 "key": "5DVJaX8i",
 "pasteDate": "Feb 19, 2018, 3:19:58 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "categories:\n- securite compte\nconversations:\n- - Comment acceer  mon espace securise ?\n  - Pour acceder a votre espace securise, vous devez tre muni(e) de votre identifiant et de votre mot de passe.\n    Votre identifiant vous a ete remis lors de votre souscription au service Attijarinet.    \n    Quant au mot de passe, il vous a ete envoye par SMS lors de la souscription au service Attijarinet. En cas de non reception de ce dernier, ou d oubli, nous vous remercions de proceder au recalcul de votre mot de passe depuis l ecran de connexion Atijarinet ou Attijari Mobile\n- - A me premiere connexion, la modification du mot de passe est-elle obligatoire?\n  - Oui, la modification du mot de passe est une etape necessaire lors de la premiere connexion afin que vous puissiez mettre en place votre mot de passe personnel pour une securite maximale. Assurez-vous de ne jamais communiquer votre mot de passe a autrui.\n- - Comment composer mon nouveau mot de passe?\n  - Votre nouveau mot de passe doit comporter entre 7 et 20 caracteres alphanumeriques, et inclure au moins une lettre et au moins un chiffre. Exemple ; JwekHrx8XXM6\n- - Que se passe-t-il en cas d'echec lors d'une premiere tentative de connexion?\n  - En cas d'echec, vous aurez la possibilite de vous connecter a nouveau. Cependant, apres 3 essais de connexion infructueux, le systeme bloquera votre acces a Attijarinet pendant 5 minutes.\n- - Que faire si j'oublie ou je perds mon mot de passe?\n  - Le lien \"Mot de passe oublie?\"' via attijarinet ou  Mot de passe oublie  via Attijari Mobile  vous menera vers un formulaire sur lequel vous serez invite(e) a renseigner les informations suivantes \n\n      Votre identifiant\n      Un de vos numeros de compte domicilies chez Attijariwafa bank\n      Suite a la validation de ces informations, un code de reinitialisation provisoire vous sera envoye a votre GSM renseigne lors de la souscription au contrat Attijarinet.\n      A la reception de ce code, vous serez invite a le saisir et a redefinir votre mot de passe.\n- - A quoi sert mon code a usage unique?\n  - Le code a usage unique renforce le niveau de securite de votre espace Attijarinet. Il vous servira a valider toutes vos operations sensibles\n    Validation de vos virements\n    Validation de vos recharges de carte\n    Validation de vos mises a disposition sur GAB\n    Validation de l'ajout de beneficiaires de virements\n    Validation de l'ajout de cartes beneficiaires (pour la recharge de carte)\n- - Que puis-je faire si je ne reois pas mon code a usage unique?\n  - Rassurez-vous! Vous pouvez cliquer sur le bouton \"Appel vocal\" et recevoir le code par appel vocal.\n    En cas de non reception de l'appel, veuillez verifier si le N GSM specifie est correcte, sinon nous vous invitons a vous adresser a votre agence pour le modifier.\n    En cas de non reception du sms, pensez a mettre a jour votre operateur telephonique dans le sous-menu \"Mes donnees personnelles\" du menu \"Mon espace Attijarinet\".\n- - Que se passe-t-il suite a une saisie infructueuse du code a usage unique lors de la validation de mes operations(virement, ajout de beneficiaires..)?\n  - En cas d'echec, vous aurez la possibilite de le saisir a nouveau. Apres 3 saisies infructueuses, fernez la fentre de saisie du code pour revalider votre operation et regenerer un nouveau code.",
 "title": ""
}