{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_hacker",
  "kw_down",
  "kw_abuse",
  "re_sql",
  "lg_en"
 ],
 "key": "5dtgDtBW",
 "pasteDate": "Feb 18, 2018, 2:20:54 PM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "IGN: My ign is currently Jydn\n\nAge: 14\n\nWhat region are you from: I Am From The North America\n\nTimezone: Est\n\nDo you speak English fluently: Yes I speak English 100%\n\nDo you speak any other languages: I do speak the basics of French (How are you? ect)\n\nHow active can you be per day: \nMonday - Thursday = 5 hours (school)\nFriday = 7 hours after school\nSaturday - Sunday = 10 hours\n\nWhat is your current playtime (ex. /playtime): My current playtime is 3 hours 30 mins. \nAs the map just started I don't have that much playtime currently. \n\nPrevious staff experience: I have been staff on multiple regular factions servers, they got around 20 players average so they weren't the best experience, but i can ss to an extent. I know this isn't the best experience but we have to start somewhere.\n\nWhy should we pick you over someone else?: \n\nDetermination:\nBeing determined is a good thing, like actually finishing the task that you , and the task of a staff member is to help Forcide out, and clear all the cheaters and help players who are in need. When I start a task I wont stop until the task is completed. Being determined as a staff member is a good skill, because you know they will finish the job that they have been asked to do.\n\nRecording:\nI have obs and can record in  60 FPS with Tiny Bit of lag, making it easy for me to record every ban I do. If a hacker comes into Team speak i will move him in and try to make him admit or ss, This would take me to a minimal to 5-20 mins.\nMature:\nUnlike Most People Maturity is what I have,I take staffing seriously and do not abuse and I do not use my staff powers to abuse in any way and will follow all staff rules accordingly\n\nMotivated:\nAs a staff member being motivated towards the job is very important, if you're not motivated enough to even log on minecraft accordingly then you shouldn't be part of the staff community. As staff I would be motivated to log onto The Forcide Network every day and do my job as a staff member. I would never be lazy and always find time in my day to log onto Forcide and help the community.\n\nHonest:\nAs a staff member I would always be  honest 100% of the time. If I made a mistake I wouldn't lie and try to get out of it, I would be honest and own up to my mistakes and would take 100% responsibility with the actions that I chose to make and I know if I would own up to the mistake I made, I would take any punishment because that action.\n\nFriendly:\nI am a very friendly person. I would never shout at a player, nor a staff member. I am nice to everyone in an equal way. Being friendly is also an important part of being staff, as this helps you get a long with everyone, players & staff ect.\n\nBiased:\nAs a staff member I would never be Biased, if my friend and another player came into teamspeak both arguing over something, I would never believe my friend over the other player. Another scenario being, a youtuber and a player come into teamspeak saying a player glitched into there base, I would get the player into teamspeak and ask him, I would never just believe the youtuber over the player, I would get solid evidence that he did glitch into the base, before making any punishments to the player in any way. I would then deal with the matter accordingly.\n\nResponsible:\nI would always be responsible for my actions, I would never blame someone else for something I did wrong. I would take full responsibility to the action that I committed. I would be responsible and mature with my perms, and I know if I do not use my perms correctly, it could lead to a punishment that I would.\n\ncaring:\nI am a caring person, I would always make sure people are having fun on Forcide as they joined at there own will. I would be respectful to everyone I meet, staff & players ect. I would never shout at a player who is in teamspeak shouting at me. I would simple try and calm the player down and then talk to him/her about there problem that has accured.\n\nMultitasking:\nI can multitask very well, say player 1 is in team speak needing help I would move him into the channel and see what he needs and while in the process of helping the player with his/hers problem, I would help player 2 who is also I need of staff in game with a hacker or getting griefed.\n\nTrustworthy:\nI am Trustworthy when it comes to being staff. I would never break any rules or i would get punishments,I would do as i am told and not break any rule in the time of that demand of other staff ,owners ect.\n\nReasonable/Fair:\nI am a reasonable person, I would never give unfair mutes or bans, even to a friend or youtuber that i am in interested in . I would make sure i am muting/banning the person Fairly. I would warn someone for breaking the rules obviously, but if its not worth a warn It would be fair and give them a second chance in resault .\n\nActive:\nAs a staff member I would be active and play when i can. If I cannot log on for a period of time I will inform a manager or admin as soon as I know. I play on my pc most of the time and the only time I really cant play is when i'm at school or out with friends. Last season i almost quit minecraft but changed my mind and got right back into it.\n\nSS'ing:\nI can ss to a reasonable extent, I can find basic clients such as toggle sneak ghost clients and TCPNoDelays also that time changer client.\n\nHard Working:\nI am a hardworking person, I never give up even when it gets tough. I am very motivated towards tasks and like completing them.and even when i'm tired or such i'll still keep trying to aleast finish the task i was told to complete \n\nSupport Rooms:\nAs a staff member I would do support rooms. It can be very frustrating waiting in Support Rooms for a long time. When I see the support rooms starting to get filled up,I would move someone and try to get in done quickly and move on to the other user in the team speak of Forcide\n\nIndependent:\nI am a very independent person, I like doing tasks alone but also enjoy doing them with friends or other mods ect. I am capable of doing stuff independently an example being: its 9am there no other type of staff online at the current moment i would \n\nCommunication:\n\n\nPatience:\n\n\nTeamwork:\n\nResilience:\n\n\nFeedback:\n\n\nMore Info:",
 "title": ""
}