{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_expose",
  "lg_en",
  "kw_dropping",
  "kw_attack",
  "kw_cracked"
 ],
 "key": "5egRSa4X",
 "pasteDate": "Feb 26, 2018, 1:25:41 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "The Lion entered the warp core chamber at a full run, taking in the scene in a few moments. Several dozen Dark Angels were stood around the perimeter, their weapons directed at a monstrous bird-like nephilla but not firing. In front of the creature was Corswain, standing immobile just a few metres from it, arms hanging limply by his sides.\n\n\"Cease your attack or this one will be destroyed.\"\n\nThe words came to the Lions thoughts directly, bypassing his ears. Their tone was soft and melodic, in contrast to the haggard, harsh looking creature that had undoubtedly sent them. The nephillas intent was immediately clear and he skidded to a halt, coming to a stop with his swords held ready to defend himself. There was no reaction from his warriors, and he guessed that the words were directed to him alone. He did not know whether their passivity was voluntary or enforced, but it was clear they were in grave danger.\n\nIt is not I that launched an attack, said the Lion, taking a step closer to the apparition. Leave now.\n\n\"And make a waste of all the effort that it took to reach this place? I have been searching for you a long time, Lion of Caliban.\"\n\nThere was something familiar about the creatures voice, like a half-remembered dream. The Lion could not place from where, but it was not the first time he had heard this. His mind stirred with vague recollections, of pleading and entreaty.\n\n\"Yes, that is true. I have come to you before.\"\n\nGet out of my thoughts. The Lion stepped to his left and focused on blocking the creature from his mind, mentally bringing up a shield as though he were defending himself against a physical attack. It was a trick he had learnt as he had stalked nephilla on Caliban. One of the bird-beasts heads followed him with its inscrutable gaze, the other stayed fixed upon Corswain.\n\n\"That might work in the real universe, but not here. You are in my realm now, or at least teetering upon the brink of it. You cannot ignore me this time.\"\n\nI do not treat with aliens, said the Lion, taking a few more steps to his left, closing the gap between himself and the nephilla.\n\n\"Alien? Alien?\" There was despair in the voice. \"I am more than some simple creature of your universe. I am the giver and the receiver, the crux of fate, the master of the parallels. The past and the future are laid before me. Do not mistake me for some petty foe to be vanquished by mere might of arms.\"\n\nYou have nothing to offer that I will accept. The Lion was directly behind the creature now, its snake head still regarding him with an unblinking stare while the vulture transfixed Corswain.\n\n\"That is not true. However, you do not desire power, that much is plain. Your ambition is woefully stunted for one of your abilities. You are happy to let your brothers dwell in the light of your fathers adoration. You even sacrifice your own to stay true to the memory of what once was.\"\n\nThe two necks were starting to cross each other as the Lion continued his circling. He resisted the lure of the accusation in the creatures words, which echoed with the taunt made by the Night Haunter.\n\n\"Freedom, Lion of Caliban. I can give you freedom. You know that you do not really care for these lesser beings. They are a distraction to you. Their frailties, their petty squabbles, are unnecessary trifles to be avoided. Even this war that you fight, it is without consequence.\"\n\nHorus cannot be allowed victory.\n\n\"Horuss victory is not your concern. All things are fleeting, even the lives of great Warmasters. I have witnessed the rise and fall of every civilisation in the universe. None of them can endure, Chaos always consumes them in the end.\"\n\nThat word  Chaos  resonated through the Lions thoughts. He had a fleeting glimpse of eternity, of the entropy of the universe, ever changing, new lives born out of death, of stars decaying to create worlds and worlds dying to form new stars, all in constant flux.\n\nThe Emperor has shown us a new way. The Imperial Truth will endure for eternity.\n\nLaughter resounded inside the primarchs skull.\n\n\"Foolish! Your Emperor is nothing more than a fraudster with grand ambitions. His empire is no greater than any other edifice of Mankind, and it will tumble just as easily.\"\n\nThe words were spoken with scorn yet they lit a spark of hope in the Lions breast  the creature spoke of the Emperor in the present tense. It thought that the Master of Mankind still lived. The nephilla could not follow the Lions progress any further with its snake eyes, and for a moment it broke its gaze from Corswain, serpentine head swinging towards the seneschal while its vulturelike visage fixed on the primarch.\n\nIt was only a split second but it was all the Lion needed.\n\nBefore its gaze was on Corswain again, the Lion launched himself at the nephilla, sword outstretched. With astounding speed it reacted, twisting its whole body in his direction, staff coming up to spew forth a sheet of forking energy.\n\nKill it, Cor! snarled the Lion as wreaths of crackling energy enveloped him, sending pain coursing through every limb, surging into his chest and pounding in his head.\n\nWith a roar, the primarch broke free from the net of lightning that surrounded him, still lancing his sword towards the nephillas body. A hail of fire hammered into the creature from the encircling Dark Angels as Corswain leapt away, the seneschals bolt pistol spitting rounds.\n\n\"Predictable fool.\"\n\nThe nephillas staff swept out, turning aside the Lions first blow. Twisting, wings furling, the creature side-stepped the Lions charge, its serpent head lashing out towards his throat with bared fangs.\n\nThe Lion turned mid-stride, dropping Hope which had been deflected by the nephillas parry. His gauntleted fingers curled around the slender serpentine neck as the primarch allowed himself to fall to the ground. His grasp unbreakable, the Lion dragged the nephilla down with him, its chest plunging onto the waiting point of Despair.\n\nHarmed but not slain, the nephilla reared up, taking the sword from the primarchs grasp, wings spreading once more, now bat-like and shimmering gold. Its vultures beak rammed into the side of the Lions helm as it sought to pull its other head free from his grip. Wings beating fiercely, it tried to lift away, but the Lions grasp held firm as he was pulled back to his feet.\n\nDid you see this coming? snarled the Lion, hammering his fist into the pommel of the half-buried sword, driving the blade fully into the nephilla. The primarch felt a moment of contact, something deep within him connecting with the substance of the nephilla. His anger raged, finding conduit through his arm, into his fist, given vent along the blade of the buried sword like white fire pulsing from the Lions heart.\n\nThe creatures piercing shrieks ripped through the Lions mind. Its body burst into a globe of power, filling the chamber with expanding flame that sent the primarch reeling, droplets of the molten sword pattering against his armour.\n\nSilence descended. The black of his armour was covered with a patina of roasted gore and his mind was still throbbing with the death-scream of the nephilla. The primarch picked himself up, retrieved Hope from where it lay on the deck and made his way over to the warp core control panel. Much of it was scorched and broken, and he started to pull away cracked panels to expose the circuitry beneath. He made a quick assessment of the damage and activated the comm.\n\nCaptain Stenius, I will have the warp engines operational in seven minutes. Ready the Geller field and prepare for translation.",
 "title": ""
}