{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "6A5Zg2Et",
 "pasteDate": "Feb 26, 2018, 9:49:56 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Youre 22.\n\nBe turning 23 soon.\n\nAsk parents for Shrek themed party.\n\nJust like the last 12 years.\n\nMom says I'm too old for Shrek\n\nTell her she better check herself before she Shrek's herself\n\nMom asks if I've taken my meds.\n\nI say yes, then ask for an onion flavored cake.\n\nMom says no.\n\nI call her a Farquaad bitch.\n\nShe sends me to my room and tears stream down my face.\n\nJacking off will probably cheer me up.\n\nPull out super dreck MLP Friendship is Magic DVD collection\n\nOpen them up to see five Shrek discs (including Puss in Boots) that my mom thought were in her room.\n\nIts the 171st day of the year.\n\nToday I am scheduled to masturbate to Artie from Shrek the Third.\n\nFap furiously when Artie appears and am finished in seconds.\n\nWipe semen off my chest with Twilight Sparkle stuffed pony.\n\nStart to think about fight with mother again.\n\nGet an idea.\n\nSneak out of room.\n\nMom is sleeping.\n\nGo to shed in backyard\n\nGrab the sharpest tool in the shed.\n\nStand outside Mom's door.\n\nToo chicken to do it. I pray to Shrek for courage.\n\nThe scent of onions fill the room.\n\nA green hand takes the tool from me.\n\n\"I'll take it from here laddie.\" Shrek says.\n\nShrek plants the tool deep in my mother's body ogre and ogre again.\n\nThe stabbing went on for almost an hour.\n\nBlood sprayed all ogre the room and on my body. Especially my hands and arms.\n\nShrek is finally finished with my mother and he looks at me.\n\nI pull off my blood soaked clothes and poke my butt in the air.\n\nShrek picks me up with one hand and uses his Schlong to sweep the remains of my mother off of her bed.\n\nDespite the carnage, it still smells like onions.\n\nBut now the smell of waffles and litter enter the room as well.\n\nDonkey, Fiona and Puss are suddenly at my side.\n\nAll of them are just as nude as Shrek.\n\nShrek flops down on his back on the bed.\n\nBlood pools around him as his weight squeezes it out of the mattress like a sponge.\n\nHe still has me in one hand.\n\nHe skewers me on his shrock and begins using my asshole to pleasure himself.\n\nHis slimy member provides lube, but it does nothing to stop the anal stretching as it flexibly snakes its way through my intestinal tract.\n\nPrincess Fiona jumps on top of me and I silently plead to Shrek that my small dick is enough to please her majesty.\n\nFiona slips my dick into her snatch and it closes in around my penis.\n\nHer ogress pussy vacuums my dick with the frenzy of a Jack in the Box customer trying to get just one little taste of his ogrely thick milkshake.\n\nIt feels as if the inside of my woody is being sucked out my pee hole.\n\nI am now in the middle of an ogre sandwich. An Ogreo if you will.\n\nI motorboat her giant green titties and suck the onion juice out of her nipples.\n\nAll the while with Shrek's green anaconda still slithering inside me.\n\nI turn my head to the left and gasp for breath.\n\nAs I do, Donkey stuffs my mouth with his schlong.\n\nIt quickly finds its way deep into my esophagus.\n\nI am finding hard to breath with Donkey's \"little Donkey\" thrusting within, yet never receding from my gaping mouth as one of my nostrils is filled with snot.\n\nPuss in Boots nimbly climbs up the others and drags his ass and balls on my face.\n\nPuss turns around and I see his small barbed baculum poking out from his fur.\n\nHe examines my two nose cunts and thankfully chooses the one already filled with snot to jab his boner into.\n\nIt is the greatest moment of my life.\n\nI submit myself completely to Fairy Tale Lands finest.\n\nThe amount of movement going in on inside of me is indescribable.\n\nI am now 33% cock.\n\nI reach around and claw at Fiona's rump, trying to get a chance to stick my fist in the greatest woman of all time.\n\nThen, it happened.\n\nShrek and Donkeys foreskin meet together in my tummy.\n\nTheir tips lightly kiss one another, right before spewing a stew of cum inflating my stomach like a water balloon.\n\nSeconds later, I spunk into Fiona's pussy.\n\nMy eyes roll back in my head.\n\nI am breathing furiously yet only through one nostril.\n\nIt isn't ogre yet.\n\nI release a lengthy stream of semen as I never have before.\n\nDonkey and Shrek still seem to be filling me with their love like a hose of sperm.\n\nI am pumping an inhuman amount of jizz into Fiona, when I realize that it must be Shrek and Donkey whose cum is helping to give me extra virility.\n\nPuss's saw like wang is finally running out of mucus to drill out of my nose and it begins shaving off my nose hairs.\n\nMy nose bleeds a thick pink blood-semen cocktail courtesy of Puss in Boots.\n\nAfter about a minute, Shrek and Donkey's ogresm is complete.\n\nSeconds later mine is done too.\n\nI am more satisfied and exhausted than I have been in my entire life.\n\nBut it still isn't ogre.\n\nI look deeply and lovingly into Fiona's green eyes as Puss and Donkey retreat from my orifices.\n\nShe spills forth from her mouth a cascade of all our juices.\n\nIt drenches my face and I squint to see Fiona, Donkey, and Puss all looking down on me with adoration.\n\nBetween gulps, I gargle \"Shrek is love. Shrek is life.\"\n\nI fall gently to sleep with Shrek's penis still moving inside of me and mine still inside Fiona.\n\nI wake up the next morning in my mothers bed to the smell of onions and waffles.\n\nI am alone except for the unrecognizable corpse on the floor.\n\nShrek and the others must have licked the cum all off because all that is left was blood and a floury substance on my hand.\n\nI go to the kitchen to find a plate of onion waffles waiting for me.\n\nFinally I have a family who cares for me.\n\nAfter eating the feast my lovers left me, I went to my room to tell the other brogres online about my Shreksperience.\n\nI find a note on the door.\n\n\"I was thinking about your party, and I decided that you can have a Far Far Away party after all. It is your big day and it is up to you to decide how to spend it. I will bake you your onion cake and make brownies for everyone else. Even though you have grown up into a wonderful Prince Charming, you will always be my special little boy. Love Mommy.\"\n\nPrince Charming?\n\nPRINCE CHARMING?\n\nThat bitch deserved to die.",
 "title": ""
}