{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "7NE0RDWZ",
 "pasteDate": "Feb 21, 2018, 11:27:42 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Luba Petrovici\nthats what i did to chris\ni was mad but i just let him get his feelings out\nbecause i liekd to read it\nbut you would get mad because i wouldnt stop him\n\n15 hours agoJordan Ash\nI got mad at him because he showed ZERO respect for me. If would have shown respect. RESPECT R-E-S-P-E-C-T to me from the start. I HONESTLY WOULD NOT CARE IF YOU TWO HUNG OUT, TALKED, AND ENJOY YOUR SELFS. I honestly would not. You tryed asking him to stop, and he said no. He shows ZERO RESPECT to how you feel, and what you wanted at the time, and the fact that WE were TRYING to work things out, that WE were just in a hole. RESPECT is something you NEED in life.\n\nTyler, Dan, Jesse, George, Noel, and almost every other guy that has ever shown respect. You know where they're at? They're all still there. They are all still your friends. And you know what? Would I care if you went out with them? No. No I wouldn't. HECK You went to the movies with Jesse and George a few times. Sure I joked about how I was jealous, but I knew you went to the first one with them and I know that you enjoyed your self, that you had fun. But I didn't care. HECK you coulda went to the new one with them and told me no because it was a \"Tradition\" and I wouldn't of cared. It's RESPECT in life that others show that he doesn't. Sure he listens to you and cumforts you but in all honesty he's sitting there saying to him self \"Yes I won. I get Luba.\" I bet you any money he's probably sitting there, planning a future now with you, talking about the future, and everything else. I bet you that yesterday he didn't ask how you felt, whats wrong, didn't listen. All he did was listen then make you laugh then changed the subject. It's RESPECT Luba that he does not have\n\n15 hours agoJordan Ash\nYet with me. When you told me that you were mad at Chris, that shit was going down. I sat there and I listened. I offered you advice, and I said what I could to give you the advice I could. I didn't just shove your emoticons in the back and completely change it. I show you respect that I'm sure most your other friends are willing to show you. Cassie obviously wont, but other friends I'm sure they would if you sat down and talked to them. Sure I could have made you laugh, let you enjoy your self but I didn't. I respected the fact you wanted someone to talk to and I helped you. And I didn't stop until you were ready to stop. Thats what a true friend who has respect does.\n\n15 hours agoJordan Ash\nAnd remember the fact that when we started dating? When we started to date I said I hearted you because I respected that you didn't want to get into something fast? I took the time to get to know you better. I took the time to actually get the time to Love you before I said it.\nI RESPECTED that thats what you wanted.\nI bet you, he's probably sitting there, actually I know he is because you told me he told you he loves you before.\nHe's not a friend Luba. He honestly isn't. He's a guy, who will do anything for sex. A true friend sits there and listens to you, and helps you. And you're falling for his trap. You're dragging your self into this mess.\nA friend is someone who listens, who talks to you, and works through everythign else.\nHe will lie his ass off for you, he will do everything he can to get what HE wants. He doesn't give TWO SHITS about anyone else.\nI told you when all this shit was going on that I was willing to give up EVERYTHING. EVERYTHING to make YOU happy.\nBut yet remember when you asked him to give up flirting with you?\nTo stop acting like you?\nTo stop acting like that?\nHe said no.\nHe said no he wouldn't.\n\n15 hours agoLuba Petrovici\nbecause he wantedd me; why give that up\n\n15 hours agoJordan Ash\nHe wouldn't give up something as simple as that.\nBecause luba. He doesn't show RESPECT towards you.\nRESPECT is something everyone needs to show to everyone. My mother tought me this.\nShe reminded me of this last night.\nWhen we were talking.\nI don't care that I don't know Chris, I don't care that I've never gotten to know him. Because based off EVERYTHING I KNOW. The good and the bad. He shows ZERO respect for you and anyone else.\n\n15 hours agoLuba Petrovici\nthen he said he didand he did. i wanted him to keep flirting\nhe respects me very much thank you\n\n15 hours agoJordan Ash\nNo he doesn't Luba. He's driving that shit down your throat. It's all he's doing.\nIf he respected you\nHe wouldn't have doen ANY of the shit he's done\nHe wouldn't of fucked Sam\nHe wouldn't of had sex with that other girl a week ago which I know for a fucking fact he lied about.\nHe wants one thing and one thing only\nI was willing to give up EVERYTHING\nEVERYTHING\nWhat was he willing to give up?\nNothing\nNothing what so ever.\nI RESPECT you\nI don't care what the fuck he says about anything. He will lie his fucking ass off to get what he wants.\n\n15 hours agoLuba Petrovici\nyour not respect me an dmy spcae right now\nplease can you stop\n\n15 hours agoJordan Ash\nWhy should I Luba? Why should I stop? He's an asshole who will lie to get what ever the fuck he wants. I'm sure if some hot girl started to fucking flirt with him, he'd want to fuck her any day. And you told me he told you she was putting on her belt and that he didn't even know why she took it off. That's complete fucking bullshit.\n\n15 hours agoJordan Ash\nThat's the worse excuse I ever fucking heard.\nI show you RESPECT and he shows you shit all.\nHe shows you that he's funny\nto make you laugh.\nHe doesn't talk about your feelings, sure he will ask \"Oh hey, whats wrong?\" Maybe once in a while.\n\n15 hours agoLuba Petrovici\nthere your getting what you want\nleave me the fuck alone please\n\n15 hours agoJordan Ash\nBut really Luba? Does he ask you what's wrong? Does he give you advice? Has he ever given you advice? And in all honesty Luba.\nIf I fucked another girl\nand Loved you\nI'd make up ANY excuse\n\n15 hours agoLuba Petrovici\ndo you need me to take you off of facebook\n\n15 hours agoJordan Ash\nI could think off.\n\n15 hours agoLuba Petrovici\nyes all the time he gives me adivce\n\n15 hours agoJordan Ash\nSure, \"Be with me, not Jordan.\" Is that his advice? That's amazing Advice? Then 2mins later he drops the subject and talks about how big his dick is.\nThere. I'm done my rant for the night.\nLet that sink into you.\nRelise who your TRUE friends are.\nThink about it. Think about who he really is. What he's done, what he's said and how he has acted and how he is acting.\nIf he actually fucking likes you, and wants to take the time to get to know you. He wouldn't be a fucking perv, and all flirty. He'd take the time to get to know you and give you the RESPECT you needed.",
 "title": ""
}