{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "re_sql",
  "re_url",
  "lg_en"
 ],
 "key": "8Qm1WmKy",
 "pasteDate": "Feb 18, 2018, 2:53:26 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "We are a storied clan, originally created to compete in the Chobo Team League. The CTL is a proleague styled teamleague in which teams play each other each week in sets separated by leagues. The top teams at the end of the season advanced to the post-season. Since TeamUR joined the league in Season 2, it has been the most successful team over 17 seasons, garnering 7 championships, and only missing playoffs twice. For more information about the Chobo Team League, go to http://www.choboteamleague.com/. TeamUR is also competing in the Validity Star League (VSL) and All-In the Nydus Team League (Nydus). Both leagues are all kill format, 4v4; VSL uses a set distribution of Platinum-Platinum-Diamond 2/3-Diamond, whereas Nydus uses Diamond-Diamond-Master-Master. If you are looking to join some structured competition but aren't yet at the high master/GM level, then TeamUR is the place for you!\n\nWhy join Team UnRivaled? We're a closely knit and welcoming group of people. The team discord is a great place to hang out and chat. Most of us are also involved in other games, and are always up for talking about games, or even just life in general. As a smaller team with an application process, you can easily form great relationships with everyone, and become part of the Team UnRivaled family. We are about supporting and helping each other reach our goals, whether in StarCraft or elsewhere.\n\nTeam UnRivaled is a multi-media gaming organization, so you'll always find a mature group of fun-loving dudes no matter what game you're curently grinding; let's be honest - sometimes we get burnt out on StarCrafting and just want to play some quickmatch on Overwatch to decompress. We've had teams in Heroes of the Storm, League of Legends, Overwatch, and Destiny 2, so you'll find a place here for whatever you're looking for in those weeks that the ladder in SC2 is just being a bitch!\n\nIf you are interested in joining, please fill out this form: https://kamarill.typeform.com/to/HhsY5L. It's only 10 short questions! After reviewing your application, an admin will reach out to you, most likely on Discord, in order to set up a tryout. Generally, you'll play a few games of StarCraft, and we'll chat about the games and yourself a bit. It's all just to make sure you're a good fit for us, and that we're a great fit for you. Having a microphone is a huge plus!",
 "title": "TeamUR"
}