{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "9NXgcUGH",
 "pasteDate": "Feb 27, 2018, 11:10:13 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Kobayashi, Matsuo listened to the girl's reasoning, watching every bit of physical change that'd occur as pressure was put upon her. The emotions that she let escape were far from enough to ensure her survival. There was no regret, no tears, no begging and no apology given. The Jounin was not satisfied by her answer; her lack of transparency had to go away. His lips parted.\n\n\"Everything is over if you die.\"\n\nThe words he had given to them all when their last semester began were still true. Six months hadn't changed a bit about this fact-- but that wasn't his focus right now. He would let his words echo within the girl's mind as his left hand slowly moved to his blade's grip, fingers curling around it.\n\nThe expression on his face finally changed for once.\nHis eyebrows furrowed into a frown.\n\nMatsuo's presence could be felt now more than ever. The seasoned Shinobi released years of training and battle at once with a piercing gaze that stared into the very depths of the girl's soul. This was no disappointment, nor was it anger: This was pure unadulterated will to kill.\n\nAs the man tightened his grasp on his blade the experience would spread further and further. It was almost as if one would be able to read his next strike without a problem; their minds foreseeing the very steps he would take towards the girl before drawing his blade and cutting her head cleanly off without an ounce of regret in his heart. The thought alone would be frightening to most and the idea of something so violent and gruesome happening right before their eyes without care or second thought showed just how serious the Jounin was.\n\nWhile everyone's imagination was free the run wild as the man's impressive presence could be felt he spoke to break the frigid silence.\n\n\"Is this the end of the line?\"\nKobayashi, Matsuo has activated a perk: Killing Intent!",
 "title": ""
}