{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_attacked",
  "kw_protection",
  "kw_op",
  "kw_target",
  "lg_en",
  "kw_attacking",
  "kw_attack"
 ],
 "key": "9tZgizwh",
 "pasteDate": "Feb 26, 2018, 1:37:26 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "I. STARTING OUT\n------------\nWant to join? Just fill out this short nation sheet:\nNation Name:\nRace:\nColor:\nFluff:\n \nAlso pick a location on the map.\n \nIB. JOINING LATE\nIs totally fine! You will receive makeup actions, and you can take double actions per turn (but no more) until you've caught up.\n------------\nII. STAT SHEET/EXPLANATIONS\n------------\nTRAITS: AKA bonuses unique to your nation - substantial, and cannot be poached by other players.\nFood: Food sources your nation has. (Used to send armies/protective forces out)\nCities/Buildings: Infrastructure of your nation (Different Buildings do different things) \nCurrency: How much money your nation has\nWartech: Tech used in war\nCivtech: Civil tech\nMilitary (Cap): Military personnel your nation has. (You can go over your military cap, but the more you do, the less stable your nation may become!)\nProjects: Ongoing research/construction etc. that your nation hasn't finished yet (Just to keep track of this really)\n\nIII. HOW TO PLAY\n------------\nSimple- three actions per turn (d100s) for whatever you want, as long as it's a natural progression for your nation. Some actions will either take a really long time to complete, however, or just be wholly impossible given the world of the game (OP will let you know if this is the case, and refund your action/give you something more reasonable).\n\nIIIB. CURRENCY\n------------\nWhile rolls and project progress (symbolized by X/X) refer to how long a project takes, currency is used to determine how much effort is put into research/other actions. Not using any currency is the bare minimum, and usually only net nations +1 or +2 in something. However, the more money they invest into actions, the better the modifier they get. (Scales with wealth- spending five currency when it's half your treasury will go a lot further than spending 5 coins when you have hundreds of gold stored up.)\n\nIIIC. DICE CRUSH\n------------\nOver the course of the game, nations may 'crush' (Read: Use up/destroy) related technological bonuses to increase the size of the die they roll. Additionally, you gain a permanent +25 TRAIT that they name and that cannot be scavenged by an enemy if they lose a battle against them. This costs 50 points of related bonuses and increases the size of the die nations roll from 100 to 150. The second dice crush allows the same thing, as well as giving another trait a permanent boost of +10, and increases the size of the die nations roll to 200. The second die crush costs 100 points of related tech bonuses.\n \nIV. DIPLOMACY\n------------\nPlayer/player interactions are almost entirely driven by you, with the exception of needing to discover other civilizations. Talking is free- feel free to RP to your heart's content, discussing trade deals, the state of the world, or just have fun role-playing.\n \nIVB. Training another Nation\n------------\nNote that, while talking to your contacts is free, training them in something costs actions. To trade expertise, you just need to spend an action and declare what you are trading and to whom. Make sure you coordinate the trade in thread before you go trying to trade.\n \nTraining is somewhat different than trading a resource in that you are trading your expertise or experience at something to another nation. For example, player A has a good Marksmanship skill (+20), and they want to train the soldiers of player B some. They don't have to train them using their entire bonus though! Let's say they only want to teach them half (+10). They roll to send trainers to player B, and the next turn, player B spends an action to see how well their people take to the training. The higher the roll, the better they receive the training, with a roll of 100 meaning they receive the full amount trained, plus a little extra! Nat1's, though, mean they don't understand the training at all, and might mean player B's nation will have a harder time learning the skill.\n \nV. COMBAT/WAR AND YOU\n--------REGIMENTS--------\nREGIMENTS are the backbone of your military actions. They roll 1d10 each, plus all Wartech bonuses- think of your regiments each as mini armies, with a bit of everything that makes up an entire army.\n---HOWEVER---\nYou may choose to specialize a regiment you're recruiting if you have the technology for it, to make them better suited for different tasks:\n[Assault]: Assault armies are specialized for offensive warfare. When attacking, they get +2 to their rolls, but when defending, take a -2 penalty\n[Defender]: Opposite of assault armies. Receive +2 to defending rolls, take a -2 penalty when attacking.\n[Cavalry]: Variable. -2 when fighting defenders, +2 when fighting assault armies. No bonus when fighting regular regiments.\n \n----Preparing for War----\n \nWhen you plan on attacking, you may spend a turn in preparation. If you do so, you suffer no penalties when attacking the following turn.\nPreparation can be public, or secret. If preparation is public, you do not have to state who you are attacking or where you are going, but that your military forces are primed and ready to strike.\n \nYou do not have to prepare for an attack and can strike immediately, gaining the advantage of surprise. However, you will suffer a -3 penalty per each combat dice, including special bonus dice, to your combat total.\n \n----Declaring an attack----\n \nYou must use one of your actions to declare an attack. You do not need to roll for this 'action', it is just a placeholder. If you do roll, it has no effect on the outcome. Forces take a turn to march, arriving at their intended target the next turn.\nFollowing are combat rolls, which should occur in a separate post. This post should contain:\n1) all your rolls (Each participating army rolls 1D10)\n2) any pertinent combat bonuses\n3) A declaration of attacking your target.\n \nYour COMBAT TOTAL is your attack dice+Wartech bonuses+bonus dice (if you have any)-any negative modifiers your nation/armies might have\nYou may suffer penalties, assessed by me, if your economy or culture is dramatically overpowered by your opponent.\n \n----Defending from an Attack----\nYou do not have to use an action to defend from one faction. You do have to sacrifice an action if attacked from 2 or more factions.\nEach 2 additional factions that attack you (4, 6, 8) means another action must be sacrificed to defend.\nIf the defender has already posted, they get to choose which action(s) they want to sacrifice in order to defend, as needed.\nIf you have no more actions to get sacrificed, you are 'overwhelmed' and suffer major penalties.\nNOTE: In this case, 'Faction' means any number of nations that have grouped up to collectively attack another nation. If there's another nation that isn't formally part of said alliance, then it is considered a separate attack, and therefore another faction.\n \nSame rules for rolls and combat bonuses apply.\n \nIf you are afraid you may be attacked, you may spend an action preparing a defense.\nPreparing a defense gives you a +3 bonus per combat dice, including special bonus dice, to your combat total, BUT ONLY on the turn directly following your preparation.\nNOTE: Preparing for defense only affects you individually and not any protective forces or allied armies in which you may be participating.\n \n----Protective Forces----\n \nIf you are concerned that an ally may be attacked, you can spend an action and one unit of food to send them protective forces. This will last through the following three turns.\nFor example: if you send protective forces on turn 35, they will be stationed there from turn 36 through turn 38. By turn 39, they will be gone.\nNOTE: The forces WILL NOT be active IMMEDIATELY ON turn 35, but turn 36.\n \nThe advantage is that you can defend immediately if they are attacked, rather than being forced to wait a turn to react.\n \nProtective forces will be logged by the receiving nation in their sheet, along with the turn at which they must be renewed. I.E. [Werewolf Forces - Turn 38]\nAnother action and expenditure of food on turn 38 by the faction that sent them will allow the forces to remain ready without any breaks.\n \nIf you have protective forces with an ally, you can roll defense dice if your ally is attacked, even if they are taken by surprise. This is added to their combat total.\n \nIf it is convenient, multiple units of food and multiple actions can be spent at the same time to extend the time protective forces are in effect.\nFor example, the Werewolves spend 3 actions and 3 units of food on turn 35. Their forces are now protecting their ally turns 36-44.\n \n----Allied Defense----\n \nRather than several nations all contributing protection to each other, which is very inefficient, they may form a single allied force. One faction is declared the leader and must track involvement of other civilizations. The leader is also responsible for reporting the activities of the allied army to the GM.\nForces are contributed to the allied army in the same manner as before, by contributing food and an action. This keeps their share up for the usual three turns, before more food and another action is required.\n \nThe allied army can defend a limited number of locations. These locations do not have to be public.\nAllied armies themselves, and their member states, are always public\nThe number of locations that can be defended by the army depends on its membership - 1/2 its members, rounded down.\nThe location of the army is determined by members, and submitted to the GM by the allied leader.\nThe location can be changed once per turn, and only at the start of a new turn. It is best to inform the GM at the 'end' of the current turn where the army should be at the start of the next turn to avoid issues.\n \nWhen the army defends, all members roll and all dice are pooled together.\n \nIf a member that is not being actively defended is attacked (the allied forces are in another location), they may still roll their own defense dice as usual.\n \nIt is possible to reach a level of friendship and closeness with another civilization that their defense becomes shared by default. This will typically require relatively involved projects over several stages.\n \nVI. ESPIONAGE/SECRET ACTIONS\n------------\nSometimes, it may be to your advantage to take action or complete a project without other players knowing.\n \nFirst, inform the GM (PM me in the Discord), who will then set a DC based on your civilization's development and the nature of the action.\nThen, write up an agreed-upon 'fake action' and roll in the thread as usual. The fake action can be as simple or elaborate as you'd like; the goal is to fool other players.\n \nIf your dice, plus any applicable bonuses (spies, scouts, etc), meet or exceed the DC, your action is completed without alerting others. Some actions may require multiple rolls or various DCs for different steps.\nIf you fail to beat the DC with your roll, you may still complete your action, but the public will be informed and your secret revealed. Players that would be directly affected by your action will specifically be informed.\n \nExample: The Elves want to attack the Werewolves. They write a 'fake action' that involves them gathering in the woods for a cultural festival, when they're actually preparing for the attack.\nHowever, they roll under the DC. The elves successfully prepare for the attack, but the werewolves are informed that they are about to be attacked by their scouts. This provides time for an ally to come to their defense.\n \nAny secret resources or bonuses will be logged by the GM in a separate document until they are revealed.\n \nYou may roll to 'research' an opponent (another secret action) which will let you see their secret information. If you fail, however, they will be alerted and you cannot attempt research on them again for 3 turns.\nNOTE: If you cannot access the Discord server for some reason (Like if it's banned in your area), alert me in the thread. We might be able to work something else out.",
 "title": "Nations of Lost Valley"
}