{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_patches",
  "kw_error",
  "lg_en",
  "kw_bug",
  "kw_twitter",
  "kw_patch",
  "re_url"
 ],
 "key": "9ytmbCZR",
 "pasteDate": "Feb 26, 2018, 2:46:20 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "ESPORTS and COMPETITIVE changes from pros\n\n\nTo start out I want to give a quick introduction of myself to give some credit to this post. My name is Interrogate, I've been playing PUBG since EARLY ALPHA, through BETA, through EARLY ACCESS, and through FULL RELEASE. I am very committed and dedicated to this game. I play on a pro level under Team Totality and I compete in every league and tournament there is currently. I've also been to two PUBG lan events, Gamescom and IEM Oakland. I currently have 2732 steam PUBG hours not including the hundreds and hundreds from alpha/beta. These are the changes that myself and the pro/competitive community feel need to be fixed to keep the game and the esport relevant. This post is not meant to be a bashing post or negative post. It is meant to be constructive and provide solutions and replications to help fix the game as well as bringing light to certain bugs. I understand that a lot of these issues have been talked about and are probably known by PUBG corp, but we must keep pressing the important issues that need to be prioritized. Hopefully you have time to read it all and watch the video after you've read.\n\n\nGame breaking bugs and issues that need immediate attention:\n\n\nWater Penetration - Since the start water has been an issue. Its understandable that it may be a hard fix, but at this point the game needs SOMETHING. Anything will be currently better then it is. Heavy damage drop off in water with ANY weapon, much harder to get breath, fatigue system, lower the breath amount, extend head outside of water more, literally anything at this point would be better then nothing. Since the start PUBG's slogan was \"ThisIsBattleRoyale\" which represented aggression, fighting, and winning good games. Water has taken the fun, competitiveness, skill, and fighting out of the game. People go water to get high ranks and placements because it is always a safe option when you have no other options. Water is a coward way to get high ranks and undeserved achievements and it skews teams performance on paper. ThisIsNOTBattleRoyale\n\nCircle algorithm to NOT go to water - Same as above. There needs to be some sort of algorithm to avoid water circles, but not in the first circles. We understand you cannot remove water from the equation because the circles need to be able to shift near edges of the map, or military base to create diversity in circles and gameplay. BUT... After a certain amount of circles, I would say 2-3 circles maximum the circle should have zero water. Having a super late game circle (top 10 scenario) where the circle is more then 50% of water is absolutely unacceptable in competitive. Take IEM Katowice as a good example of high quality circles. There was almost no water in any late game circle. Only water in a couple starting circles which is fine, but the quality of games was much better without water. No one got undeserving water placements or climbed the ranks from taking advantage of the water.\n\nSeeing through smoke from blue zone - There is a very abusable bug currently that when you throw a smoke grenade and the blue zone is visible behind it the player facing the blue zone can see through the smoke with a clear silhouette of whatever \"skylines\" on the horizon. Players are using this advantage in a lot of scenarios whether they want to or not. Some players are abusing it to its fullest to stay competitive and win games. Its uncounterable and makes certain situations unwinnable because when smokes are your only option and they can see through them your team is dead.\n\nCrouch spamming cancels meds, boosts and ADS. Also gets you stuck - A very frustrating bug recently is spamming crouch cancels healing items, boosts, and aiming down sights. It also can still get you stuck in place when crouching and jumping even though it was said to be fixed in a recent patch. This issue mainly started in the past couple of patches. If you try crouch spamming near vehicles, trees, or on sloaps and slants your ADS and med supplies can cancel and bring you to a regular stance. This is extremely difficult for pro and competitive players because using crouch a lot during fights and while healing is imperative to staying alive. Players at this high level can kill you instantly if you are limited in movement and this bug certainly limits how you can use crouch. Its of high importance. \n \nAny bug that can instantly kill you from no fault of your own - There are plenty of bugs that can lose you a game instantly. We've seen it many times on videos like Dearsomeone's highlights and twitch clips. They were funny during the early stages of PUBG and provided some great content... but its now release, there are hundreds of thousands of dollar tournaments, people are making careers out of professionally playing or streaming, and are being paid to play. The community feels at this point that these bugs should be seriously looked at and eliminated. These bugs can lose tournaments and even can ruin a casual competitive gaming experience trying to climb the leaderboards. Here is a list of extremely common and EASILY REPLICABLE bugs that have been in the game for many many months that instantly kill you: 3 seater bike driving into a thin pole or tree between the side car and bike and blowing up, getting stuck between vehicle and an object or building when ejecting and dying from \"falling\", getting hit by your own or enemy vehicle while it is moving at an extremely slow speed, getting stuck in holes or objects indefinitely and having to leave the game or die, parachuting in a spot you cannot escape, parachuting bugging on top of a tall building or structure and falling to death, getting smacked by a 2-3 seater bike when standing it up and dying, hitting fences that should break but dont and either dying by vehicle explosion from the damage it inflicts on your vehicle or blowing up because it gets stuck, vehicles, primarily bikes colliding with other vehicles and exploding or shooting either vehicle in the air and exploding on landing. There are plenty more but I think this gets the point across. If a PUBG corp dev wan't more video examples or situations I would be happy to reproduce or find clips. These need to be fixed so we can make the game smoother and make the overall gaming experience much more enjoyable and fair.\n\n\nGame changes and upgrades to keep esports and competitive alive:\n\n\nWorking rank system - This is one thing that I know is huge for many professional and competitive minded players. Right now in PUBG there is no skill based match making system. Rank 1 players can play against rank 5 million players in the same games. Back in early access season 1-3, BEFORE FIRST PERSON PERSPECTIVE was introduced, there was skill based match making. Myself and many other pros were ranks 1-100 playing against eachother almost every game. We could recognize a majority of the players in our games near the late game circles and it was always very intense and difficult games. PUBG was so fun at this time there was always a challenge and always great opponents in almost every game. You could climb up and down leaderboards knowing how much rating you will win or lose and it was a tough grind to the top. Just so everyone knows there were still hundreds of thousands of players playing at this time so it wasn't a coincidence or that there were very few players. Games specifically started and we knew they were high rated games because the player count didn't instantly fill, it specifically was choosing who was in our games and slowly filling. We knew skill match making was working because if you went on a fresh account unranked the games would instantly fill with 100 players. Since First Person Perspective came out something had broke or got removed from the match making system. For many seasons and leaderboard resets, and many months there still is no skill based match making. Pro players and casual competitive players are constantly playing against very very low skilled players and its simply not fun for either parties to play the game anymore. The low skilled players get pummeled, and the competitive players dont have any challenge or fun beating them. Games are super easy to win and people can easily get 90%+ win ratios. You don't see 90% win rates often because the competitive gamers have given up trying to take public match making seriously and do hot drops in pochinki, school, military, and pecado. The only thing that competitive gamers get out of public match making is gun and aim practice, besides that they don't care if they die or leave the game and leaderboard ranks are irrelevant to them. SOLUTION: Please PUBG corp, bring back the old system or create a new one. Something similar to all the other competitive games. Overwatch, League of Legends, and Starcraft have the best systems I know of for competitive match making. Bronze, Silver, Gold, Platinum, Diamond, Masters and then a TOP TIER rank known in those games as Top 500, Challenger, and GrandMaster. There would be great skill based match making and easy to have the system just put similar skilled players in the same games and there would also be a top tier ladder for the pros and highly competitive players. A ladder where they can get knocked out of to the lower tier or rise to be the top in the game. Something like this needs to be in place for such a large population that play this game. There are just too many players to have a rank 4,230,530 player in a game with a rank 1 player.\n\nRewards, progression, or achievements - To keep the game enjoyable and entertaining from the casual players to the pros there needs to be something to achieve or work towards. Currently the only thing achieveable is BP and leaderboard rank, both of which are pretty unimpressive. BP gives you a bunch of low interest skins with a very rare chance to be a good one which is pretty cool, and leaderboards are ruled by people who just play a whole ton or cheaters. Leaderboards also only show top 10 and besides that your skill is unoticed. SOLUTION: Follow lead of other games, end of season rewards for \"Top 500, Challenger, GrandMaster\" like a boarder or player icon. Maybe a tshirt skin or badge that you can put somewhere on your character. Maybe something like the PlayerUnknown Coat has with the badges on the jacket. Anything that someone can be excited to work towards over a season and keeps their interest. Also being able to see more then just the top 10 on the leaderboards would encourage people to keep moving up even if they cannot achieve top 10.\n\nSaved/Preset custom server settings - This is a must. With hundreds of numbered inputs and settings per tournament or scrim, there are bound to be human errors. One number typed incorrectly on a circle size, speed, or damage can completely ruin a tournament or scrim game, and ruin chances of teams doing well. Custom servers take long to create because of all the inputs of circle settings, loot, and red zones that it also hurts spectating PUBG because viewers have to wait long between matches. If there was a problem in the settings and having to restart the game can potentially hurt many teams who were having great games or positions which could result in them winning or losing an entire tournament. Having custom presets allows for quick custom creation, better viewer experience, and better player experience with no human error mistakes. This also benefits the game as a whole by helping streamers and PUBG partners create fun and new game modes for their viewers and community efficiently while streaming.\n\nBetter communication with pros and community - PUBG Corp need to simply get more involved. When the game originally came out in Alpha, Beta, and even early access there was so much communication which built this company up for many players. We loved the constant updates and tweets with what is going on in the company. Showing us sneak peeks of the new guns, showing pictures of your meetings, showing pictures and video clips of what the devs are working on, giving us detailed and accurate patch notes, and listening to us on twitter and forums. You guys had it all. Weekly patches were coming out, then monthly patches, then no patches. We have issues like I stated above that have been around for MONTHS without attention. We need the communication if these issues will be fixed or not. A lot of frustration comes when we keep encountering these issues and they are ignored and not fixed, not even mentioned in patch notes or dev blogs. Also with large PUBG LAN tournaments like IEM, I feel like it never can hurt to get more involved with advertising the events in game like what was done with Gamescom. Having a small box with the dates and times, and linking to the stream/website would be fantastic to keep building the viewership of the game and getting exposure.\n\nMore custom server access for esports, not less - Esports teams had the majority of their custom access removed and I believe it should be the other way around. Esports teams and tournament organizers use custom servers more then most, thats how we practice and break down the game at the highest level and compete/scrim eachother for top tier practice. Taking the majority of our custom server access just cripples esports to continue to develope and succeed.\n\nSupport video for the post. Devs please watch for bugs and recreations: https://www.youtube.com/watch?v=UjumqkqYv34\n\nThanks for reading everyone, we all hope that PUBG corp can implement some of these changes in the upcoming road map. Please feel free to discuss and provide feedback on if you feel these changes are important to the games success as a competitive FPS and esport.",
 "title": "ESPORTS and COMPETITIVE changes from pros"
}