{
 "espireDate": "1D",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "re_sql",
  "lg_en"
 ],
 "key": "ahpPqqQ1",
 "pasteDate": "Feb 18, 2018, 4:45:42 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "Dustoff (85) has posed:\nDustoff is fine with this. Valour can do what he needs to do and go. He'll just cover the exit and make sure the bullets come his way, for the most part, and he draws a quick bead on Swivel to fire off another shot at her head. Or face. Or whatever happens to get in the way.\n\nBlurr has posed:\n    Blurr manages to hit the right switch, and the ventilation systems hum to life, sucking the clouds out of the room quickly. He'll have to explain this to Operations later. This has given Valour the opportunity he needs, and by the time the smoke clears, the seeker has already flown off. \"Ugh,\" Blurr grumbles, searching for the other mech, if he is indeed still here.\n\nSwivel has posed:\n    There is a sharp cry emitted from Swivel followed by a clatter, and as the smoke clears, she can be seen staggering back, with her hand covering her face, energon leaking between her fingers. The standard issue firearm she had has fallen to the ground as she gropes around for something to steady herself against.\n\nDustoff (85) has posed:\nDustoff walks towards the staggered Swivel, bringing his rifle up and holding it point-blank to her head. He just sort of looks at her a moment. \"Well...much as I'd love to stay and take you apart...afraid I've got to go as well.\" He flashes her a grin, a mocking salute, and then transforms as his tires squeal and fight for purchase. \"Hope I can see those internals of yours some day soon, little thing. Looks like you've got some interesting little quirks going on there.\" And, with that, he's gone to join Valour at the extraction point.\n\nBlurr has posed:\n    Welp, there he went. Blurr sends some potshots Dustoff's way as he drives off, but doesn't try to pursue otherwise. \"Hmph. That could've gone better.\" he sighs. \"Let's uh, figure out what they took, I guess.\"\n\nDustoff (85) has posed:\nDustoff hits the accelerator as Blurr shoots his way, causing his rear tires to slip and shake his rear bumper at the Autobot.\n\nSwivel has posed:\n    Swivel's hands part just enough to peek through her fingers, at the rifle pointed at her head. This... is not a completely unusual scene for her. She's stared down barrels of several dangerous weapons in her recent past. And though her fuel pump is picking up and working hard, she is eerily calm. Calm. And... nothing. The things Dustoff says are... vaguely reminiscent as well, which causes another prickly surge of fear. But the femme remains rooted to the spot. And yet... she's spared. Spared to fight another day. Frag. \n\n    Once both Decepticons are gone, Swivel slowly moves her hand away from her face, staring at the energon stained servos. She's silent for a moment before she looks over at Blurr. \"Roight... they'll be wantin' that in th'report...\" Swivel puts her hand back to the wound on her face. REpairs can wait.",
 "title": ""
}