{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_de",
  "re_email",
  "re_url"
 ],
 "key": "AQuP6j4R",
 "pasteDate": "Feb 10, 2018, 5:35:09 AM",
 "relevancy": 3.0,
 "relevant": false,
 "text": "1. Du brauchst gute / sehr gute Combos! 2. Wenn du gute Combos hast brauchst du Proxys! (http://proxyserverlist-24.blogspot.de ) 3. Downloade dir den AllInOne Checker! Link: http://www.mediafire.com/file/44t942ll4rjrkes/All-In-One+Checker_v24721.rar  4. ffne die Datei! 5. Wenn du nach einem Passwort gefragt wirst musst du die heruntergeladene Datei wieder lschen und nach einem Crack von AllInOne Checker suchen! 6. Fttere den All-In-One Checker mit deiner Combo und deinen Proxys! (oben groes Feld = Combo /// darunter links das Feld Proxys) 7. Stelle dort wo 150 steht eine 300 ein! 8. Whle aus ob http/socks ! 9. Rechts bei dem kleinen + @mojang.com hinzufgen! 10. Wenn du Hits hast ist in dem Ordner den du heruntergeladen hast ein neuer Ordner mit dem Datum von heute. 11. Ordner ffnen und die mojang textdatei ffnen! 12. Das was hinter dem @ steht kopieren zbsp: benlukas@gmail.com das @gmail.com kopieren! 13. In Google einfgen und suchen! 14. Die meisten Seiten sind nicht auf deutsch! Suche nach Bildern/ etwas was so wie Email klingt! 15. Wenn du das gefunden hast ganz normal Email + PW aus der Mojang Textdatei einfgen. 16. Wenn du Email zugang hast auf http://Mojang.com gehen und Passwort vergessen auswhlen. dort gibst du die email an bei der du gerade zugang hast. 17. Eine Mail wird an diese bestimmte Email gesendet ffne sie und klicke auf den Link! 18. Dort kannst du ein PW aussuchen. Wenn du das gemacht hast melde dich mit der Email und dem neuen Passwort an! 19. Wenn dort etwas steht von \"Import old Minecraft Account\" ist es ein Demo Account! = bringt nichts. ---> Vorgang wiederholen! 18. Wenn du nach Sicherheitsfragen gefragt wirst geh auf \"vergessen\" unten und lass dir wieder eine Mail senden! 19. gehe auf den link und ndere die sicherheitsfragen zbsp zu 123 und gehe auf speichern! 20. Wenn dann dort steht das du einen MC Account hast, hast du deinen FA! 21. Am besten Email ndern!",
 "title": ""
}