{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en",
  "kw_privacy",
  "re_url"
 ],
 "key": "atLbf3Dn",
 "pasteDate": "Feb 24, 2018, 5:24:26 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Hi LL,\nAnother merchant is using my brand name as a keyword and is clearly violating the keyword spam policy.  I have flagged each listing months back and you have not delisted the items.    This is (a) frustrating for customers legtimally searching for Scarlet Creative and (b) is a long time to leave listings in violation up without resolution.\nCan I ask you remove my brand name from their keywords as they do not have permission to use or resolve it with the merchant with delisting/normal approach you take for flagged items.  You will note I am not the only brand they use in their keywords, they use Dust Bunny, Inverse etc etc.\nHere are the items concerned so you can see I have flagged them some time back and no action has been taken.\nLINKS REMOVED BY ME FOR PASTING\nImage showing I already flagged this some time back\nLINKS REMOVED BY ME FOR PASTING\n\nPer TOS:\n\"Keyword spam is the use of words (such as brand names, item names, or other terms) that have nothing to do with the item listed so that the listing will appear in search results. Keyword spam is not allowed because it clutters the SL Marketplace and makes buying and selling more difficult. In addition\"\n\nThanks so much!\n\n\n\nJagix Linden\nsaid about 7 hours ago\nHello Charlotte Bartlett,\n\nThank you for contacting Linden Lab Support. We understand your concern regarding the Second Life Marketplace listings. If you believe the listings violate the Second Life Marketplace Listing Guidelines or the Second Life Terms of Service, please flag them for review. \n\nSecond Life Marketplace Listing Guidelines: https://marketplace.secondlife.com/listing_guidelines\n\nSecond Life Terms of Service: http://lindenlab.com/tos\n\nFlagging the item will allow our Marketplace team to review the listings further. You may find the below information useful regarding how to flag a listing.  \nhttp://community.secondlife.com/t5/English-Knowledge-Base/Shopping-in-the-Second-Life-Marketplace/ta-p/700189#Section_.3\n\nLocate the listing. \nOn the right side, click Flag this item. \nIn the Reason for Flag drop-down, please select a reason.  \nIn the Detailed Reason drop-down, please select a reason.  \nClick Flag. \n\nIf you have further questions regarding this topic, please feel free to respond back to this ticket. For all other questions, please submit a new support ticket. \n\nBest Regards, \n\nJagix Linden\nAccount Specialist \nLinden Lab\n\n\nCharlotte Bartlett\nsaid about 3 hours ago\nHi please see my comments above (please see my original ticket above) you will note these HAVE been flagged for an excessive amount of time.\n\nYou need to remove my brand name with immediate effect.\n\nThanks so much\n\nJagix Linden\nsaid about 1 hour ago\nHello Charlotte Bartlett,\n\nPlease be advised that, due to privacy concerns, we cannot comment on the results of your Flags. Per our previous message to you, flagging the item will allow our Marketplace team to review the listings further. You may find the below information useful regarding how to flag a listing.  \nhttp://community.secondlife.com/t5/English-Knowledge-Base/Shopping-in-the-Second-Life-Marketplace/ta-p/700189#Section_.3\n\nLocate the listing. \nOn the right side, click Flag this item. \nIn the Reason for Flag drop-down, please select a reason.  \nIn the Detailed Reason drop-down, please select a reason.  \nClick Flag. \n\nIf you have further questions regarding this topic, please feel free to respond back to this ticket. For all other questions, please submit a new support ticket. \n\nBest Regards, \n\nJagix Linden\nAccount Specialist \nLinden Lab",
 "title": "LLSUPPORT"
}