{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_threat",
  "lg_en"
 ],
 "key": "bGM7DmPy",
 "pasteDate": "Feb 20, 2018, 8:29:58 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Yesterday, 22:51:33Trainer Nero: -In response to the turn of her head, he would touch his lips carefully against hers, only to tip his head away after a second, looking away from her, with a flustered huff.-\nYesterday, 22:56:18Skinnys: [ She realizes what happened there and is unable to meet his gaze herself. ] H-Hey, you okay? [ She reaches a hand out to touch his cheek, but stops. ] . . .\nYesterday, 22:58:06Trainer Nero: -Slowly his gaze would turn back to her, eyeing the girl for a second.- Y-yeah, why? -A hand reaching up, he'd slowly slip his fingers between her own.-\nYesterday, 23:01:13Skinnys: Nothing. I mean, you ar-- Youre just always so cool about things, i-idiot. [ While one hand was intertwined with his fingers, her other shot up and covered her mouth. She couldnt believe she was stuttering this much. How embarrassing and uncool. ]\nYesterday, 23:03:32Trainer Nero: Well... I mean, this is a little different, isn't it? -He asked with a soft tone. Offering a gentle squeeze to her hand, and flashing her a smile. His other hand would reach up to take her wrist, slowly attempting to move it from her lips.-\nYesterday, 23:07:38Skinnys: Yeah, it is [Her eyes finally leveled to his, her cheeks flustering a little bit.] D-Dont tell anyone that I'm like this or Ill kill you. [She shifted so she was partially under him, hiding perhaps?]\nYesterday, 23:10:54Trainer Nero: -A soft laugh drifting from his lips in response to her threat. His body moving, so that he was hanging over her completely, his weight supporting by his hands and knees. His head leaning in slowly, his movements unsure, only to have his lips touch gently against hers once again.-\nYesterday, 23:16:45Skinnys: [ She didnt move when his lips met hers, at first. But gradually she loosened; her small arms reaching up and slowly wrapping around his neck. Her lips parted against his as she anxiously slipped her tongue between his.]\nYesterday, 23:22:45Trainer Nero: -His lips would press more firmly to hers, as he felt her accept the affection he was paying her. Lips parting along with hers, tongue pressing against her own wet muscle. Head tipping sideways to allow further closeness.-\nYesterday, 23:29:04Skinnys: [ She murmured something in the kiss but all words were lost. Her slender fingers ran through his hair, knocking the signature blue hat right off. Her leg shifted so it was inbetween both of his as she deepened the kiss. Her tongue ran across his muscle, and she pulled away slightly to reveal a string of saliva that connected both of their mouths. ]\nYesterday, 23:32:44Trainer Nero: -As she pulled back, that soft pink tint would return to his cheeks. His body lowering to rest gently atop hers, head resting against her shoulder, lips touching softly against the lobe of her ear and placing a tender kiss against her neck.-\nYesterday, 23:39:26Skinnys: [ A shiver ran down her spine when his lips touched her soft skin. Was this all really happening right now? Her body relaxed under his own as she slipped her hands under his shirt. Her nails lightly gripped his back. ] . . . [ Her petite legs began to wrap around his but she stopped, unsure of herself. ]\nYesterday, 23:42:05Trainer Nero: -His back arched, and there was a sharp intake of breath near her ear, as those nails gripped against his back, but he relaxed quickly. Lips pressing against her neck several more times, leaving small wet marks where each kiss touched down, before his teeth took her earlobe, tugging gently against it.- I really like you, you know; so go ahead. -He would whisper softly, allowing his warm breath to roll across her ear.-\n23:49:28Skinnys: I-I.. [ She was embarrassed at the others affectionate words, the apparent blush that appeared over her cheeks obviously showed it. She liked him too, was one of the things she wanted to say, and shes never been so close to anyone before like this. But the phrases never escaped her lips. Instead, she wrapped his legs over his waist and pressed her lower half against him. ]\n23:53:35Trainer Nero: -Teeth releasing her earlobe, he would leave a trail of kisses alone her neck, small little wet marks as his lips pressed nearer and nearer to her throat, and then her chin, placing one last kiss against her; lips sealing with her own once more. His hips moving, swaying his and hers alike, as her legs wrapped around him.-\n0:02:17Skinnys: [ When his lips meet hers once more, she lifted her head and lightly, but playfully bit his bottom lip. A small giggle escaped her lips as she suddenly turned and rolled him over so she was on top this time. Her head bent down so it was leveled to his adam's apple and her hair gently touched the side of his cheek. ]\n0:10:23Trainer Nero: -He was glad that she had giggled, to him it meant that she was actually enjoying it, even though she hadn't responded verbally to him. He offered a startled sound as she rolled him over, and straddled his form, head tipping to the side as she leaned over him, his hands reaching out to touch against her slender sides.-\n0:16:38Skinnys: [ She let out a soft sigh near his neck before gently kissing it; trailing her lips down to his collar bone. Her lower half was still straddling his as she gently rolled herself against him in circular motion. It was getting unusually hot in the room now and it seemed like her clothes were horrible, horrible restrictions, though she didn't take them off yet. The hairs on the back of her neck stood as she slowly licked the area between his neck and his shoulder. ]\n0:20:21Trainer Nero: -His fingers touching against her sides still, gradually slipping under the fabric of her top, to drag slowly along the bare flesh of her sides; slowly pushing her top up, inch by inch, exposing more of her bare flesh to his exploring fingers. His hips pressed upwards, moving in a counter motion to her own hips, causing him to utter a soft grunt. A shiver trailing down his spine as her tongue touched against his flesh.-\n0:37:42Skinnys: She slowly kissed that area of his once more before sitting up. A slight breeze of cool air hit her as his fingers trailed along her side, slowly lifting the cotton fabric off her skin. Something of a groan escaped her lips as he did so, and she began to unzips his jacket, moving his arms so she could slide it off of him quicker. She went for his shirt now too, fumbling slightly. She was nervous after all, and anxious.\n0:41:53Trainer Nero: -He would leave her sides for a moment as she fumbled with his shirt, though only long enough to assist her in removing his shirt, and then his hands would return to her sides. Still fussing with her shirt, which was considerably tighter than his own. But finally he'd get it off, allowing the cool air of the room to sooth her warm flesh.-\n0:46:41Skinnys: She pressed her chest against his, taking comfort in their bare skins touching. Something about this moment was appealing to her and she liked the smell of him. She shifted a bit so her pelvis area was against his and she pressed it against him through her jeans. Her face turned a brighter shade of pink, but she didn't really care at the moment. She drew her face closer to his now and kissed the top his nose, then tilting her head over and playfully licking his cheek.\n0:56:05Trainer Nero: -Uttering a soft groan as she leaned in against him, their hot bodies pressed together. His own hips pushed up to grind against hers, his arousal now clearly evident. Head turning as she licked at his cheek, allowing his lips to touch against her tongue, before meshing with her lips, greeting the wet muscle again with his own. Writhing against hers, just as their bodies were.-\n1:04:06Skinnys: Her tongue ran against his and she endulged herself more into the kiss. Her hands sneakily ran down his stomach to the sides of his pants. She hooked both her index fingers on the sides of his jeans and began tugging them lower, but stopped before his thing would pop out. She left his lips and began slowly trailing down again, leaving wet marks down his neck and eventually to his chest. She began making circle motions with her tongue around his belly button.\n1:13:14Trainer Nero: -His eyelids fluttering closed as she welcomed the kiss yet again. Though soon they would spring back open as he felt her tugging his pants down, and her lips part from his, eyeing the girl as she moved slowly down his torso, peppering his chest and stomach with kisses. His hands moving to rest atop her head as she moved, fingers gently toying with her hair, the anticipation urging his arousal on even further.-\n1:20:09Skinnys: Something about his hand grasping the top of her hair excited her. Her kisses moved down along his happy trail before stopping at his waist. She sat up just a bit, though still hunched over to get a better look at the top of his boxers. Air wouldnt come out of her lips or nose and she stopped breathing for a bit. After a few seconds though, she gathered her senses together. Her fingers tugged down the rest and his firm member sprang up and slightly hit her on the chin, causing her to flinch and close one eye. She was very embarrassed now and looked over at him. \"A-Are you ready?\"\n2:07:52Trainer Nero: -Teeth would pinch his bottom lip, watching as she fussed around with his pants, and resisting a chuckle as his stiff length aprang up to strike her chin. The flesh of his arousal hot and throbbing from their previous activities. Fingers still toying with her hair, twirling several strands around a single digit. His other hand reaching out to cup her cheek tenderly, his vision locking with hers, cheeks tinted a red to rival her own. After a moment more, he would nod slowly.-\n2:15:36Skinnys: One of her hands gently grabbed the end of his shaft and her other was on the bed beside his leg, propping her up. Her head slowly went down closer to his member, though not touching it and her lips parted a bit. A small string of saliva ran down her lips, and chin, and dripped onto the tip of his head. She waited until it slowly slid down his pink muscle, before positioning his tip towards her mouth. Her hand moved his shaft in circular motions against her lips for several seconds before she parted her lips and let her tongue gently run over his head. The tip of her tongue tenderly prodded at the small opening on top of his pink flesh.\n2:15:37Skinnys: Her cheek turned a brighter shade of pink and she lightly tugged at it, letting the skin move up a bit. She took the tip into her mouth and sucked on it, letting the wet slippery noises fill the air.\n2:25:54Trainer Nero: -A grunt, mixed with a groan, would catch in his throat as he felt her warm saliva trailing along the length of his swollen flesh, the pleasurable effect increased by the warmth of of small hand tugging against it. His hand caressing her cheek several more times, before it would withdraw, resting at his side, the other still atop her head, toying with her hair, and placing a very small amount of pressure against her, as if to urge her to treat him to more of her attention.-\n2:32:20Skinnys: She went down further until she felt his tip touch the back of her throat. A muffled gasp escaped from her lips as she drew back to take a breath of air, and went down further. The corners of her eyes teared up as clear liquid seeped from the corners of her mouth. She couldn't help the saliva she was producing. Her hand that was placed on his lower shaft positioned itself on his scrotum and gave them light squeeze and she began to wobble her head back and forth. A tingling sensation ran throughout her whole body and she squeezed her legs tightly together. \"..Mmpff.\"\n2:46:08Trainer Nero: She would earn a rough groan as she slid more of the throbbing flesh into her mouth. The sight of her tending to him in such a way, lavishing the sensitive flesh, each inch coated thoroughly in her saliva. He felt lucky, fortunate that such a girl, was doing something like this with him, but still he wanted more, more than just the feel of her tongue and lips. (Omg, i'm so sorry all the people in this room are distracting me. ;___;)\n2:54:44Skinnys: She met his gaze and the look that was plastered on his face satisfied her. She continued to go down on him, taking in his hot, moist member into her mouth. It creeped down her throat and she held it there for a bit longer before coming up. She sat up a bit and placed both of her hands on his shaft, and began rubbing it slowly up and down, watching his skin move up the sides of his head.\n3:06:49Trainer Nero: As she let up some of her attention, he would sit up somewhat, propping himself up with a hand, still offering a soft moan as she tugged at that wet, swollen length, applying more of her pleasing touch. Soon he would reach out with his remaining free hand, cupping one of her breasts, palm pressing against her nipple, fingers kneading into the small, but cute mound.",
 "title": ""
}