{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_fr",
  "re_url"
 ],
 "key": "bsir2Lhp",
 "pasteDate": "Feb 26, 2018, 12:19:56 PM",
 "relevancy": 2.0,
 "relevant": false,
 "text": "El limn - Hier  03:13\nBonsoir  tous !\nJ'ai reu un petit message du socio @Clark :\n\"Bonsoir les amis !\nJe tiens  dposer un recours pour des attitudes intolrables de la part de plusieurs socios et de quelques personnes intgres  l'quipe d'organisation du discord du Mdia. En effet, lors de la soire du 24 fvrier, nous avons assist  un vritable florilge de propos et de petits complots foments dans le but de dstabiliser l'quipe oprationnelle du Mdia.\nA plusieurs reprises, l'utilisateur \"bourriquet\" a qualifi Sophia Chikirou de \"psychopathe\" et a confirm ses propos. Le problme tant galement que l'assistance a largement approuv son propos, et les modrateurs ont mme appuy cette insulte en modrant les messages sur le canal public en dfense de Sophia (messages de Miidnight).\nA plusieurs reprises galement, des utilisateurs ont essay d'entraner d'autres socios afin d'organiser une action en justice contre Le Mdia, sans aucune base crdible. C'est tout simplement hallucinant de constater de tels propos qui ne visent qu'une chose : tuer Le Mdia.\nDe plus, l'utilisateur \"bourriquet\" a eu des propos largement mprisants sur l'quipe oprationnelle, en menaant de faire clater une soit disant affaire de burn-out au sein de l'quipe.\nJe suis trs inquiet de cette situation, car certaines personnes utilisent le discord du Mdia comme un levier afin de manipuler d'autres utilisateurs. Ces gens mettent en pril le bon fonctionnement du Mdia. \"\nIl y a donc selon la dclaration que Bourriquet et des modrateurtrices dont nous n'avons pas le nom ont adopt des attitudes qui peuvent passer pour de l'abus de pouvoir et de l'insulte. Selon la runion sur le rglement du 31 janvier 2018, nous pouvons donc voir que Bourriquet a outrepass les rgles d'une ampleur de catgorie 1 et une des modrateurtrices qui a censur les messages de catgorie 4, puisque l'on peut apparenter cela comme un abus de pouvoir. A partir de l, il peut paratre cohrent dans le cas o les membres de l'organisation outrepassent les rgles de dcider  un vote sur la rvocation de ces personnes, en vertu du Rglement Intrieur du Discord (4.3.1). Cest ainsi notre devoir de  rpondre  la demande des socios de juger un modrateur ou un annonceur pour une radiation . \nIl faut donc en ce sens lancer un vote sur la situation de Bourriquet qui est annonceur et sur la situation du ou des modrateurtrices qui ont censur des messages (peut-tre un appel  un membre du staff pour les logs). Ainsi selon la runion du comit de recours du 9 fvrier 2018, nous avons le droit de lancer un vote collgial dans ce salon en ce sens (4.3.1). Selon nos accords prcdents dans ce salon et dans le point 4.3.2 du Rglement Intrieur :  il [le comit de recours] sengage  observer une neutralit sur le jugement du bannissement dfinitif . Nous devons donc exclure les personnes prsentes pendant la discussion qui a eu lieu dans la soire du 24 fvrier de ce vote. En loccurrence, je peux tmoigner que @Januel et @jicibi prsents membres du comit taient prsents lors de la discussion. Si dautres membres du comit de recours taient aussi prsentes dans la discussion qui a eu lieu, il serait de leur devoir de se signaler aussi.\nJattends donc vos ractions au plus vite afin de rgler ce problme avant la prochaine rotation du comit.\nJanuel - Hier  03:19\nEn quoi le fait d'tre prsent nous empchent de participer  la dcision ?\nJustement ! a nous rend d'autant plus lgitime dans la tenue du recours car nous tions prsent\nEl limn - Hier  03:23\nIl y a la jurisprudence GDSA\nOn avait dcid l'inverse\nJanuel - Hier  03:24\nGDSA ?\nEt qui est \"on\" ?\nEl limn - Hier  03:25\nPar contre filer les discussions internes du comit aux annonceurs c'est pas foufou\nEt pour GDSA remonte un petit peu dans ce salon, la neutralit est engage, on ne vote pas quand on est tmoins\nJanuel - Hier  03:27\nBah, j'aurais tendance  dire, la demande est nule et non avenu. Il n'y a pas eu d'abus de pouvoir de la part de Bouriquet. Il n'a pas utilis ses pouvoirs d'admins. Du coup, au pire il peut demander  ce qu'un modo l'engueule. Et vraiment si il veut faire chier, il peut engueuler le modo qui tait prsent et qui n'a pas modr ces propos \"abusifs\".\nEt si votre juriceprudence est juste entre vous, bah je suis pas d'accord avec votre dcision et elle ne s'applique pas  moi.\nEl limn - Hier  03:29\nC'est  nous de juger s'il y a eu abus de pouvoir ou non, non ? C'est dans nos devoirs  (4.3.1) : \n\"il rpond  la demande des socios de juger un modrateur ou un annonceur pour une radiation\"\nCe n'est pas entre nous, c'est dcid le 9 fvrier : \"il sengage  observer une neutralit sur le jugement du bannissement dfinitif\"\nEn tant prsent tu es tmoin, pas neutre : tu ne peux pas tre juge et tmooin\nJanuel - Hier  03:32\nHaha, la grosse blague. Si je peux tre neutre en tant tmoin. Si tu veux parler de neutralit, tant pote avec le plaignant, a te rend plus ou moins neutre que moi ?\nDe plus, il n'y a pas eu d'abus de pouvoir, car aucun pouvoir n'a t utilis.\nEl limn - Hier  03:32\nPourquoi tu t'nerves Oo ?\nJe reois une plainte, c'est mon devoir de la rapporter c'est crit\nJanuel - Hier  03:34\nAh, mais je suis tout  fait calme. Et je n'ai pas contest le fait de rapporter la demande de Clark.\nJe conteste le fait de me virer de la dcision car j'tais tmoin.\nEnsuite, je conteste la demande, car bas sur rien.\nEl limn - Hier  03:35\nC'est crit dans les rgles, tu as le lien ? On n'est pas en pouvoir de contester la demande, on la traite.\n1\nhttp://prntscr.com/ijdcfw\nLightshot\nScreenshot\n\nIl y a recours, on traite la demande\nJanuel - Hier  03:38\nOui, tu peux sanctionner quelqu'un pour insulte. Mais rvoquer un annonceur c'est pour abus de pouvoir. Aucun pouvoir d'utilis implique aucun abus de pouvoir.\nOn reproche  Bouriquet de rapporter les paroles de Chikirou et de donner son avis  lui. Et ensuite, il est reproch  tout le monde  de donner leur avis personnel sur quoi faire de la situation.\nEl limn - Hier  03:41\nIl n'est pas crit dans notre rglement que c'est  partir d'une catgorie 4 que l'on peut rvoquer un annonceur ou un modrateur. Ici, on parle des insultes de Bourriquet, pas des avis. Il y a faute, on traite et on tranche.\nD'autant que l'insulte c'est passible de catgorie 2 selon la runion du 31 janvier\nJanuel - Hier  03:45\nMmm, donner un jugement de personalit (certes un trai de caractre peu valorisant) est une insulte ? Doit-on tre toujours dans le positif ?\nEl limn - Hier  03:46\nOn peut parler du \"Officiellement je l'encule\", c'est une insulte pour toi :thinking: ?\nHarkal - Hier  03:48\nJe signal qu'aucun message de midnight n'a t supprim ce soir\nEl limn - Hier  03:49\nAh a faut voir avec une membre du staff confirme, c'est ce qui est rapport\nJanuel - Hier  03:49\nLes modrateur ont le pouvoir de voir les logs du serveur.\nEl limn - Hier  03:50\nOn peut avoir un screen des logs en ce sens du coup ?\nHarkal - Hier  03:50\n\n\nJanuel - Hier  03:53\nAh merde, des accusations mensongres. On fait quoi du coup ?\nEl limn - Hier  03:56\nDans ce cas la seconde demande est nulle, par contre pour l'insulte a ne change rien\nJanuel - Hier  03:59\nEt une sanction pour accusation mensongres ? Vu que tu me balance du rglement article par article, a vaut quoi comme catgorie de sanction ?\nEl limn - Hier  04:01\nJe ne vois rien dans les rgles sur les accusations mensongres. Baisse d'un ton et maintenant il faut traiter cette plainte :smiley:\nJanuel - Hier  04:02\nBah, l le ton est simplement sarcastique. T'inquites je suis calme. Oui, on va traiter cette plainte. La question c'est est-ce que je fais la dfense pour l'accus, ou je le laisse faire et je fais un copier coller ?\nCar bon, un texte  charge uniquement, c'est pas une faon de travailler.\nEl limn - Hier  04:03\nC'est pas un texte  charge, je prend les faits rapports, je le met en lien avec les rgles et on statue\nJanuel - Hier  04:05\nPas un texte  charge ? C'est une blague ?!\nEl limn - Hier  04:06\nEt je suis cens crire quoi dans ce cas ?\nJe ne donne pas la plainte ?\nL on parle de la forme et non du fond\nC'est mon boulot ici\nJanuel - Hier  04:10\nAh, mais oui, tu as fais ce que tu devais en faisant un copier/coller de la plainte de Clark. Par contre dire que c'est un texte qui n'est pas  charge mais simplement des faits rapports, je suis dsol mais c'est factuellement faux. Il me semble tout  fait lgitime d'avoir le point de vue oppos.\nEl limn - Hier  04:12\nC'est le but du traitement de la plainte non ?\nJanuel - Hier  04:13\nDu coup, je demande  Bouriquet de rdiger son point de vue pour pouvoir statuer\nEl limn - Hier  04:13\nMoi je reois un message, je montre les consquences qu'elles impliquent en l'tat\nDu coup je demande  ce qu'on fasse les choses collectivement @Januel\nParce qu'envoyer des messages d'ici ds qu'ils sont posts (je ne sais pas si c'est toi) aux personnes incrimines je rpte c'est pas foufou\nJanuel - Hier  04:14\n\"le moderateur doit avoir conaissance des faits qui lui sont reprochs et doit avoir en toute objectivit la possibilit d'y rpondre, avec toute l'attention qu'il mrite\"\nEl limn - Hier  04:15\nEt donc unilatralement tu dcides d'envoyer immdiatement un message  la personne vise ?\nJanuel - Hier  04:16\nConformment au rglement non ?\nEl limn - Hier  04:17\nJe ne le vois pas dans le rglement : https://lemedia.wiki/wiki/Organisation:Discord/R%C3%A8glement_Int%C3%A9rieur#4-2-1_Droit_et_devoir_du_Comit.C3.A9_de_Recours\nR%C3%A8glement_Int%C3%A9rieur\n1\nAmalia - Hier  04:17\nBonsoir ! \nJai reu un message de @Dimebagou :\n J'tais en train de discuter au sujet des actions  venir pour les changements de statuts. Je suis personnellement pas chaud sur la faon de procder j'essayais d'expliquer mon point de vue. On tait pas d'accord mais je respectais les autres. Puis  un moment Stphane RODET (j'ai appris qu'il tait modo ?) me taunt en me comparant  Aphatie et  Cohen avant de finir sur un \"tes con ou quoi\".\nD'une, je n'ai pas manqu de respect.\nDe deux je n'ai pas provoqu.\nDe trois, je n'ai insinuer que l'autre tait \"con\".\nEt de quatre, un modrateur ne devrait pas avoir ce genre de comportements qui n'incite pas au calme et au dbat serein. \nSie je lis l'article 4.3.1 du rglement Intrieur, le comit de justice  rpond  la demande des socios de juger un modrateur ou un annonceur pour une radiation . Cest donc en ce sens que je porte la demande de Dimebagou qui accuse le modrateur Stphane RODET de lavoir insult (se rfrer  annexe). Daprs la runion du 31 janvier 2018, ce sont des entorses au rglement de catgorie 1 voire 2 et donc en ce sens nous pouvons statuer sur dcision collgiale de rvoquer ou non le modrateur. Comme pour la plainte du dessus, les mmes modalits sappliquent videmment sur la neutralit des diffrents juges. \nAnnexe, messages incrimins :\nhttps://cdn.discordapp.com/attachments/297753650355372032/417141584706928660/Sans_titre-1.jpg\nhttps://cdn.discordapp.com/attachments/297753650355372032/417141831692713984/Sans_titre-2.jpg\n\n\nJanuel - Hier  04:18\nNous rappelons quil sagit dun document de travail.  Rien de ce qui est crit ici nest dfinitif.\nEl limn - Hier  04:19\nAh donc on fait des runions pour quoi ?\nJanuel - Hier  04:20\nMmm, mais je croyais que l'histoire avec Stphane avait t rgle  l'amiable ?\nAmalia - Hier  04:20\nCa m'tonnerais que les rgles soient un ' document de travail ', dans le cas ou ces dernires ne serviraient  rien ?\nCela m'tonne car je viens de recevoir la plainte de Dimebagou il y a peu\nJanuel - Hier  04:20\nBah, en tout cas le lien wiki donn par citron ne sont pas les rgles dfinitives.\nAmalia - Hier  04:20\nquelles sont les rgles dfinitives ?\nJanuel - Hier  04:20\nAprs, le wiki c'est toujours le bordel.\nAmalia - Hier  04:21\nOn ne doit pas prendre ces dernires en compte ? Lesquelles sont  disposition du comit ?\nJanuel - Hier  04:21\nL je dois avouer qu'aprs 5H de runion de crise et qu'il est tard. Me taper tout le rglement et surtout chercher le dernier en date\nC'est pas trop mon truc.\nEl limn - Hier  04:22\nJ'ai dit que ce serait bien de le faire avant la prochaine rotation Januel(modifi)\nJanuel - Hier  04:22\nAh mais moi j'ai pas trop suivi l'histoire avec Dimebagou, c'tait uniquement sur l'crit. J'ai vu l'insulte de Stphane, mais il m'avait sembl que a avait t rgl  l'amiable. Si ce n'est pas le cas, pas de soucis.\nAmalia - Hier  04:23\nNon, j'ai eu confirmation de Dimebagou trs rcemment, il ne semblait pas y avoir discussion avec le modrateur\nj'aimerais aussi que sa plainte soit statu rapidement, du moins avant la prochaine rotation comme dit Citron\nJanuel - Hier  04:24\nC'est quand la prochaine rotation ?\nAmalia - Hier  04:25\nla fin du mois\nEl limn - Hier  04:26\nNormalement c'est un mois le mandat non ?\nJanuel - Hier  04:28\nUn mois, srement. Aprs,  partir de quand a commence, c'est une autre question. Bref, de toutes faon, on en reparle demain.\nEl limn - Hier  06:53\nOk",
 "title": ""
}