{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_evil",
  "lg_hr"
 ],
 "key": "c6vBCpNB",
 "pasteDate": "Feb 21, 2018, 8:51:49 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "I'm going to write about fire, but not about the thing you use when you want to cook yourself a delicious meal or to maybe warm yourself up. I'll rather write about its darker and evil side. Hypothetically we could say fire is a tool, like a knife for example. We could use knife to make a nice salad but also we could use it to hurt someone else, that's how tools work, they let you choose the way you will use them, same goes with fire. \n\nForest fire or wildfire is very big problem and concern for our planet, mostly indicated by us, humans. It is also known for us that wildfire is not so hard to set up, but not so easy to stop. We are witnesses that almost every year we have to fight huge wildfires all across our country, it's especially hard to fight it in areas close to sea where is no lot of rain in the summer and winds area strong so wildfires very easily expand. Destroying forests we destroy large ecosystems, infinite number of different species who live in it, we're polluting our air and ourselves, we're also making huge damage to our planet in global. These are some effects we can't reverse, once it is done it is done forever. This problem is common for us and for other countries around the globe, and the only way to beat it is through education and action.\n\nWe have to think about things like this, maybe these are not the problems you will fight in your typical school week, but it's something we have to know if we want to be responsible humans, protecting the Earth is not a choice it's responsibility.  \n\n// srpski\n\nPisau o vatri, ali ne o onoj stvari koji koristite kad elite da sebi skuvate ukusno jelo ili kad elite da se zagrijete. Nego u pisati o njenoj mranijoj i zloj strani. Hipotetiki moemo rei da je vatra alat, kao no na primjer. No moemo koristiti da napravimo lijepu salatu, ali takoe moemo da ga iskoristimo da povrijedimo nekoga, jer tako alati rade, daju nam izbor da biramo kako emo da ih koristimo, ista stvar je i sa vatrom.\n\numske vatre il umski poari (glupo je ovo prevoditi na srpski jer nema rije) su veliki problem i briga za nau planetu, najee inicirano od strane nas, ljudi. Veoma je poznato da i nije teko podmetnuti umski poar, ali da ga je veoma teko zaustaviti. Svjedoci smoo da gotovo svake godine moramo da se borimo sa ogromnim poarima irom drave, a posebno je teko boriti se protiv toga u podrujima koja su blizu mora, gdje kia ne pada toliko esto tokom ljeta i gdje su jaki vjetrovi pa se poari jo lake ire. Unitavanjem uma unitavamo velike ekosisteme, beskonaan broj razliitih vrsta koji ive u njemu, zagaujemo vazduh i nas same, takoe pravimo veliku tetu naoj planeti u globalu. Ovo su efekti koje ne moemo da povratimo, jednom kaada se urade ostaju zauvijek. Ovaj problem je est za nas i druge zemlje irom planete, a jedini nain da ga pobijedimo je kroz edukaciju i akciju.\n\nMoramo da mislimo na stvari kao to je ova, moda ovi problemi nisu protiv kojih se bori tokom tipine kolske sedmice, ali je neto to moramo da znamo ako elimo da budemo odgovorni ljudi, zatita Zemlje nije izbor to je naa obaveza.",
 "title": "poari"
}