{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "cZMHGNJU",
 "pasteDate": "Feb 26, 2018, 9:57:37 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Neverr - Today at 11:08 PM\noh\nin regards to your earlier question\nI don't see zawa as a good officer, personally. Idk if he does things outside of what I hear but I hear nothing good, and I see nothing really\nAnd Bengie seemed really random to me in terms of being promoted to officer, what did he do in the guild to be officer worthy\nlike\nit was so random\nthat it almost felt like because he was above 500 gs and a streamer he got officer\nI doubt that was it\nbut no one I talk to knows how he got it\nwe never saw him doing anything guild related or recruiting\nor things like that\nin fact I used to harass him with guru\nto hang out in discord more\nbecause we never saw him\nSo ye, those two specifically I'm a bit unsure about\nthe rest seem fine, I never see sang do anything but ahzek told me he does a lot of behind the scenes work\nso that's cool\nkawn is a good officer I think\nyou are a great officer\nahzek is great\nsach is good\nDavid I hear is no longer an officer\nhe was the other one I was wondering about\nsince he hasn't been playing in forever, but that was already settled\nNahta idk, he isn't active on the forefront\nbut I imagine he does a lot of behind the scenes advising as well\nbut ye, that's a breakdown of how I see every officer\nidk if you wanted that but there it is\n\nNevada-Tan - Today at 11:20 PM\nMy bad for saying it in discord, totally wasn't thinking. But I agree. Zawa has work a lot recently so he hasn't been on, and before that he wasn't that active in discord, but he was pretty on point with the recruits. Bengie, that threw me off. Felt like it was completely unnecessary. He's a 61 decently geared striker and that's about it, he didn't go in discord much and I don't think he ddid much else. I have a feeling he was promoted because of his level/gear. But I gave him a task and he did it during node wars, so that's a plus. I don't see Nahta on too much sadly, but he's been in this guild since the start and he recruits. I just don't think he's too active in-game. Don't think he's very geared either\n\nNeverr - Today at 11:21 PM\nye\nIt's hard for me to really judge a person\nwhen I'm not at their level, so I try not to\nbut that's what we see down here mostly\na lot of our new members\ndont even know who zawa is\nbut ye, I don't want to talk anyone down in case they are doing work behind the scenes. When I was helping run a wow guild we had officers do a TON of help behind the scenes\nand we'd have to fight the guild constantly about their validity as officers\nbecause they didn't have a public face\nso I understand that expectation\ner, understand that part of being an officer\nNevada-Tan - Today at 11:26 PM\nWell said",
 "title": ""
}