{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "defCQaNq",
 "pasteDate": "Feb 18, 2018, 9:06:00 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "A series of thoughts, images and sensations occurring in a person's mind during sleep. That's how the dictionary describes dreams. Science and philosophy both argue with each other and even themselves to find a correct definition. If you'd ask me, however, I wouldn't be able to give a clear answer as to what it is. It's just something that you see when you sleep. Technically, it's the same as the dictionary's definition, it's just less fancy. But let me jerk a bit of philosophy in here. At what point can we be sure that we're not in a dream? What makes us sure we are awake? And what makes us sure we are asleep? Actually, scratch that last question, cause I am sure as hell that what I see right now is a dream.\n\n\"Long time no see, huh?\" said the girl in front of me.\n\n\"Guess so. Been about two weeks\", I replied to her. I pretended to forget her quite unusual behavior at the end last time. I didn't want things to get awkward in my own dream. There's enough of that in my reality already.\n\n\"How's your life? Been sleeping well?\" she said in a teasing tone.\n\n\"Oh, so my sleep quality actually interests you?\"\n\n\"Of course. We only meet when you sleep, right? And even given that, it's still far from every night that I actually get to see you.\"\n\nWe started walking. Yet again, like every other dream. The leaves were still on the ground, even though everything was covered in snow in the 'real' world. It's nice that at least in dreams I get to hear that ever relaxing sound.\n\n\"Hey, tell me\", she said, \"Am I a nuisance to you?\"\n\n\"Huh? What do you mean?\" I was genuinely confused about her words.\n\n\"You know, like, am I bothering you in any way? Maybe you feel uncomfortable each time you see me, or something. Or maybe I'm too intrusive in your life?\"\n\nI do feel awkward at times, and she sure is intrusive alright, but I cannot bring myself to say that it actually bothers me. After all, it's just a dream. She herself is just a dream. Not real. Dreams don't affect real life and never should. Realm of dreams never intersects with the realm of reality.\n\n\"Not at all\", I spoke, \"I'm actually kind of glad when I see you in my dreams. It's something new, you know? Something to spice up the boring stuff with.\"\n\n\"Even though all we ever do is walk and talk?\"\n\n\"But I mean, these are lucid dreams. And not only am I aware of me sleeping, but so are you. That's quite interesting, you know?\"\n\n\"Guess you're right.\"\n\nA strong gush of wind flew by, lifting the leaves up from the ground while tearing some down from the trees, making for quite a spectacle. We stood frozen, watching it all fly in every direction. The colors yellow, red and orange surrounded us, dancing and flying everywhere.\n\n\"It's almost as if we're devoured by fire, isn't it?\" she broke the silence, while the leaves were still circling around us.\n\n\"That's quite an imagination you got in your head\", I replied to her.\n\n\"Unmatched with yours. After all, you're the one who's making this all happen.\"\n\nHold on a second. She's right. This entire dream should be under my control since I'm lucid dreaming, right? I've realized my state and should now be able to write my own dream. This should've been the case every time I've met this girl, yet both her words and the random events like this have never been controlled by me. Was I powerless all this time? What if I try to change the setting right now?\n\nI try my best, but the leaves keep flying the same way. Actually, they move even faster and more violent now. This makes me anxious. This actually makes me anxious. I am not in control of my dream. This just put into question not only every single word that girl has said to me so far, but every single word I've said as well.\n\n\"Say, if you were to burn alive, would you prefer it be fast but lonely, or would you rather burn slowly but with company?\"\n\nHer sudden question has put me off-guard. Still consumed by the fiery leaves, I answered.\n\n\"Die slowly and drag someone else into it? No, thanks. I'd rather die quickly and alone.\"\n\n\"Interesting choice\", as she said those words, the leaves all suddenly dropped, as if by command. Could it possibly be that she's the one who's in control right now?\n\n\"What about you?\" I asked, \"Would you rather burn with me and suffer longer, or die alone and less miserable?\"\n\n\"Burn with you, of course\", she didn't even take a brief moment to think, \"You know, in a way you're the sole reason of my existence, so I'd burn with you no matter what.\"\n\nWell that's quite extreme of her. I can't say I expected that reply in the slightest, but I guess she might have a point. No matter how you look at it, she exists because of me. She exists inside of me, as a matter of fact. Nothing can change that. But something about the way she put it made me feel a bit uncomfortable.\n\nThat feeling soon grew into the one of me waking up. I could once again feel the pressure of my blanket against my chest and the warmth of my bed. Ah, it feels nice. Sure, I don't have the most comfortable bed in the world, but it might as well be one. You know, something like, 'a bed where one dreams good dreams is a good bed'. This ain't a quote, I just made that up.\n\n\"Don't go\", she abruptly said. I turned around to see her crying once again. \"Please.\"\n\nI could already see the outlines of my bedroom lit up by sunlight and hear people outside worrying about something. My time here was over.\n\n\"I'm sorry, I-\"\n\n\"No!\" she yelled before suddenly grabbing my arm, scaring me quite well. I would say it made me jump, but it didn't. In fact, I found myself unable to move at all.\n\nShe embraced me and held tightly, obviously not thinking of ever letting go. I was trapped in here with her while at the same time being pulled back into the real world. I couldn't move. I couldn't breathe.\n\n\"Don't leave me here! Please!\" she continued to cry, \"Don't leave me alone! I'm scared!\"\n\nAnd I was scared too. I lost all of my senses. I could no longer see neither the bedroom, nor the dream. I couldn't sense neither my blanket, nor her touch. Everything became a fuzzy mess. I was being torn apart between two worlds.\n\nBoth awake and asleep.\n\nBut it felt like dying.\n\nWith one final \"No!\" she shouted, she finally let go, and I was retrieved back into the real world. I subconsciously took a deep breath, heavily gasping for air immediately afterwards. I also jumped in my bed, too. Finally gaining control over my body after that experience was overwhelming. Most of my limbs were still stiff and felt unreal. As if I were still dreaming. Was I?",
 "title": ""
}