{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "re_sql",
  "lg_en"
 ],
 "key": "DnSzSNWf",
 "pasteDate": "Feb 11, 2018, 4:30:44 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": ">Be a poor schmuck named Anon, Private First Class in Uncle Sam's glorious military\n>More specifically, the Marines, even though you always laughed at those shitty \"Marine MREs consist of Crayola tm brand crayons and jalapeno cheese spread to eat them with\" jokes\n>You were currently a poor schmuck because you were standing in the hot sun of some crappy sand filled shithole getting introduced to your squadmates\n>All of which are monstergirls\n>Oh yeah, those exist. Quite a few can do good in the military with their strengths and powers\n>But the problem with your squad is....\n\n>It consists of four Baphomets, the ones that look like the wet dream of an ISIS fighter due to a Baphomet being the combination of a young girl and a goat\n>Thus, they're kind of fuckin' weird and awkward to be around, even without their whole Sabbath thing going on\n>The four standing in front of you have various oddities about them, other than being goat-loli-things with insane amounts of magic\n>One has her standard issue backpack and chestrig overflowing with not magazines, oh no\n>They're full of what seem to be a variety pack of explosives, ranging from hand grenades to what may or may not be a anti-personnel mine\n>Demolitions, you assume\n>The girl standing next to her is glaring right at you, a patrol cap a size too big held up by her curly horns as she fiddles with some sort of staff\n>She seems to be the highest ranked one, from what you can make out on their uniforms\n>Miss \"Probably The Squad Leader\" doesn't seem to be impressed with you\n>The third Baphomet in the line of goat-lolis currently judging you is currently holding a M249 SAW, ammo belts of 5.56x45 NATO flowing from her kitbag into the light machine gun\n>That's your bullet hose right there\n>And the final Baphomet is one with a red cross on an arm band around her left arn, clearly made by either her or one of her squadmates. Her helmet has \"Fixer-Upper\" scrawled on the front of it. She also messes about with a scarily large needle you really hope you won't have to get close to that is filled with an odd colored liquid\n>The Corpsman, obviously\n>The patrol capped clears her throat and points a fuzzy claw tipped finger at you, barking out \"Private First Class Anon, (henceforth dubbed \"Newbie\" she mutters), you are my squad's new member and driver! Hopefully you haven't had any stupid thoughts about our combat effectiveness due to our height or appearances, the short jokes get really fucking grating after a few months. Get your ass over here, we're out for a patrol in ten minutes.\"\n>This isn't going to be fun, is it?\n>No, no it won't\n>Your new squad leader continues to size you up as you join the squad in moving towards their vehicle, a HMMWV that's probably seen better days judging by the dents and scratches all over it's everything\n>Probably due to the increased activity of the angry resident non-monstergirl goatfuckers who seek to make life as shit as possible for anyone deployed in the region\n>You clamber on into the driver's seat, the rest of your fun-sized squad taking a bit longer to climb in one after the other into various places in the vehicle\n>The LMG-toting Baphomet finds her place in the turret, working hard at mounting her M249 onto the previously gun-less mount\n>The Corpsman-Baphomet goes through a footlocker, swapping out medical supplies and such while taking inventory\n>The Baphomet who might just be a tad bit obsessed with explosives relaxes in the back, practically molesting a....RPG-7 warhead. She notices your staring and flashes you a fuzzy thumbs up, stating \"Jus' a dud, I won't blow us up!\"\n>You are not reassured by her attempt to dissuade your fears\n>And finally, the Squad Leader is...climbing right into your lap, sitting down\n>This causes you, poor PFC Anon, to immediately try to remove your squad leader from your lap due to the close contact with that lower and quite private region\n>She stops you in your tracks with a glare and pushes your hands onto the steering wheel, saying \"Newbie, the fuck are you doing? I'm the one who actually knows where we're supposed to patrol, so let me navigate.\"\n>\"Why the hell do you have to be in my lap, ma'am? Coul-\"\n>\"I can't see above the dashboard if I sit in the passenger seat, so quit your whining.\"\n>Great, your Baphomet Squad Leader has planted herself in your lap to navigate for you\n>Fuck\n\n>As you begin to drive out of the base and into the dusty, hot shithole of whatever crappy country your in, your unwanted lap-sitter squrims and shifts as she begins to direct you in your driving\n>The heat her tush is applying to your lap area, along with the movement makes whatever dumb part of your brain say \"Yes, now is the time to get a fucking boner, yes! Right when your fucking loli squad leader is sitting in your lap!\"\n>FUCK\n>You attempt to control that retarded part of your unconcious brain through sheer force of willpower, mostly succeding....except for the fact that your Squad Leader has turned around and is giving you a slightly smug and annoyed look\n>DOUBLE FUCK\n>\"Private, that better be a spare magazine for your service rifle...\"\n>\"I-it is, ma'am! Uhm, couldn't you just....stand in the passenger seat?\"\n>\"Nah.\" is all she says as she increases her weight on your lap, jabbing a furred elbow into your stomach lightly\n>\"Get used to this, Newbie.\"\n>The battle between your dick and your desire to not get court martialed rages for the rest of the patrol, until your squad leader stood up and \"accidentally\" jammed a hoof into your crotch while turning around to tell the explosives loving Baphomet to quit messing with that grenade, causing you to almost have an out of body experience due to the pain from the hard-hoof-to-private-area contact\n>Thankfully, you managed to keep the vehicle steady as you returned to base from the uneventful patrol\n>Quietly weeping for your unborn children as you did so, wishing you were slightly dead\n>Fuck \n\n>You get dragged off with the squad of Baphomets after you brought the vehicle back to the motor pool, as apparently you will be bunking with them\n>They have a tent for their squad, sections of it being devoted to each of the Baphomets\n>There's an empty and unpersonalized section with a cot and a footlocker, which the squad leader says is yours\n>It's right next to the Bomb Obsessed Baphomet and your cunty squad leader\n>Great\n>You unpack your stuff and sit down on the cot, intending to close your eyes for just a bit\n>Seconds later, your eyes are forced open due to your shock at having the weight of three separate people landing on your legs and stomach\n>You see the grinning faces of three out of four of your squadmates, your squad leader standing by your head and staring down at you\n>She shushes you as you were about to say something, and says \"Newbie, it's time you got fully introduced to your squad.\"",
 "title": "BaphSquad"
}