{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_security",
  "re_email",
  "re_url",
  "kw_flood",
  "lg_en",
  "kw_hack"
 ],
 "key": "DSNMHvmL",
 "pasteDate": "Feb 17, 2018, 2:20:30 PM",
 "relevancy": 3.0,
 "relevant": false,
 "text": "\tPlease use the sharing tools found via the email icon at the top of articles. Copying articles to share with others is a breach of FT.com T&Cs and Copyright Policy. Email licensing@ft.com to buy additional rights. Subscribers may share up to 10 or 20 articles per month using the gift article service. More information can be found at https://www.ft.com/tour.\n\thttps://www.ft.com/content/0a1d8c9a-12fb-11e8-940e-08320fc2a277\n\n\tWorldpay, Visa caught in storm over erroneous Coinbase charges\nErroneous charges sparked an uproar on social media among digital currencies traders\n\n Reuters\nShare on Twitter (opens new window)\nShare on Facebook (opens new window)\nShare on LinkedIn (opens new window)\nSave\nSave to myFT\nAdam Samson in London YESTERDAY\nVisa and Worldpay have been thrust into a swirling controversy over erroneous charges that hit traders using Coinbase, Americas biggest cryptocurrencies exchange.\n\nOver the past two days, a flood of Coinbase users have complained about unexpected charges hitting their bank accounts. You drained my bank account and now I have nothing, claimed one user on Reddit. Another called the transactions a breach of my personal security.\n\nThe issues shine a light on the intersection between the traditional financial industry and the burgeoning digital currencies sector.\n\nCoinbase has denied that it is to blame for the duplicate charges. Weve been informed by relevant payments network authorities that this was not caused by Coinbase, said Daniel Romero, general manager at Coinbase in an interview late on Friday with the Financial Times.\n\nThe problems have only affected users who have paid with Visa cards, according to a person with direct knowledge of the situation.\n\nBut Visa has also deflected blame, saying in a statement that it has not made any systems changes that would result in the duplicate transactions cardholders are reporting. It said, however, that it stands ready to work with intermediaries to ensure cardholders are protected from unauthorised transactions.\n\nWorldpay, which processes credit and debit card transactions for Coinbase, said late on Friday that it too is looking into the issues. A spokesperson said: We are actively working with and engaging all parties involved  including the card networks, issuing banks, other processors and Coinbase  to resolve this issue.\n\nThe problems faced by Coinbase customers, and the lack of clarity on who is to blame, highlights the perils faced by participants in the nascent industry.\n\nCoinbase and other exchanges have grown rapidly thanks to a rush of customers over the past few months as cryptocurrency prices fluctuated and captured the attention of a wide range of media outlets.\n\nIt has previously faced other user complaints, including from some who have said that withdrawals in various currencies, including US dollars, have been delayed.\n\nIn January it hired an ex-Twitter vice-president to bolster its customer services department, which it has said was overwhelmed by the booming demand.\n\nCryptocurrencies exchanges across the world have faced sometimes serious issues as they tap into the burgeoning digital currencies business. Japans Coincheck suffered a $500m hack earlier this year. Binance earlier this month was forced to suspend trade and withdrawals for more than 24 hours as it faced problems with a system upgrade.\n\nRegulations have generally not kept up with the markets rapid growth. In the US, exchanges are generally overseen by state securities regulators, leading to a fragmented system.\n\nChris Giancarlo, chairman of the Commodity Futures Trading Commission, on Thursday told a Senate hearing that a rationalised federal framework may be more effective and efficient in ensuring the integrity of the underlying market in virtual currencies.\n\nThe finance ministers of Germany and France also this week called for a clampdown on digital currencies, writing in a letter to other G20 finance heads that digital tokens could pose substantial risks for investors and potentially to longer-term financial stability.\n\nThis article has been updated.",
 "title": ""
}