{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "dvzJS8bD",
 "pasteDate": "Feb 28, 2018, 12:05:28 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Martin Heideggers Parmenides is a profound analysis of the philosophical tradition and explication of primordial thinkers. Thinkers such as Heraclitus, Parmenides and the first thinker, Anaximander. Heidegger reflects on the thinking of these major thinkers, he attends to the words of these thinkers, conveying that to think is the heed to the essential. Heidegger tries to think and evaluate the thoughts that all these Primordial thinkers have thought through their Didactic Poems. Poems that are intended to teach or educate an idea or thought; He specifically examines Parmenidess Poem on the goddess of truth and the essence of Aletheia. Heidegger explains that there are two types of ways that Thinkers think through; Beginning and Outset. Outset comes forth as the thinking at a definite time; it defines the thinking that took place at a specific moment and time or age. Beginning is what to be thought and what is thought, all Primordial thinkers think through this. Parmenides conveys Aletheia in that to think the true, means to experience the true in its essence and in such essential experience, to know the truth what is true. Heidegger explores the Translating of terms from greek and how they are translated or transported to Western and current everyday language. He conveys that the translating of terms gets even more obscured as we are constantly translating our own language, each word is now further translated and divided up, by paraphrasing we lose the original literal meaning and translation. Paraphrasing is the subsequent upon the transporting of our whole being into the realm of a transformed truth of words. Heidegger explains Transporting as directives from aletheia, the conflictual character of unconcealdness. Heidegger appropriates this notion of truth or unconcealment, which is the direct translation from the greek word literally, the un allows the meaning of concealedness to be taken away, cancelled, evicted, or banned. Unconcealedness suggests an opposition to concealedness. Unconcealedness gives the essence of truth its character. Concealedness is the veiling, masking, preserving or entrusting.  From these modes of concealedness and concealing unconcealedness immediately gains clearer features. It is portrayed as the falsity as a concealment. Heidegger explains falsity as what is opposed to the truth. This opposition is natural that beings encounter it everywhere and constantly move within it, the word derives from the latin word falsum. Heidegger appropriates the Conflictual essence of truth, which is never available by itself, but instead must be gained by struggle or conflict. Concealment by human nature is always available, it is achieving unconcealedness through conflict in the general sense that among humans truth is something to be sought out and struggled for. Furthermore, Heidegger begins to explore the Parmenides of Elea, a thinker who conceived and uttered that dictum around the time the temple of Poseidon was constructed in poseidonia. A dictum is a formal pronouncement from an authoritative source.  He was also the first philosopher to inquire into the nature of existence itself, he is also heavily credited as the father of metaphysics. The dictum of this thinker expresses the word of the goddess aletheia, a name we now translate to the word truth. Heidegger tries to showcase how beings tend to conceal the truth through dissembling, and how the truth is still hidden behind all the obstruction in the way. He defines Dissembling as the obstructing or disguising as a way of concealment that beings do, he uses the example of a neighboring house obstructing the self-showing of the mountain.\n\n\n\nMythos and Logos, even though poles apart, represent two different yet complimentary aspects of human thinking. Both are necessary to complete the spheres of competence that are available to human beings and should not be thought of as being better than each other. Both words are connected in such a way that both forfeit their primordial essence. It describes the transition in ancient Greek thought from the stories of gods, goddesses, and heroes (mythos) to the gradual development of rational philosophy and logic (logos). The former is represented by the earliest Greek thinkers, such as the primordial ThinkersParmenides, Heraclitus, Anaximander; the latter is represented by later thinkers called the pre-socratic philosophers and then Socrates, plato, and Aristotle. Plato and Aristotle first began to speak of metaphysics, in the course of the unfolding of metaphysics, it transforms into ratio which is associated to Logos. It is the reason and spirit, Philosophers used Being and Ratio to express history thinking from Plato and Nietzsche. Heidegger used being and word to convey the beginning of the essential history of the west, which is thereby experienced more primordially.  Heidegger uses essential thinking to attempt to convey how the pre-Socratic philosophers were able to convert mythos into logos, he was able to show the connection of how these philosophers were able to turn Greek myths into common day western logic.",
 "title": ""
}