{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_bot"
 ],
 "key": "e0G7SVpi",
 "pasteDate": "Feb 20, 2018, 7:24:19 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Game 1\nLawd Bibson: Follow me, Dar.\nLawd Bibson: Nice.\nLawd Bibson: Do you just not want me to play? How about that?\nLawd Bibson: The game's already over based on composition alone.\nLawd Bibson: Bot lane WILL NOT win under any circumstance.\nLawd Bibson: You guys won't win. I can't even gank your lane.\nLawd Bibson: YOU LITERALLY HAVE THE SAME FUCKING SCORE AS ME\nLawd Bibson: Because I am. You think I play this seriously? Fuck off.\nLawd Bibson: BECAUSE YOU'RE WASTING MY FUCKING TIME.\nLawd Bibson: It'd be like if you drove directly in front of my car, going 25 in a 50, and then when I got pissed you go \"Damn you take drivi\nLawd Bibson: No, it's called NOT GIMPING YOUR OWN TEAM\nLawd Bibson: I don't understand why that's so damn hard for you to see.\nLawd Bibson: Do whatever the hell you want, I don't care. They're flaming me as usual.\nLawd Bibson: I didn't want a Karthus Riven bot lane to throw away our game but here we are.\nLawd Bibson: Then go play fucking Ranked.\nLawd Bibson: I know I'm not good. Sorry. I play this to try and have some fucking semblance of enjoyment and you keep robbing me of it.\nLawd Bibson: I want a decent game and I can't even get that.\nLawd Bibson: It doesn't matter what number I say here because you're going to insult me, so let's go with 17.\nLawd Bibson: Go ahead.\nLawd Bibson: Insult me like you do every other fucking player.\nLawd Bibson: Cunt.\nLawd Bibson: You're an ass.\nLawd Bibson: Thanks. I bother trying with something people can read.\nLawd Bibson: Look. Sorry for blowing up. This is just the twentieth bad game I've had in a row and I'm genuinely tired of trying to salvage\nLawd Bibson: a broken mess.\nLawd Bibson: I can't not do that.\nLawd Bibson: I can't.\nLawd Bibson: I have expectations of myself that when I can't meet in a given game make me feel like shit.\nLawd Bibson: I feel like absolute fucking garbage right now.\nLawd Bibson: And it's pointless to think otherwise because I can't meet my goals.\nLawd Bibson: I never will.\nLawd Bibson: I do. And then people complain, and then I get flamed, and then I fail.\nLawd Bibson: It always happens.\nLawd Bibson: Silent or not, I'm the failure.\nLawd Bibson: I can't contribute, I couldn't gank, I couldn't help anyone and now I'm a waste of fucking space.\nLawd Bibson: Do I sound alright? Do you think I'm alright? Of course not.\nLawd Bibson: I'm incredibly self-critical with games I want to succeed in and I give myself zero elbow room and neither should you.\nLawd Bibson: My whole goal with League has always been to just play competently and two years later I can't even pull THAT off more than 40%\nLawd Bibson: All I've done is complain, fail, and mess up this game.\nLawd Bibson: I failed before I touched a keyboard.\nLawd Bibson: I have no talent.\nLawd Bibson: It's so hard. I can't do that with this.\nLawd Bibson: There's too much weight on me.\nLawd Bibson: It's my fault. I'm the asshole here. I'm blowing every opportunity.\nLawd Bibson: It doesn't matter, because my one redeeming move is going to get our team nowhere.\nLawd Bibson: I ruined the game.\nLawd Bibson: It's over and it's my fault.\nLawd Bibson: I didn't do the one damn job I had.\nLawd Bibson: Jarvan, I quit, man. I can't.\nLawd Bibson: I feel like shit.\nLawd Bibson: I did like three hours ago, I've got nothing to give\nLawd Bibson: My ability is at an all time low right now\nLawd Bibson: Wonderful. I fucked us over.\nLawd Bibson: WHAT A FUCKING WONDERFUL PLAYER\nLawd Bibson: I can't tolerate myself anymore.\nLawd Bibson: It's MY FUCKING FAULT WE COULDN'T PULL IT\nGame 2\nLawd Bibson: I don't want my buff stolen.\nLawd Bibson: Smooth as butter\nLawd Bibson: Fucking hell, why.\nLawd Bibson: Please stop going all-in.\nLawd Bibson: I give up.\nLawd Bibson: I'm too behind and I'm gonna fail.\nLawd Bibson: I just keep failing and failing.\nLawd Bibson: End the game already, I'm worthless to my team.\nLawd Bibson: There's another tower gone. I can't do my job.\nLawd Bibson: Why the hell do you care? You win.\nLawd Bibson: Of course, I'm no idiot. I'm going to FF because I'm shit.\nLawd Bibson: Then mute me.\nLawd Bibson: I'm gonna say what I want because I can't do a fucking thing right.\nLawd Bibson: I'm 1/4/2 and just as shit as when I first started playing.\nLawd Bibson: I've done nothing but make consistent mistakes.\nLawd Bibson: I'm playing like shit, losing farm, towers, and gold.\nLawd Bibson: I fuck up again. I fail again.\nLawd Bibson: Our team is so egregiously behind that this whole fucking game is a waste.\nLawd Bibson: Get out.\nLawd Bibson: You don't know what self-hate looks like.\nLawd Bibson: I can't do this.\nLawd Bibson: Great. Fantastic. End the game with that Herald.\nLawd Bibson: YEAH HAHA SO FUNNY\nLawd Bibson: Quit being sarcastic.\nLawd Bibson: Ugh, I'm sorry for blowing up like this, I'm just tired of games like this.\nLawd Bibson: Fuck this, seriously.\nLawd Bibson: We have no chance.\nLawd Bibson: I quit.\nLawd Bibson: YEAH THANKS FOR POINTING OUT WHAT I'VE BEEN SAYING FOR\nLawd Bibson: YOU KNOW\nLawd Bibson: THE ENTIRE FUCKING GAME\nLawd Bibson: REALLY HELPFUL\nLawd Bibson: REALLY FUN TO HEAR THAT ALL THE DAMN TIME NO MATTER WHAT I DO\nLawd Bibson: DOESN'T GET TIRESOME AT ALL HAVING A GAME WHERE I CONSTANTLY FUCK UP AND GET NOTHING BUT HATE EVEN THOUGH I'M TRYING TO LEARN AND FUCKING CAN'T\nLawd Bibson: It's pointless.\nLawd Bibson: Yeah, it's been my entire fucking life and I'm tired of it.\nLawd Bibson: I can't adapt well enough.\nLawd Bibson: SEE?\nLawd Bibson: Oh, bullshit, you're trying to troll.\nLawd Bibson: You think I'll fall for that line again after everyone else who does that?\nLawd Bibson: No, I don't. I'm just self-critical, as I should be.\nLawd Bibson: Adapt or die, she said.\nLawd Bibson: Can't adapt, so now what.\nLawd Bibson: No, I didn't, and I fucked up.\nLawd Bibson: Fucking kill me.\nLawd Bibson: I try to predict and the enemy team is always a step ahead.\nLawd Bibson: I am gutter trash at this.\nLawd Bibson: And the whole team is dragging this out.\nLawd Bibson: WE CAN'T WIN.\nLawd Bibson: I already did four times. I can't quit.\nLawd Bibson: This is over. End the game so I can finally move on.\nLawd Bibson: Both? Neither? Who cares.\nLawd Bibson: I always get focused, I always die, which always costs our team fights.\nLawd Bibson: Please, take Baron and end.\nLawd Bibson: This whole team is just flat-out ignorant of when a game is over.\nLawd Bibson: I'd help my team more for just AFKing.\nLawd Bibson: AND WHAT ELSE WAS I SUPPOSED TO DO? TRY AND RUN FROM SIXTEEN INDIVIDUAL SLOWS AND A STUN INTO A ROOT INTO A STUN?\nLawd Bibson: GET REAL.\nLawd Bibson: Oh, boy, here we go with the \"lol xd he's under 20 so it's cool to make fun of him\" shit.\nLawd Bibson: And I don't care that's it's norms because crushing losses are a waste of my fucking time.\nLawd Bibson: Just fucking end, please.\nLawd Bibson: Kill our team and take your win.\nLawd Bibson: I want to be done.\nLawd Bibson: No.\nLawd Bibson: Thanks for pointing out the obvious.\nLawd Bibson: Real fucking flattering.\nGame 3\nLawd Bibson: Oh. Cool.\nLawd Bibson: WHY\nLawd Bibson: WHY DOES IT ALWAYS HAVE TO BE ME\nLawd Bibson: Every game I fuck up, why? Why is it always me?\nLawd Bibson: WHY\nLawd Bibson: I can't even play Ranked.\nLawd Bibson: I can't.\nLawd Bibson: It hurts to do so.\nLawd Bibson: I'm tired of it.\nLawd Bibson: I missed an AoE.\nLawd Bibson: I can't.\nLawd Bibson: FFS.\nLawd Bibson: Can you please ask before you take?\nLawd Bibson: I GIVE UP\nLawd Bibson: I'm being outscaled and outplayed.\nLawd Bibson: I just want to win so I can sleep.\nLawd Bibson: kog please group\nLawd Bibson: I give up, open jungle, I'm AFKing.\nLawd Bibson: Vote yes and end this shit.\nLawd Bibson: You think I care?\nLawd Bibson: If it's not fun, why bother.\nLawd Bibson: I try to do better but I'm 5/3/3 and suck ass.\nLawd Bibson: I can't fucking do it, I can't ever do it, I'm gonna fail every single fucking time\nLawd Bibson: For fuck's sake, why!? Why won't my team give up when it's really obvious we're gonna lose the game...\nLawd Bibson: Seriously, just let them win. You're delaying the inevitable here.\nLawd Bibson: I fucking quit.\nLawd Bibson: I FUCKING QUIT.\nLawd Bibson: I can't do anything.\nLawd Bibson: I'M FUCKING DONE.\nLawd Bibson: WHAT ELSE DO YOU WANT ME TO DO, LET THEM WIN?\nLawd Bibson: Fuck this. I quit.",
 "title": ""
}