{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_fr"
 ],
 "key": "e7SpuUb4",
 "pasteDate": "Feb 17, 2018, 3:30:02 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Bonjour/Bonsoir,\n\nI - Prsentation: \n\nPseudo Virtuel: Tartiflemmard .\nPrnom IRL: Vincent .\nA l'heure ou je vous cris, j'ai actuellement 14 ans.\nJ'habite vers Lyon (Rhne-Alpes Auvergne -> dans l'Ain).\nJe suis mature.\nJe suis trs actif.\nSympathique.\nJ'ai trois passions dans la vie le sport, l'informatique et les jeux vido [dont tryharder sur LifePVP x)].\n\nJe vous contact car j'aimerais devenir Assistant sur votre Serveur Minecraft nomm \"LIFEPVP\" qui est vraiment super bien !\n\nII - Pourquoi ?\n\n- Je suis  l'coute des personnes, que ce soit dans le \"chat\" ou en vocal sur le Teamspeak pour toutes demandes d'aides, je serais trs actif pour rpondre aux questions demandes.\nSi l'on me posent des milliards de questions car je sais que certaine(s) personne(s) s'nerve(nt) a cause de cela, je reste tranquille.\n- Je suis trs souvent connect (Skype, Teamspeak, Discord).\n- J'ai dj eux pas mal d'expriences en ce grade sur d'autres serveurs maintenant ferm pour x raison.\n- J'ai dj eux pas mal de fois des Serveurs Minecraft en ma possessions, mais j'ai vite vu que c'tait assez dur.\n\nIII - Motivations:\n\nPersonnellement je suis fan de l'ordre et l'entraide entre joueur c'est pour cela que mes motivations sont infinies dans ces catgories. Aprs je suis quelqu'un de trs positif et trs motiv dans l'assistance aussi bien physique que textuelle ! \nDe plus, quand je vois un joueur qui a besoin daide dans le serveur je laide si je peux ou je vais essayer d'aller voir NextSap pour laider.\n\n\nIV - Comptences:\n\n- J'ai normment de comptences pour devenir Assistant sur LifePVP, car le est vraiment super bien cod et je vous en flicite !\n- Cela permettra aussi de mamliorer en cas d'erreurs, je ferais un plaisir d'couter vos conseils !\n- Je prendrais beaucoup de plaisir  \"excuter vos ordres\", que cela soit ou non sur le Teamspeak/Serveur. Et bien sr je prendrais aussi ainsi que beaucoup de plaisir  raliser ce que je dois faire avec mon grade sur votre serveur/Teamspeak.\n- J'ai dj t pas mal de fois Assistant, est cela a bien marchs ! Ceci m'a fait pas mal plaisir que des personnes aiment ce que je faisais et que je pourrais reproduire sur votre Serveur Minecraft/Teamspeak.\n- Je me ferais un plaisir a couter vos amliorations et  les appliques.\n\nV - Pourquoi moi et pas d'autres ?:\n\n- Moi car j'ai pas mal de plaisir a prendre, et je pense que certaine(s) personne(s) n'ont pas les mmes comptences que je vous es dict (Ci-Dessus).\n- Je pense que j'ai le courage de m'aventurer dedans, et certaine(s) personne(s) quitterons leurs poste d'Assistant au bout de 1 mois (plus ou moins).\n\n\nVI - Mes qualits et dfauts:\n\nJe suis quelqu'un de trs positif comme j'ai pu le citer prcdemment mais je suis trs droit, j'arrive  garder mon sang froid dans touts les cas, mais personne aujourd'hui n'a russi rellement  me faire mettre hors de moi, je fais aussi preuve de maturit (ce qui ne veut pas dire que je ne sais pas mamuser) . Ensuite pour mes dfauts, je suis trs impatient et curieux (cela peur tre pris pour un dfaut comme pour une qualit).\n\n\n\nJe pense faire un bon boulot (daprs moi), Mes ami(e)s m'ont dit dessayer de postuler et je l'ai fais !\n\n\nJ'espre avoir une rponse positive de votre part :) !\n Merci beaucoup d'avoir prit le temps de lire.\n\n\n(Je tiens  m'excuser des rptitions),\n               Merci encore.",
 "title": ""
}