{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_crack",
  "re_url",
  "lg_en",
  "kw_evil",
  "kw_attack"
 ],
 "key": "ePqb4uga",
 "pasteDate": "Feb 10, 2018, 7:19:58 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "LawnPygmy: \"...feel... so weak...\"\nYue: A second pod follows, and Nova collapses shortly after.\nYue: When you come to, she's barely standing, holding another teenager-sized humanoid in her own arms. It looks much more panicked. If Freja and Spindle are there in your headcanon, they likewise have space-suited children to carry.\nLawnPygmy: \"...move.\"\nLawnPygmy: \"...move now.\"\nLawnPygmy: A dry, croaking call rings through the airless void of Lua.\nLawnPygmy: \"...Move!\"\nYue: The other three follow your lead to the extraction point.\nLawnPygmy: White, howling light flies from a palm shivering with the effort of holding itself up.\nLawnPygmy: Beyond it, Sentient metal vaporizes with eerie whispers.\nLawnPygmy: \"...out... of... my... Way.\"\nYue: You aren't the only one with a void-powered hand blast thingy. Ilunes, Freja, and Spindle, carried by their Warframes, likewise make short work of the Battalyst pursuers. You have vague memories of...doing this before?\nLawnPygmy: \"...forward... push forward...\"\nLawnPygmy: \"...don't... let them... stop you...\"\nLawnPygmy: Inside the Lander, the Rhino trudges forward, one thudding step at a time.\nLawnPygmy: It moves with singular purpose in the direction of its mother's voice.\nYue: As the lander hatch rotates, you noticed something. Black warframes. The same helmets. Sentient armor. Hunhow weapons. Stalker's acolytes, climbing into the Lisets of the rest of your Cell.\nLawnPygmy: The Rhino stares down two pairs of eyes; one held in strong arms, the other adorned by a crimson horn.\nLawnPygmy: \"Get... OUT!\"\nLawnPygmy: White heat fills the belly of the Lander, leaving no room for the leaping Shadow within.\nLawnPygmy: \"Hnnh...\"\nLawnPygmy: \"...mom?\"\nLawnPygmy: \"I'm here mom...\"\nLawnPygmy: Two eyes, a dull blue, crack open and flinch at the light, their lids heavy with disuse.\nLawnPygmy: The light within them grows brighter, stronger. It begins to eclipse the light from without, and the head those eyes belong to lifts itself on a wobbly neck.\nLawnPygmy: Gold hair tumbles out of the seal and rests in sweaty curls on pale cheeks.\nYue: The Lotus creates holoscreens that show three other children: A young man, either a boyish girl or a feminine boy, and a smug girl with space glasses. It's not hard to tell who's who.\nYue: https://i.imgur.com/MaoyqHl.jpg\nLawnPygmy: The strength within those eyes grows, staring hard at each in turn. Despite the feeble muscles holding it up, the head holds steady, propped up by sheer willpower and singular focus.\nLawnPygmy: Eyes are met one by one.\nLawnPygmy: \"...what, do I remember?\"\nYue: Ilunes is the one to respond. \"You need to try and remember for yourself.\"\nLawnPygmy: \"...a hand. My mother's... in mine.\"\nLawnPygmy: \"...we stuck together, and I stood between the adults and the others.\"\nYue: \"When I wanted to put them out of...Oh, Bright Ones...\"\nLawnPygmy: \"...they struck. I struck back.\"\nLawnPygmy: \"When they hit... I learned to hit *harder*.\"\nLawnPygmy: \"...I wanted to make them pay.\"\nLawnPygmy: \"...to protect those who couldn't do so themselves.\"\nYue: (I chose Zenurik, Rawk and Spindly chose Madurai)\nLawnPygmy: \"I was Unairu... I learned that the enemy could attack and attack... and I would be there at the end...\"\nLawnPygmy: \"Grinning down at them.\"\nLawnPygmy: \"Hurt, but not broken. My bloody grin was the last thing I made them see.\"\nLawnPygmy: \"...evil... would break on me like waves on sand...\"\nLawnPygmy: \"...they would come, and I would remain.\"\nLawnPygmy: *picks up the Lens resting on their thigh and tucks it into a pocket on their suit*\nYue: The displays blink out, one by one.\nLawnPygmy: The last message sent, before the links are disconnected, reads: \"They will pay.\"",
 "title": ""
}