{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_de",
  "re_url"
 ],
 "key": "Eyr6BHza",
 "pasteDate": "Feb 26, 2018, 2:03:05 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Guten Tag ungespielt.net Team,\nhiermit wrde ich mich gerne als Supporter fr ungespielt.net bewerben.\n\nZu Beginn gibt es ein kleines Inhaltsverzeichnis von meiner Bewerbung.\n\n1. Meine Persnlichkeit\n2. Aktivitt\n3. Erfahrungen bezglich der Supporterrolle\n4. Was zeichnet einen Supporter aus? | Was sind die Aufgaben eines Supporters?\n5. Warum mchte ich Supporter werden? | Wieso genau mich?\n6. Strken und Schwchen\n\n1. Meine Persnlichkeit\nMein Name lautet Jason, ich bin 17 Jahre alt und wurde am 02.03.1999 nhe Dsseldorf geboren.\nZurzeit besuche ich ein Berufskolleg, welches den Schwerpunkt \"Wirtschaft\" hat. Dort absolviere ich zurzeit die Unterstufe fr mein Fachabitur. Meine Haupt-Freizeitbeschfitgung ist Sport. Wenn ich mal einen anstrengenden Tag hatte, gehe ich gerne laufen.\nIn dieser Online-Welt bin ich als \"Sippey\" untwerwegs. Ich spiele Minecraft mittlerweile schon seit 4 Jahren und mir macht es trotz dieser langen Zeit immernoch eine menge Spa. \n\n2. Aktivitt\nDie Uhrzeiten sind individuell und knnen sich verschieben.\n\n\nMontag: 15 Uhr bis 24 Uhr\nDienstag: 14 Uhr bis 24 Uhr\nMittwoch: 16 Uhr bis 24 Uhr\nDonnerstag: 15 Uhr bis 24 Uhr\nFreitag: 14 Uhr bis 24 Uhr\n\nAn Wochenenden meistens von 12 Uhr bis in die Nacht, da bei mir keine Internetsperre vorhanden ist.\nDiese Wochenzeiten knnen sich auch durch bestimmte Termine (Geburtstage, Feiern etc.) verndern.\n\n3. Erfahrung bezglich der Supporterrolle\nMeine ersten Erfahrungen durfte ich im Sudkamp-Network Team sammeln. Das Netzwerk war nicht sehr bekannt und war grundstzlich nur an Modifikationen Interessiert (Hexxit, Tekkit etc.). Als ich merkte, dass es sich nicht weiter lohnt, noch mehr Arbeit in das Netzwerk zu stecken, habe ich das Team als Teamleiter freiwillig verlassen.\nDas nchste grere Netzwerk war KlickMich.net. Ich war dort fr einige Monate als Moderator beschftigt. Als ich bemerkte, dass dieses Projekt nicht wirklich ernst genommen wurde, habe ich dieses Team ebenfalls verlassen.\nDas vorletzte Serverteam, bei dem ich mitgewirkt habe war dieBuddies.net. Dort war ich ebenfalls als Moderator ttig. Nach einigen Monaten hat sich dieses Netzwerk leider wegen Internen Streitigkeiten geschlossen. \nAktuell bin ich noch in einem kleineren Netzwerk ttig. Dort bin ich als Supporter unterwegs und bearbeite hauptschlich Reports. Bei einer Annahme wrde ich das IceVizion.de Team verlassen.\n\n4. Was zeichnet einen Supporter aus? | Was sind die Aufgaben eines Supporters?\n\n- Was zeichnet einen Supporter aus?\nEin Supporter sollte auf freundschaftlicher und vertaulicher Weise eine Bindung zu den User aufbauen, denn die Spieler machen ein Minecraft-Netzwerk aus. Jeder Spieler hat das Recht, so behandelt zu werden wie man selbst behandelt werden mchte und auf jede Frage eine Antwort zu bekommen. Jede Antwort sollte qualitativ gut beantwortet werden. \n\n- Was sind die Aufgaben eines Supporters?\nDie Aufgaben der Supporter sind meist Unterschiedlich. Natrlich wissen die Bewerber nicht, welche genauen Aufgabenbereiche die Supporter bei ungespielt.net haben. Trotzdem gibt es einige Sachen, die selbstverstndlich sind.\n\nDie Aufgaben der Supporter werden grundstzlich in 3 Aufgabenbereiche gespalten.\n- Ingame Support\n- Forum Support\n- Teamspeak Support\n\nIngame Support:\nJeder Supporter sollte in der Lage sein, die Fragen der Spieler zu beantworten. Dies muss auf freundschaftlicher Basis geschehen.\n\nForum Support:\nJeder Supporter sollte in der Lage sein, Ordnung im Forum zu halten und uerst freundliche und informative Antworten zu liefern.\n\nTeamspeak Support:\nJeder Supporter sollte in der Lage sein, jedem Spieler eine ernste Antwort zu liefern. Dies sollte auf freundschaftlicher Basis geschehen.\n\n5. Warum mchte ich Supporter werden? | Wieso genau mich?\n\n- Warum mchte ich Supporter werden?\nIch habe durch meine Laufbahn ein riesiges Interesse daran entwickelt, anderen Menschen zu helfen. Auerdem macht es mir immer wieder eine Freude, wenn ich anderen Menschen helfen konnte. \nZudem gefllt mir die Abwechslung zwischen den vorhandenen Aufgabenbereichen sehr. Ich habe sehr viel Spa daran, mich mit den Spielern auseinanderzusetzen. Wenn ich nochmal zurck denke, dann vermisse ich das Supporten von Spielern und die Zusammenarbeit in einem Team wirklich sehr.\n\n- Wieso genau mich?\nIch denke, dass ich als Supporter geeignet bin, da ich die ntigen grammatikalischen Kenntnisse vorlegen kann. Ich besitze ebenfalls eine ausreichende geistige Reife, um ordentlichen und professionellen Support leisten zu knnen. Aufgrund meiner bisherigen Erfahrung kann ich ebenfalls nochmal appellieren, dass ich wirklich fr diesen Posten geeignet wre. \n\n6. Strken und Schwchen\n\nStrken:\nIch bin ein sehr hflicher und ehrlicher Mensch. Objektives Handeln habe ich mit der Zeit in den verschiedenen Netzwerken gelernt. Auerdem behandel ich jede Person sehr Respektvoll, um ein richtiges Verhltnis mit der Person aufzubauen. Zudem kann ich gut mit Kritik umgehen und auch mit Ehrlichkeit Kritik gegenber anderen begrnden. Durch die Erfahrungen, die ich gemacht habe, bin ich ein sehr lernfhiger Mensch.\n\nSchwchen: \nEiner meiner Schwchen ist, dass ich recht ungeduldig bin. Meistens bei Vernderungen, die sehr viele Auswirkungen mit sich fhren. Bei Personen die ich noch nicht so gut kenne, bin ich sehr zurckhaltend. Auf Dauer lockert sich die Lage dann aber auch.\n\n\nIch wrde mich ber eine positive Antwort sehr freuen.\n\nMit freundlichen gren,\n\nJason | Sippey",
 "title": ""
}