{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_protection",
  "lg_en"
 ],
 "key": "eyXm54bP",
 "pasteDate": "Feb 18, 2018, 6:02:48 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Life on Vegeta was pretty desolate a lot more then usual given their current predicament. Though he wasn't aware of the exact details of exactly what has caused the decline in life upon Vegeta, \"We cannot let this be it.\" he spoke calmly starring out at ocean which was the exact opposite of calm, the vicious waves crashed against the shore, mirroring his own inner turmoil. It was in a constant state of flux. Kneeling down near the shore grasping at the loose dirt below them, on the outside, Vegeta truly looked like a huge dirt pile it was likely that this had to do with there arrival upon the planet centuries ago. There history was a complicated on, one full of fighting, and no one could blame them. It might have been born on a flight-or-fight moment or it was just in them to thirst for power and chaos. A sigh escaped the young man tightening his grip forcing the loose dirt out at the seems of his hand, \"I'm not going to allow this to be it.\" he assured himself as he wasn't quite sure if he truly believed in himself a few months ago, \"For Akami, Marrow, and the rest of my kind we will thrive back to glory.\" for he was sure of that much, \"No matter the cost.\" he spoke for the first time in his life with a hundred percent certainty within his life. The training he devised wouldn't be easy it will push his own body to the very breaking point. Slipping out a note from his pocket, \"Hope you all can stay safe while I go out on my own...\" he whispered his heart feeling heavy with what he was about to do \"Please to what ever God is out there allow them protection.\" he finally trailed off sliding on a large black cloak for the Southern parts of Vegeta seemed a more cold. Pinning the note to their house as his body burst like a rocket kicking up dirt into the air, \"I will see you guys very soon..\"",
 "title": ""
}