{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_target",
  "kw_stole",
  "re_url",
  "kw_attacks",
  "lg_en",
  "kw_attack"
 ],
 "key": "eZaKS2Js",
 "pasteDate": "Feb 10, 2018, 9:00:53 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "\"This void is an eyesore.\nThis void.\nThis void.\nThis void.\nThis void.\nThis void.\"\n\n\nI am in idol hell. Send help.\n\n\n(THE ENTIRE BERSERK GOD SPEECH)\n\n\nI REJECT MY HUMANITY, JOJO!\n\n\n\"Day One i drank sake galore, on the second hangover i swore, a new land i'd find, which sake left behind, But day three i came right back for more\" -Marisa Kirisame, WaHH\n\n\nTime to wait for the next 6-22 contest.\n\n\nmarisa stole my precious potato\n\n\n\"I'm watching a wind waker speedrun right now and thinking back to 3-4 years ago when I was also watching wind waker speedruns, but in very bad health due to eating disorders. Now 3 years later, with tons of friends, a happy life and meat on my bones, and I owe a LOT of that to Touhou. As cheesy as that sounds, this franchise made virtually every aspect of my life better, be it in form of entertainment, interaction with other people who enjoy it, or music to listen to whenever. Also gave me an idea of what I want to do with my life, as opposed to before when I thought I'd be doing nothing forever, maybe work at a super market at minimal pay. I'm writing more than intended. Touhou is great\n\"\n\n\n\"I met ZUN once in a restaurant in Tokyo when my group had been given his table by accident. Apparently he has some sort of a constant table there, and the restaurant had screwed it up (since they thought ZUN was coming on Tuesday, even though it was Wednesday).\n\nAnyways, the manager came to us very ashamed (it was quite a fine restaurant,) and asked us to move to another table. Of course they would refund our food if we simply agreed to move. My sister and my cousin agreed enthusiastically agreed, but I decided to play a jerk about it.\n\nI told him that I definitely cannot understand that, or the reason why we couldn't finish our food, since we just arrived a quarter ago and finally could order our meals.\n\nThen out of nowhere came ZUN, who kindly told us that their group can wait in the bar until we are finished. As a big Touhou-fan, I froze from this and apologised, how we can move so that he can get \"\"his\"\" table.\n\nZUN was very grateful, shaked my hand, gave me his business card, and asked me to call him later. I built my courage for a long time and finally got myself to call my idol. Briefly said, an elevent-month affair developed between us, which was full of strong action between men. Our bodies became one one time after another. From Morocco to French Riviera, and all the way to the islands of Galapagos, ZUN and I made love to each other on six of the seven continents.\n\"\n\n\ncome to the US so you can punch me\n\n\n\"  In this world, everyone has an empty box to fill to represent themselves. They come in various sizes, colors, contents and degree of fulfillment.\n  Mine, however, is blank and small. An empty shell. A void. This may looks bad but it is not. Nothing dictates that a void cannot fill the void of another, effectively satisfying it and possibly completing it.\n  Thankfully, my box is small and easy to fulfill as a little bit of text is almost enough to do so.\n  \"\n\n\n  AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\n\n\n  Don't hurt me please! It was just one picture! Don't tell the FBI!\n\n\nWhat the fuck did you just fucking say about me, you little baka? I'll have you know that I graduated top of my class in Keine's terakoya, and I've been involved in numerous secret attacks on Reimu Hakurei, and I have over 300 confirmed frozen frogs. I am trained in icicle warfare and I'm the top fairy in the entire Gensokyo population. You are nothing to me but just another target to freeze. I will wipe you the fuck out with spells the likes of which have never been seen before in Gensokyo, mark my fucking words. You think that you can get away with saying that shit to me over Yukari's gap? Think again, fucker. As we speak I am contacting my secret network of s across Gensokyo and your location is being traced right now so you better prepare for the Little Bug Storm, maggot. The Little Bug Storm that wipes out the pathetic little thing you call your life. You're fucking dead, human. I can be anywhere, anytime, and I can kill you in over seven hundred different ways, and that's just with my icicles. Not only am I extensively trained in non-spell combat, but I have access to the entire library of the Scarlet Devil Mansion and I will use it to its full extent to wipe your miserable ass off the face of Gensokyo, you little baka. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will freeze in it. You're fucking dead, baka.\n\n\ni dont understand why the fuck people buy touhou games i mean the only thing cool about all of this is anything except the official games like those games are a fucking shit and you cant say im wrong yes maybe that beerdrinking boi does all the stuff music graphics and all yes i dont have a problem with that i respect it but lets talk about 15.5 lmao it has the same fucking things as the previous fighting game but with a few character added ok you can say if it has an acceptable price its good but wtf +20 buck on steam like you see when a call of duty comes out for 60 bucks its the same fucking thing and we all hate it but when this happens to touhou we just make memes and all happy maybe you cant see it know but the game industry will soon became a dumpster an those kind of games are helping to achieve this i will say lots of more things but fuck i have things to do\n\n\n\"IT'S NOT EASY LISTING 7 FAVORITE TOUHOUS WHEN YOURE IN A TANK SHOOTING AT PYD POSITIONS IN AFRIN\n\nI HOPE I CAN MAKE IT\n\nI WANT TO GO TO GENSOKYO AND FUCK THE RABBIT\"\n\n\n\"Before Lunatic Kingdom\n\"\"Everyone! Get inside! NOW!\"\" Keine practically pushed the worried schoolchildren inside of the schoolhouse. The entire horizon of Gensoskyo was flooded with the blasts and flashes of Gensokyo. The whole of the human village was in an uproar. The worse case scenario was about to unfold. Street stalls were knocked over, and dust was kicked up. Heida no Akyuu approached the window to see what all this chaos was about until she was stopped by her two attendants. \"\"Child of Miare! It is too dangerous for you to be here! They took her against her will towards the safest part of the house. \"\"W-what's going on?!\"\" She demanded to know. \"\"I-Invaders of some kind my lady! Reports from all across Gensokyo!\"\" Akyuu couldn't believe it. How did something like this happen? Nothing on this scale had ever happened, not even with the youkai incidents of the past few years. It was unimaginable. The Tengu of Youkai Mountain continued to attack the Spider Probe which was purging the very life of the mountain. Sanae tried to get a better look, the unseen enemy was surrounding the probe, protecting it from the onslaught. Yukari Yakumo stood at the edge of the Human Village. Ran and Chen stood side by side facing her. \"\"Whatever happens, the Human Village must not be invaded by the enemy.\"\" She instructs. \"\"Send for my allies and protect the village at all costs.\"\" She gazes just beyond her Shikigami at the barrage of danmaku spread all across the land. This was something she could not forgive, and she intended to punish the culprit in the worst way imaginable. The danmaku were coming from an unseen source, but the presence of the pure Lunarian filth could be felt by Yukari in every corner of the horizon. \"\"Reimu must be the one to travel to the Lunar Capital. Have her sent to the one who hides in the Bamboo Thicket.\"\"\"\n\n\n               SCENE 6                                            JOHNNY                (JOHNNY STORMS ONTO THE ROOF WITH A WATER BOTTLE AND LOOKS                 CONFUSED AND LOST. HE SLAMS THE DOOR BEHIND HIM.)                 I did not hit her. It's not true! It's bullshit, I did not                 hit her. Why did Lisa say that? I would never do that!                 (JOHNNY THROWS THE BOTTLE OF WATER TO THE GROUND.)                 I did not hit her!                 (JOHNNY PICKS UP A FOOTBALL FROM THE FLOOR AND TOSSES IT IN                 THE AIR.)                 Oh hi Mark. What's up with you?                                              MARK                Not much. I'm just sitting up here thinking about life. I                 wonder if girls like to cheat like guys do?                                             JOHNNY                What makes you say that?                                              MARK                (MARK STANDS UP AND JOHNNY TOSSES THE BALL TO HIM.)                 Well, I'm just thinking, you know.                                             JOHNNY                (THEY CONTINUE TO TOSS THE BALL WHILE THEY ARE TALKING.)                 I don't have to worry about that because Lisa is loyal to me.                                              MARK                You never know. People are very strange this days. I used to                 know a girl who had a dozen guys. One of them found out about                 it, beat her up and she ended up in a hospital.                                             JOHNNY                What a story!    \n\n\n\"Where have all the good girls gone\nAnd where are all the gods?\nWhere's the streetwise oni to fight the rising odds?\nIsn't there a red white upon a purple steed?\nLate at night I toss and I turn\nAnd I dream of what I need\n\nI need a miko\nI'm holding out for a miko in this eternal night\nShe's gotta be strong\nAnd she's gotta be fast\nAnd she's exterminate right\nI need a miko\nI'm holding out for a miko 'til the morning light\nShe's gotta be sure\nAnd it's gotta be soon\nAnd she's gotta fight eternal life!\nEternal life\n\nSomewhere after midnight\nIn my land of fantasy\nSomewhere just beyond my reach\nThere's someone reaching back for me\nRacing on danmaku and rising to bring good\nIt's gonna take a shrine maiden to save us from these woods\n\nI need a miko\nI'm holding out for a miko in this eternal night\nShe's gotta be strong\nAnd she's gotta be fast\nAnd she's exterminate right\nI need a miko\nI'm holding out for a miko 'til the morning light\nShe's gotta be sure\nAnd it's gotta be soon\nAnd she's gotta fight eternal life!\n\nI need a miko\nI'm holding out for a miko 'til the end of the night\n\nUp where the mountains meet the heavens above\nOut where the moonlight burns the sky\nI could swear there's a phoenix somewhere\nWho can't die\nThrough the wind, and the chill, and the dark\nAnd the horde of youkai\nI can feel her approach like a fire from Makai\n\nI need a miko\nI'm holding out for a miko in this eternal night\nShe's gotta be strong\nAnd she's gotta be fast\nAnd she's exterminate right\nI need a miko\nI'm holding out for a miko 'til the morning light\nShe's gotta be sure\nAnd it's gotta be soon\nAnd she's gotta fight eternal life!\n\nI need a miko\nI'm holding out for a miko in this eternal night\nShe's gotta be strong\nAnd she's gotta be fast\nAnd she's exterminate right\nI need a miko\nI'm holding out for a miko 'til the morning light\nShe's gotta be sure\nAnd it's gotta be soon\nAnd she's gotta fight eternal life!\n\nI need a miko\nI'm holding out for a miko in this eternal night\n\"\n\n\nEmpty jump grab oki into j.HK cr.LK (2) Light Tatsu into Shoryuken\n\n\n\"All I know what to do anymore is press X, it's been so long. I don't know what Touhou is anymore. The other day, I was playing AoCF and tried to bomb my opponent. With just the X button. Everything has become bombs to me. There are no other shot types, no other spells other than Spirit Sign \"\"Fantasy Seal\"\". The only thing I know how to do is press A in ULiL. Occasionally, I release and I cry a little. I bomb to kill bosses, but I wish I was bombed instead. It's become a joke of sorts, or maybe it's just my life. I can't go anywhere without seeing the X key. I went to feed my dog the other night, but instead of eating she Duplex Barriered. I had to put her down. I sit in the corner now, counting the days, the days where we shall see sweet release from this torment, the day when boss attacks were something special. Those days are long gone. I have seen God, and I have seen the devil, but they are one and the same. I stared into the void and screamed, and it screamed back: \"\"Love Sign 'Master Spark'\"\".\n\nBased off of a copypasta on this page originally from a deleted post by u/leviathan426: https://www.reddit.com/r/yugioh/comments/6xt8l2/ryugioh_official_omg_its_september_where_is_the/\"\n\n\n\"The emptiness, the void\nA thing i didn't believe existed until you showed me the pit. I always imagined that if the void did exist that it would be black and i couldn't type words into it. What did i do to acquire the great power of filling the void i think to myself as I type whatever comes to mind into the box perhaps this is a bad idea but even if it is if i have been chosen to fill a void i probably should fill it I couldn't even imagine what would happen if i failed to fill a void. \n\n\n\n       Mostly because I never thought about it since i didn't believe in the existence of the void. My mind goes blank, not as blank as how the void was before i opend this tab i hope but regardless blank i hope the void has been filled to its minimum requirement of unvoidness for I always felt that if the void does exist it must be filled to its requirements.\n\nI have an idea! But it was a bad one that the void would reject. I better stop before i get lost in the vastness of the void.\n\n\n\n\"\n\n\nIf fortune teller doesn't win I'm going to kill myself.\n\n\nhttps://i.imgur.com/0zG3RSp.jpg\n\n\nDon't tell me what to do.\n\n\nThanks for this box.\n\n\n\"\n\n    pls rember that wen u feel scare or frigten\n    never forget ttimes wen u feeled happy\n\n    wen day is dark alway rember happy day\n\n\n\"\n\n\nI'm on Reddit in calc 2 lecture. I hope I don't fail\n\n\n\"you literally have no idea how any bit of this genre works. you know nothing, nothing at all, about game design. you basically don't care about the actual gameplay of touhou lolk and only care about the characters and the music and all of these other things that are only in games to dress them up and provide an interesting concept. you don't understand that touhou lolk is not at all like the previous touhou games and has almost no quality control. the reason why people are upset at jaimers's video is because they completely misread his description and are drawing all of these conclusions from it that are not even talking about what he's said, while somehow largely agreeing with him. you don't know english when you see it. you speak a different language that vaguely resembles english, and there can only be misunderstandings when dealing with you. i am tired of it. you don't care about this game or this series, and all you've done is completely waste my time speaking nonsense. good bye and good riddance.\n\nmuted\"\n\n\nIf Ran doesn't get into the top 20, I will shit a house\n\n\nTewi is best 2hu because she's like your average old cartoon character alright bye\n\n\nI don't know if you'll actually read this but you seem like a cool person. Just wanted to let you know. I don't actually know who's going to read this, but whoever you are, I'm sure you're pretty sick. Have a nice day. :)\n\n\n\"Google\n\nNo Nipponese page to vote!!!\n\nThis site, under no circumstances deserves my vote if there is no Nipponese page to vote.\nThe /r/Touhou popularity poll should be for everyone, including the eastern fans, which only speak sane languages. I can not even navigate the page which brings me to the votes, because Google Translate has trouble translating it. If there is no Nipponese site to vote, I am not voting, simply for the reason that I can not navigate this thing. Do it better with the next contest.\n\n- \n\"\n\n\nMy hat is my friend. It helps me relax.\n\n\nhttps://i.imgur.com/TTMW4gv.jpg\n\n\nI am madly in love with Yukari Yakumo.\n\n\n(THROUGH A GLASS, DARKLY\nby Gen. George S. Patton, Jr.)\n\n\nAge range capping out at 26+ makes me feel real old.\n\n\n\"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"",
 "title": "TOUHOU POPULARITY BOX"
}