{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "fizrB6NB",
 "pasteDate": "Feb 27, 2018, 10:51:28 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Silver Nymphs\n\nA herbivore race formed from the offspring of male unicorns and female nymphs in a region where the two races came into frequent contact.  Eventually those children grew plentiful enough to band together and create their own race seperate from a tribe of half-breeds.  Though their blood holds the same power and qualities of a unicorn's, their first form is that of a humanoid, owed in part to their original parent's genetic makeup.  Pregnant females are guarded carefully by the tribe, not only because they are not a particularly prolific race (due in part to their indefinite lifespans), but also because the females cannot change forms for the duration of their pregnancy for risk of harm to the child.  Their way of changing forms is not so violent or painful to the host as it would be a werecreature, but the shifting of form and organs has been known to cause miscarriages.  For the first few years, the child's form is instinctively linked to their mother's with a psychic bond of sorts.  When the mother changes her form, the child's form changes to match, following along the telepathic link developed at birth.  As time passes, their telepathic abilities grow stronger, and the psychic bond connecting their transformation dissolves.  Usually around two years of age the child can shift on their own, and the bond is so faint that it can only be used by the mother in emergencies.  By five years of age, even the most dependent child's bond has faded to nothing and is entirely on their own when it comes to shifting their form.\n\nThough many believe that the horn is the source of the Silver Nymph's power, that is not the whole truth.  Their horns act as a natural amplifier, and even a store of power as the creature grows older, but they would be able to heal and communicate telepathically even without it.  Their power would be considerably weakened by the removal of their horn and they become unable to sustain a long session of using their magical talents, though enough practice and time can be spent to build their power to formidable levels in its absence.  So too, the expected pale, silvery coloring expected of unicorns, or a race coined the Silver Nymph, is not their only genetic inclination.  The magical nature that left nymphs able to breed with such a differently genetic creature as a unicorn holds true with Silver Nymphs, and allows them to interbreed with many unexpected creatures.  Females impregnated by another race have an extremely high tendency for their nymph nature to prevail in their offspring, while males are more likely to leave females with a child of their own race.  In the instance of a female having a child with another race, some genetic alterations can come about, from anything ranging from different coloring to the addition of wings, spines, or more subtle changes.  For the most part, however, they are a xenophobic race which leaves children of mixed race to be few and far between.  Half-breed children are taken care of, but each tribe is different in their treatment or acceptance of them.\n\nCulturally, Silver Nymphs live in very simplistic tribal society.  As creatures born from nypmhs and unicorns, material belongings tend to mean very little to them.  They keep minimal belongings, living in the most basic of dwellings.  Some choose to live without such things entirely, keeping to their unicorn forms and living amongst herds.  Despite the peaceful nature of their predecessors, tribes train their young to fight and defend themselves, sometimes to extremes.  Considering themselves the protectors of their ancestors, they often act as guardians to the habitats of their full-blooded unicorn and nymph relatives.",
 "title": ""
}