{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "re_url",
  "lg_en"
 ],
 "key": "fRTT33W7",
 "pasteDate": "Feb 9, 2018, 1:03:54 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Step One: Creating your profile.\n\nWhen creating your profile the first thing you should know is what niche do you want?\n\nList of niche idea's:\nLuxury/Money\nSad Quotes\nVideo Textposts\nTextposts\nMemes\nSuccess/Motivation\nHypebeast\nClothing\n\nAfter picking your niche, you need a username. Your username should not only fit your niche, but look nice. A username between 1-10 characters would be ideal, anything longer just looks messy.\n\nNext you want to have a profile picture. Profile pictures of a female such as Kylie Jenner are quite popular now and look nice with your account, of course if you have a Luxury/Money account, you may want a photo of someone flexing money, who knows.\n\nAfter finding a profile picture, your bio and display name are a necessity. Nobody will follow you if you do not have these. For your display name, you can put your nice or something like, ur cute, hoping someone will see it and follow you. As for your bio, you want to have something short and clean. A popular bio is \"follow me before I'm famous,\" or \"follow me before i become hot.\" Either of those are short and look good on your profile.\n\nThe people you follow also say what kind of page you are. If all the accounts you follow are Meme Pages, you most likely have a Meme Page as well. This is also helpful for getting content. Follow accounts of similar niche.\n\n\nStep Two: Getting a small follower base.\n\nGetting a small following is a must for the beginning of a page. An extremely easy way to get a small following fast is the Celebrity method.\n\nMethod:\n\nFollow 30-50 Celebrities with 1 million+ followers.\nWait 2 minutes and unfollow them.\nFollow them back and repeat.\n\nBe careful of how many times you do this and how fast or else you will get follow/unfollow blocked.\n\nThis gains you followers because this puts you at the top of the celebs 'following' list so someone who's looking at who's following the celeb may come across your account.\n\nStep Three: Posting; When and How Many Times?\n\nWhen you are just starting out on a new page you want to get a good amount of posts right away. Post 10 photos a day for the first few days, after that you should dial back down to about 3 a day. 3 is a great and steady amount to grow your account at. As for when you should post, spread each post out by 3 hours. Maybe one at Noon, 3, and 6.\n\nStep Four: Creating a Business Profile.\n\nIn order to do this you need to link a Facebook account to it. Having a business profile on Instagram gives you plenty of insights about your account including: where your followers are from, how many followers gained/lost in a week, best times to post on each day of the week, etc. The list goes on. This is very nice and helpful to have on an Instagram account and I highly suggest doing it, but it's not needed.\n\nStep Five: Getting More Followers.\n\nIn this part I will tell you some ways to get followers.\ni) Investing money. Investing money is a great way to get followers, the going rate for real and ACTIVE followers is about $65/1000 (but it may vary depending on who you buy promotions from), depending on your current financial state and commitment, it may or may not be worth the money.\nii) Self Promotion. Self promotion is basically manipulating people into following you. This often includes you following a bunch of pages that spam shoutouts so you can comment stuff such as \"Nobody ever follows me\" to gain followers. Here are some sentences that can gain you followers:\n\nNobody ever follows me!\nI never post those spammy shoutouts!\nMy mom said that if I get ___followers today she will quit smoking!\n\nI'm sure there are plenty more you can think about, pretty self explanatory.\n\nLast way is hitting the explore page, this get's you more activity as well as brings new people to your page. I will touch upon how to hit the explore page in the next step.\n\nStep Six: Maximizing Engagement & Hitting Explore Page.\n\nAn easy way to maximize your engagement is making a slideshow every time you post. Your first photo will be the meme, or luxury post, and then include a riddle or something to boost your comments. An example of this is:\n\n\n\nThis photo alone will get you more than 10x the normal amount of comments you would normally get.\n\nA very easy way to get your posts onto the explore page is by doing likes and comments with other accounts. Essentially this is where you, and a bunch of other accounts are all in a dm group. And when one of you posts, they say something along the lines of, \"Like and Comment on my recent, cwd returning fast.\" They just like and comment on your photos. Only do this with accounts that have similar niches and amount of followers as you for the best outcomes. NOTE: there is NEVER a guarantee to making it onto the explore page.\n\nTelegram can also get you into larger groups of people with many more accounts. I do not use Telegram, just a personal preference but here is more info on that:\nhttps://wolfglobal.org\nhttps://gainstagram.wordpress.com/2017/01/14/updated-2017-list-of-instagram-engagement-groups/\n\n\nStep Seven: Making Money?\n\nAfter time goes on, you may reach an amount of followers where you can actually make money from your account. In my opinion, any account that has at least 10,000 followers is able to make money. You can sell shoutouts to companies, businesses, and even other members on the forum. If you need help making shoutout prices please PM me.\n\nI have also heard some things about OG Ads. Unfortunately I cannot write a review on it as I have never personally used it, but I do have some friends who make good amounts from this. Here is the link for it:https://ogads.com\n\nStep Eight: SFS\n\nSFS means 'Shoutout for Shoutout.' This is just the exchanging of shoutouts with another account of relevant size to gain followers. One form of shoutouts is posting on your story. This is a great way of shoutouts because it is very easy and they automatically get deleted after 24 hours. The other form of shoutouts is feed shoutouts. I would not suggest doing this until you've hit around 100,000 otherwise it can easily kill your pages activity and leave you in a dump.\n\nStuff to Keep in Mind.\n\nKeep consistent. Don't slack when growing an account, it throws you off more than missing a class at school.\n\nStay in touch with your followers. Make them feel apart of a family, make them feel wanted so that they never unfollow your page!\n\nMake friends on Instagram. You never know when you may need help with something, having friends and connections are great!",
 "title": ""
}