{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_fr"
 ],
 "key": "frrBLT5c",
 "pasteDate": "Feb 12, 2018, 1:40:39 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Bonjour/Bonsoir cher membres du staff de Zonia, Je me prsente donc pour tre Modrateur sur votre serveur.\n\nSommaire :\nI/Prsentation IRL\nII/Prsentation IG\nIII/Horaires\nIV/Motivations\nV/Conclusion\n\nI/Prsentation IRL\nJe mappelle Lucas j'ai 13 ans, je ne en 2004 le 26 aot.\nJ'habite dans la Loire (42)  Roanne.\nNiveau de mon physique, je fais 1m59 pour 42 kilos.\nJ'ai les yeux bleu clair et je suis brun.\nJe pratique normment de d'activits sportives comme le football en club ainsi que du tennis de table et des cours de guitare.\nJ'ai extrmement d'exprience dans ces 3 activits.\nJ'aime conseiller les nouveau que a soit dans mon club ou au collge, pour leurs donner de bonnes bases afin qu'ils dbutent dans de trs bonnes conditions. J'ai deux frres ainsi qu'une sur.\nMes parents sont spars puit les deux se sont remari avec d'autres personnes.\nJe suis actuellement au collge en 4me, j'ai de trs bonnes notes et j'en suis fier.\n\nII/Prsentation IG\nJ'ai commenc Minecraft il y a fort longtemp, j'ai donc connu d'ajouts, modes de jeux...\nJ'ai une assez bonne exprience en tant que Modrateur j'ai t grad sur plusieurs serveurs assez connus comme : FunPvP ou ThunderNetwork \nJ'ai voulu  plusieurs reprises voulu crer mon propre serveur, je manquais de temps et de motivations.\nCeux-ci tais orients vers le SKyblock, le PvP-faction et le pratice mais je n'avais pas assez d'argent pour continuer  payer la machine.\nJ'ai galement une chane youtube de bientt 500 abonns et j'aimerais bien faire des vidos sur votre serveur comme des \"Admins Sries\" ou des \"Let's play - PvP Faction\"\n\nIII/Horaires\n  Pendant les cours \nLundi : 17h  22h\nMardi : 17h  23h\nMercredi : 13h  22h\nJeudi : 17h  22h\nVendredi 16h  24h\nSamedi : 10h  24h\nDimache : 10h  23h\n\n  Pendant les vacances\nLundi : 10h  23h\nMardi : 10h  23h\nMercredi : 10h  23h\nJeudi : 10h  23h\nVendredi :  10h  23h\nSamedi : 10h  23h\nDimache : 10h  23h\n\nPour les cas particuliers je vous prviendrai plusieurs jours  l'avance.\n\nIV/Motivations\nJe conscient que le grade \"Modrateur\" est une responsabilit importante pour le dveloppement du serveur.\nSelon moi, c'est une tache difficile mais pas insurmontable, car avec de lexprience, on s'habitue aux commandes\naux responsabilits et demande en tous genres des joueurs.\nDonc certes, c'est difficile mais j'aime le risque et je pense avoir la patience pour tre Modrateur et pour bannir et tre  l'ecoute des joueurs. \n\nV/Conclusion\nJ'espre que cette candidature vous auras plu, je suis sincrement dterminer  veiller aux rgles du serveur avec soin, avec attention, je penses avoir du boulot si j'obtiens ce grade et je l'excuterais avec joie.\nJe penses bien m'entendre avec le Staff.\nMerci d'avoir pris le temps de lire cette candidature, d'y avoir pris attention.\nJ'attends vos rponses avec impatience \nBonne journe/Soire",
 "title": "Calus"
}