{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_sv"
 ],
 "key": "fT5y5pdP",
 "pasteDate": "Feb 21, 2018, 6:01:01 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "S kallade vanlisar utgr hlften av Sveriges befolkning. Men nr medierna vl ger dem utrymme r det ofta i dokuspor dr de frljligas och framhlls som korkade, omoraliska, som freaks.\n\nLisa Magnusson\n\nVad r klass? Det r inte alltid ltt att veta. Nr det fackliga idinstitutet Katalys rknade ut hur mycket utrymme personer frn arbetarklassen ges i medierna skedde detta genom en kombination av marxistiska och weberianska perspektiv, vad nu det innebr. I 76 procent av fallen fastslogs i alla fall klass genom yrke och befattning. \n\nInte ens detta r frsts absoluta markrer. Men det r fint att vnstern tminstone frsker prata om klass igen, att den ntligen letar sig bort frn den erbarmligt engda och essentialistiska identitetspolitiken. Och nog har Katalys rtt i sitt huvudbudskap som r att medierna r medelklassens domn. \n\nDet finns en given likriktning i det att journalistiken utgr frn en humanistisk tradition. Hatsajternas alternativa medier r drfr bara ett alternativ fr dem som trttnat p riktiga medier. \n\nRiktiga medier vrnar principen om allas lika vrde. De premierar ppenhet och nyfikenhet, och drar drfr ocks till sig de antiauktoritrt sinnade  socialliberaler och mjukvnster. Men framfr allt frbinder sig journalistiken att vara opartisk. Det r dock svrt nr utblicken r begrnsad. \n\nSVT:s id om mngfald handlar om att hitta fler kvinnor, mrkhyade och grna ngon som r queer.\nFr det r ett statistiskt faktum att s gott som alla journalister bor p stockholmska Sdermalm eller i andra vlmende medelklassomrden i storstderna. Den geografiska koncentrationen pverkar vad man pratar om p morgonmtena, vad man rapporterar om. \n\nAtt oskra anstllningsvillkor blir allt vanligare skapar ven det en slagsida: Frutsttningen fr att vara journalist blir mer och mer en frga om att redan ha ekonomisk trygghet  en partner eller frldrar som kan tcka upp om man pltsligt str utan inkomst.\n\nNr man betnker detta blir det bara naturligt att exempelvis SVT:s id om mngfald handlar om att hitta fler kvinnor, mrkhyade och grna ngon som r queer, och att dessa fiskas upp ur samma medelklasspool som alla andra. Det pverkar inte bara mjligheterna fr enskilda individer utan hela programutbudet.\n\nArbetarklasspersoner ser ytterst sllan sin egen sort p tv, nnu mer sllan hr de den tala. Nr de vl syns r det ofta i dokuspor dr de frljligas och framhlls som korkade, omoraliska, som freaks. Det framgr av tidigare forskning som Katalys sammanstllt.\n\nDessa s kallade vanlisar utgr allts bortt hlften av Sveriges befolkning. Det r inte bara deprimerande att de behandlas som om den maktens arena som r medierna inte angr dem. Det r ett verkligt problem.",
 "title": ""
}