{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_fr"
 ],
 "key": "fxy2n8fK",
 "pasteDate": "Feb 17, 2018, 2:54:14 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Totalement d'accord. C'est d'ailleurs pour a qu'avant de ragir, d'une quelconque manire qu'il soit, avec son savoir tout autant localise et situe que celui de n'importe qui, il faut tendre sa perspective.\nEt pour le coup tendons la perspective de la critique fministe et pas que du langage, et des traditions critiques et on se trouve en milieu commun qui nous empche de penser que des choses sortent du cul des gens, mme en tant joyeusement clystrophile.\n\nCommenons par l'introduction provocatrice a l'image en question qui n'est videmment pas sans rappeler le sarcasme de Solanas dans le SCUM Manifesto.\nQuand a l'argument du langage patriarcal, il serait ridicule de penser qu'une personne random sur Tumblr en est l'instigatrice. Si notre chr.e linguiste avait recherch.e pour \"women\", au moins, on dcouvrirait que l'argument sur  wyf-man  est considr par des chercheuses fministes comme tant symboliquement une reprsentation de socits plus galitaires, et que l'instauration de la distinction exclurait automatiquement (qui est aussi un argument de Derrida par ailleurs). Pour rpondre a \"women\", les fministes anglophones ont remis d'usage le terme \"womyn\" du Scots, en notant que le terme \"wimmin\" tait aussi d'usage au XIXme sicle, ce qui rend la gnralisation de \"women\" une gnralisation politise et politisable  travers le prisme des rapports sociaux de genre.\nL'argument du langage prend encore plus de sens sous le prisme du concept de \"male-as-norm\". Ce qui est loin d'tre un concept nouveau, car les femmes rvolutionnaires pendant la Rvolution Franaise demandaient dj l'abolition des distinctions de tout sexe et genre (et ce, incluant spcifiquement le langage, qu'elles sont folles ces femmes !). Sous ce concept donc on comprend que la racine tymologique du mot n'est qu'un paramtre de la formation grammaticale des langages. Je ne ferais pas dans la facilite en utilisant de Beauvoir sur ce point, surtout qu'elle parle peu de l'anglais, mais des 1980, Dale Spender montre l'androcentrisme de l'anglais dans son Man Made Language.\n\nIl est vrai qu'en tant que dtenteurs de privilges, il est difficile de pouvoir contempler l'tendu de notre propre phallocentrisme (et a vrai dire, phallogocentrisme, dans le cas prsent), mais heureusement pour cela nous avons accs plus facilement a de la culture et pouvons donc nous intresser rellement aux productions culturelles sur le langage (comme plus haut...) ainsi qu'aux productions scientifiques.\nSi la smiotique est intressante, c'est bien parce qu'elle situe le sens dans un contexte plus large qu'une suite d'accumulation d'alteration phontique et considre le choix et la place des mots dans une cosmologie plus large. On se rend donc vite compte que lorsque le monopole du langage (crit, parl, public, officiel) est dtenu par une caste de genre, la construction historique de ce langage ne peut tre que politiquement situe.",
 "title": ""
}