{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_de"
 ],
 "key": "gNht3eN1",
 "pasteDate": "Feb 28, 2018, 11:19:10 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "1. Schon frher war der Klimaschutz ein groes Thema in der Politik.\n    Doch hat sich bis heute etwas gendert? Oder Leben wir immer noch wie im Jahr 2007?\n    Denn das Klima verndert sich immer weiter!\n\n2. Doch um diese Frage beantworten zu knnen mssen wir erst einmal wissen was Energie und\n    Energiewende bedeutet.\n \n 2.1.  Der Begriff Energie kommt aus dem griechischem Energeia und bedeutet ,,wirkende Kraft.\n           Energie ist die Fhigkeit, mechanische Arbeit zu verrichten, Wrme abzugeben\n           oder Licht auszustrahlen. Sie wird in der Einheit Joule angegeben. (James Prescott Joule)\n\n4.1. Um das Klima in Deutschland zu schtzen, kann jeder etwas dafr tun. Denn anstatt mit dem\n           Auto zur Arbeit oder zur Schule zu fahren kann man auch bei gutem Wetter das Fahrrad \n           Benutzen. Oder in Grostdten den Bus oder die Bahn nehmen. Auch beim Einkauf kann \n           man das Klima schtzen, indem man lndliche Produkte \n           einkauft, wie z.B. die Milch und die Eier des Bauern oder das Fleisch des Metzgers und das\n           Brot vom Bcker. Bei einem groen Einkaufsladen wie REWE oder ALDI usw. legt die Ware \n           einen weiteren Weg hinter sich, der Transport von dessen Lebensmitteln stt nmlich CO2    \n           aus, dazu gehren Schiffe, Flugzeuge und LKWs.\n\n\n4.3.1. Auch im Stromverbrauch kann man Geld und Strom sparen. Denn tglich brennt Licht im \n           Haushalt, dass nicht bentigt wird, denn wenn man das Zimmer verlsst kann\n           man das Licht ausschalten. Auch Computer und Fernseher ziehen viel Strom, diese kann man\n           in den Stromsparmodus setzen und auch andere elektronische Gerte, die immer am Strom\n           angeschlossen sind, an ferngesteuerte Ein-und Ausschaltsteckdosen schlieen.\n           Oder auch zu Weihnachten, kann man auch auf die Leuchtdekoration verzichten und statt  \n           dessen kleine Kerzen benutzen. Und anstatt normale Glhbirnen im Haushalt zu benutzen\n           kann man auch Energiesparlampen kaufen.\n\n\n5. Das Kernkraftwerk: Ein Kernkraftwerk braucht Rohstoffe wie Uran oder Plutonium, um Elektrizitt herstellen zu knnen, doch dies erfordert einen langen und komplizierten Prozess, denn ein Kernkraftwerk ist nicht so gnstig wie man Denkt bis zu 7 Mrd.  kann der Bau eines Kernkraftwerks kosten. Im Kernkraftwerk werden 3 Kreislufe unterschieden: der Primrkreislauf, wo im Kernreaktor z.B. die Uranatome gespalten werden, den Sekundrkreislauf, wo der Generator durch elektrische Induktion elektrische Spannung aufbaut und den Khlkreislauf, wo der Dampf kondensiert wird.\nDoch im Reaktorgebude, wo der Kernreaktor ist herrscht hohe radioaktive Strahlung, deshalb ist er von sehr dickem Beton ummantelt. Wie viel Watt ein Kernkraftwerk aufbringen kann ist nicht so einfach zu sagen, denn Kernkraftwerke sind unterschiedlich gro, doch das Kernkraftwerk in Philippsburg hat im Jahr 2016 ber 10 mio. Kilowattstunden Strom erzeugt.\n\n6.4. Wenn wir nur von Fossiler Energie leben wrden, dann wren wir wortwrtlich den Untergang geweiht, denn wenn Kohlekraftwerke weiterhin aktiv bleiben und Autos immer noch mit Benzin und Diesel fahren und wir alle Atomkraftwerke auch noch aktiv lassen gehen uns nicht nur irgendwann die Ressourcen aus sondern wir verndern das Klima so stark, dass wir dies stark zu spren bekommen, denn dann gbe es keinen Winter mehr, es gbe auch keinen Nordpol mehr und der Wasserspiegel wrde enorm steigen, sodass viele Inseln nicht mehr existieren.",
 "title": "NWA Fi kp"
}