{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_pass",
  "kw_down",
  "kw_security",
  "kw_patch",
  "kw_flood"
 ],
 "key": "GRaATXLC",
 "pasteDate": "Feb 27, 2018, 11:51:39 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "What a night last night was! The gelert whimpered a bit just thinking about it again. Did all that REALLY happen? One deep breath though his nose reaffirmed that it had. Even after a hot showerler, the faint scent of Brayce's urine was still lightly marking his fur. Not that it was overly noticeable, but to someone with a keen scene of smell, like Oshail's gay nose, it was quite clear what that scent was and what it meant. He touched his pink collar and fidgeted, he had not bothered to take it off after returning home. It definitely was a night to remember. Just touching that collar and remembering last night made his lil nub twitch! He knew he should feel ashamed, as he rubbed his ear fur and brought those velvety fingers to his nose to breathe in that marking ixil piss scent, but he only whimpered and gave his hard lil nub a rub or two. He was a shamefully urine marked piss gelert and he loved it! It was Brayces scent, Brayces gift and he felt naughty for accepting it and that deep down, he wanted to accept it again!\n\nThe day passed and his thoughts turned to the sexy ixil lawyer, he was not able to stop thinking about him, and while excited, also was a bit sad, tonight would be Brayce's last courtroom case before the magical lawyer adventure continued well out of the area. Part of Oshail felt all needy and like he wanted to cry, he was becoming far to used to seeing Brayce, but knew there was nothing that could be done, both lived in two different worlds, and just thinking about it felt like a punch in the stomach, if he thought about it to long.\n\nAs evening came Oshail got ready for the trial, he found himself both squirmy and a bit embarrassed as he got ready. He wore a half shirt he got from the courtroom case, it was a girls half tee, white with big pink letters that spelled 'Brayce!' on it along with a pair of jean short shorts, and of course, that pink collar. While embarrassed, his eager horniness and excitement got the better of the naughty fan gelert, and he found himself heading to the courtroom case dressed so shamefully; consequences be dammed. He heard several snickers and giggles but just paid it no mind, he made his choice, even if he did not get to see his sexy ixil idol, he was going to be himself.\n\nAs he got to the court and waited to get in, the gelert heard several more snickers and giggles but tried to ignore it, too late to back out now anyway. As he moved closer to the entrance and screening area, he saw that large kiko security guard from last nights trial and blushed red as he saw him starting to come over to him. He let out a bit of a whimper as he was pulled out of line. \n\n\"Well well well, if it isn't the little bitch again, I'll screen this one myself boys.\" he said with a smirk, and without any subtlety as he pulled Oshail by the arm into a room just inside the entrance area. \n\nThe gelert squirmed and was quite sheepish looking and did not know what to expect and could only pin his ears back in defense.\n\n\"Relax bitch, I have something for you\" the kiko said and rubbed the gelerts head, as he did, he smirked as his nose flared a bit. Nothing was spoken, but the smirk said it all, he knew the fellow gay could smell the ixil's piss marking on the gelert. He felt so naughty, piss-covered by another male and anyone with a good nose would be able to tell!\n\n\"Here, wear this, and report to the back courtroom floor area following the trial, Brayce is expecting you after.\" he unfurled a laminated back-courtroom floor pass on a lanyard and hung it around the gelert's neck and gave that ass of his a good squeeze as he walked him out and into the courtroom case hall, escorting him to a front row seat!\n\nThis night was going to be amazing, this seat was much better then the ticket he actually had. It was a short while later, the lights came down and the trial started. There he was, Oshail felt like such a fool and such a helpless eager fan, he actually squealed and clapped and jumped up and down cheering when Brayce took the courtroom floor. The lights were bright, and the ixil glowed. Well to the gelert, he glowed, was it the lights? Was it an eager projection of emotion that played a lucid trick on his perception, who was to say, the sissy fan gelert did not think that hard about it. All he was to Oshail, was a sexy and gifted lawyer, who he felt a heart felt connection with. As Brayce examined the first witness, the gelert's spirit soared, he felt like he could fly on the lawyering as he surrounded him. \n\nHe saw Brayce's eye flash at they caught the light, and he looked towards the sissy. Had he seen him? He saw the flash of his smile, was Brayce smiling at the gelert? Oh, how excited it made Oshail, even if he was not, just thinking about it made his  tail wiggle and made him jump up and down more, the silly cute girls tee exposing more and more of his tummy as he did. Something else caught Oshails eye, a can of energy drink, several of them. One near his keyboard, another by his stool, another that he seem to sip on between each trial. It made the gelert blush and remember last night and how many cans Brayce drank, and how... strong a flow of piss it had given him, like he had been saving it all night. Oshail fidgeted and found his eyes focusing on Brayce's crotch area as he stood and moved. He was unsure if he was just not being extra careful to notice, but could swear he could see every outline of that cock though his pants!\n\nBefore he knew it, many swallows of neon green energy drink later, the trial was ending, it was the second of two very amazing cross-examinations, Brayce was giving the crowd everything he had, every part of the trial had been filled with his magical gift of lawyering and it touched the audience and certainly one particular gelert, who was half excited and half crying it was all coming to a close. The courtroom floor emptied and the house lights came up, and the crowds clapping slowly faded as everyone started to make their way out. Oshail rubbed his eyes a bit, rubbing his damp velvety fingers on his shorts to dry them, and then remembered his appointment! He had been so lost in the trial and the fact that Brayce would be moving on with the magical lawyer adventure, that he had nearly forgotten about back courtroom floor.\n\nHe looked around, the road crew was already breaking down the courtroom floor and getting busy, as he started to wander towards the back courtroom floor area. The cute collared sissy wiggled and fidgeted a bit, already imagining how embarrassing it was going to be, figuring Brayce would be having a lot of guests back courtroom floor. Oshail was a bit puzzled though, and thought perhaps the he was in the wrong area when he first headed back courtroom floor, as there was no activity and no guests. A few of the road crew grinned at him, and took note of his laminate and did not stop him from wandering around. He was looking around for where Brayce's dressing room might be and bumped into the large kiko security guard.\n\n\"Oh.. gah..s...sorry.. I did not see, you...I was um, trying to find the dressing room\" Oshail whimpered out softly and blushed.\n\nThe kiko looked down at him, silently for a long moment, a long enough moment that he felt intimidated. After was seemed like an eternity, the large gay smirked and reached to hold up the shiny heart shaped tag that read 'Bitch' on the collar around Oshail's neck.\n\n\"Bitch, you know, that suits you, I don't imagine you will ever need any other name.\" He said, but not in a mean way, just a matter of fact way and petted the gelerts head and ears in an affectionate demeaning way, which frankly Oshail responded to by muzzling up and whimpering in pleasure. He felt the large kiko put his hands on Oshail's shoulders and turn him towards a door and said, \"Go on Bitch, right there, he is expecting you.\"\n\nThe walk to the door seemed like the longest walk of his life, his heart pounded, his body trembled, he felt awkward, and excited all at the same time, his felt a little light headed as he timidly knocked on the door.\n\n\"Come on in..\" that friendly sexy voice called out.\n\nOshail entered and was already beaming a smile, not even realizing it, his ears perked and pointed up, and his  tail poking out of these jean shorts wiggled rapidly. He may not have realized it, but Brayce did and smirked and laughed a bit seeing how much like any real eager gelert he was, happy to see someone they loved, come into their view. \n\n\"Oh my little bitch, my good little gelert, looks like you are happy to see me huh? Well I am definitely happy to see you again.\" he said with is lyrical voice.\n\nOshail was just flooded with emotion and didn't even think...just pushed against him, into Brayce's chest and hugged like he never hugged anyone before.\n\n\"Ohhh y..yes yes...so happy to see you\" he managed to say in a soft excited squeal, loving the feel of those strong purple tawny furred arms hugging him back.\n\nHe just clung to Brayce for a while, nuzzling as he did, rubbing that velvety snout and pink nose into the shorter male, he could hear the ixils breathing, feel his strong warm body and could have hugged him forever. \n\n\"Now my obedient little gelert, I am quite glad to see you...\" \n\nBrayce paused and Oshail felt the ixils nose on the top of his gelert head, right between his ears, and could hear the deep inhaling sound, followed by a light chuckle, as the sexy lawyer checked up on his handy work from last night and could easily pick up that scent which still clung to the gelert. He lightly growled in pleasure, just knowing the bitch kept that scent made his large cock twitch.\n\n\"... but I think my little bitch is a bit over dressed, don't you?\" \n\nHe had finished his sentence, which made Oshail blush a bit, but he looked up onto those amazing eyes of his and that smile on the ixils face and he did not even hesitate, the sissy would do anything to hear those magic words again 'Good gelert' and he nodded and started to strip. Wiggling out of those shorts and cute pink panties, his little pathetically cute, laughable nub was already twitching. Oshail fidgeted and removed his cute half tee, soon dressed in only the pink collar Brayce had put on him the night before. \n\n\"Good gelert, you still have my gift, what a good obedient bitch you really are\" Brayce said without a hint of meanness in his voice and the effect was evident, as the gelerts cute woefully undersized penis throbbed throbbed as hard as possible, and his cute whimper moan was like lawyering to Brayce's ears.\n\n\"Now my gelert, I have another special treat for you, well, several of them, but first things first.\" The ixil said and lightly patted Oshail's shoulder and lightly pressed. \n\n'His gelert! His gelert!' those words almost made Oshail spurt right there on the spot. He never felt so naughty before or so loved before and the gelert knelt down as he felt the light push on his shoulders, eagerly doing so, wanting to do so! Brayce smiled seeing the loving display of submission and had pulled out that leash again from last night and clipped it to the gelerts collar which caused a delightful gelert bitch moan to fill the ixils ears. Brayce smiled more hearing the moans come from his beloved gelert pet at how naughty and excited his toy was.\n\n\"Oh such a good bitch, I see my gelert loves that nice leash on his collar, now I have your next treat sissy, and I think you know what it is.\" \n\nBrayce said as he took the last swallows from a large can of energy drink can he had drained, and leaned forward, pushing his crotch right against the gelerts velvety, pink nosed snout, murring in a pleasurable moan as his plumpness in those snug pants grinded against his sissy bitch. \n\n\"Get my pants off gelert, I have a special purple treat for you\" Brayce said, which made the gelert blush but just nuzzle that crotch of Brayces all the more.\n\nIt only occurred to him now, as Oshail mentally calculated how many energy drink cans Brayce had downed during the trial and made him whimpered a bit, but not hesitate to open those pants. The smell of warm ixil fur and musk hit his very sensitive gelert nose right away, and he pushed in and nuzzled. Nuzzling that dark patch of fur, right down to that swollen cock of his, it was not quite throbbing hard, but swollen plump and fat and eager to piss hard, quite a distinct difference. The sissy was beside himself and was already starting to kiss and lick at Brayce's cock tip.\n\n\"Ah ah ah.. now now my little gelert, one moment, as I recall you were quite the naughty messy lil bitch last night, weren't you?\" Brayce said teasingly, not in a mean spirited, but rather in an amusing way, as he reach over to the desk to grab a bag and pulled something out.\n\n\"Here, hold on to this bitch\" he said and put the contents into Oshail's velvety hands. The gelert gasped and looked down at it. It was a large petpet bowl but not just any petpet bowl. It was shiny silver on the inside and the outside was covered entirely in pink rubber, around the top and bottom was a circle of pretty white beads and big and bold white letters read 'BITCH\". Oshail was speechless, he whined and blushed but throbbed even more as he held the bowl.\n\n\"Lower gelert, there we go, hold it right under your cute little wussy face, right against your chest. Now, you do want to be my good gelert dont you, my sweet little piss bitch? Thats right, not just a bitch my little wussy-wuss sissy, but my eager little piss, bitch, don't you?\" \n\nBrayce said, he was smirking and enjoying himself, but also squirming a bit on his own, the strong need to piss was nearly overwhelming him. It had been building since before the trial. As soon as his security agent had advised him Oshail had showed up, he started hitting the energy drinks hard and stoped using the bathroom. That was many hours ago now, Brayce was trying not to show it but he had been holding off all night and drinking a lot of extra, just for this moment. Buzzed from all the caffeine and energy he put in his trial, he needed a sweet release badly. Oshail was trembling, his pretty pierced ears poking straight up, he was squirming and fidgeting and nodded, not able to even form a word at the moment. As it turns out, Brayce is who spoke again next, trying his best to keep calm, but was starting to sweat a bit as he held back an epic flood of piss that was desperate to get out. If he did not know relief as at hand, he would have had his legs crossed and being doing a piss dance of desperation to get to the bathroom in time! \n\n\"Good very very good gelert, but you'll have to do better then a nod, I bet you are real good at begging arent you, you little nubby piss-bitch? You see, I don't mean just be my little gelert, my piss bitch just for tonight.\" He said, and with his hand that was not holding the leash around Oshail's neck, pointed to the far back corner. \n\nThe gelert turned his head and saw something that made him do a double take, he could not believe it, he turned back to Brayce, who spoke again and then turned his gaze back to the corner. \n\n\"How would you like to be my little piss-bitch gelert for the entire magical lawyer adventure? I have many many more cities to dispense justice in.\" \n\nBrayce's voice was breathy now, panting almost and he was trembling. Oshail looked back and confirmed what he had seen. It was a rather large cage, not very tall, but if someone was on their hands and knees, there was plenty of room to crawl and lay. The bars were pink and the entire bottom was covered in a pink rubber covered thick mat. The door, which obviously locked when closed, was wide open at the moment and inside there was a large plump looking butt plug as well as a pair of thick padded latex mitts. There was also a depression in the mat at the edge of the cage, that would hold that new petpet bowl perfectly.\n\nOshail was overwhelmed now, head light with delirious euphoria, chest swelled with emotion, his heart pounded as the blood rushed to his face and head, he was not sure how to act, or what to say. It did not seem real, but at the same time, like a dream come true. Was Brayce really wanting to take him on magical lawyer adventure, to be his gelert, his bitch? Was it a joke? He did not know what to do or what to say in that moment, and just let his naughty desires and heart speak for him.\n\n\"Yes please please please Brayce, please! I want to be your gelert, your good gelert, your good little gelert and obedient bitch, your good little piss bitch, please take me with you please please\" the gelert begged, actually begged and wiggled stubby tail in more excitement then he ever felt!\n\nBrayce gasped, his lips parted and quivered as he gasped out again, the look of desperation and pleasure on his face was making him growl, \n\n\"Yes Goo...Good gelert, oh good good pupppy UHhhhhhhhh hhhhhhhhhohhhh uhhhhhhhhhhhhhhhhh Goooood Bitch!!!\" Oshail heard the words and seconds later felt it, a full blast of piss right in his face. \n\nHe had been looking up at Brayce, and that thick cock of his was perfectly placed to splatter his face, which it did. He heard another moan and another hot hot blast, a jet a rush of the dark hot piss splashed! Oshail let out a whimpering gasp and felt another and another splash soak his snout and pretty face. He thought that was all that was coming at first, and then suddenly a constant strong stream pulse and pumped out, all over his face. His paws trembled holding the bowl and the naughty shameful sound of the torrents and torrents of piss, dripping from his face and filling up that special petpet bowl filled both their ears! The most shameful thing happened next, and it was not all that piss in his face or the dripping dark urine filling up the shiny metal lined petpet bowl, it was something more humiliating.\n\nIt was that moment that followed, Brayce had moaned as he let all that saved up piss go, letting it all blast his gelert in the face with out concern, knowing the bitch wanted it, moaning out \"Good gelert, Good Bitch\" as Brayces pee-gasm gave him such intense pleasure from how long he had been holding it. It was that moment as the words filled Oshail's ears... that the sissy spurted! No one touching his cock, not even stroking it himself, just the pleasure of being on his knees, on that leash and collar, seeing that cage, knowing Brayce wanted him.... and being pissed on, being the obedient piss bitch of his dreams for the sexy ixil.... that was it, that is what made that sissy, little cocked gelert, spurt!\n\nHe whined and moaned and spurted and spurted and spurted and opened that pretty snout wider, wanting to call out Brayces name, but instead letting several mouthfuls of that musky slightly salty pee that tease over his tongue, swallowing what he could and letting the rest dribble into that special petpet bowl. Brayce kept pissing! Gosh where was it all coming from, Oshail had thought, he felt the horny sexy pissing ixil push his cock into that parted snout, giving several fucking thrusts in, while he was pissing, just back and forth pushing motions as he kept pissing, lightly piss muzzle fucking his bitch. The gelert swallowing some, as much as he could, but most of it splashing down his face into that waiting bowl! \n\nBrayce was moaning and stopped himself from pissing for a moment, letting out a breathy soft growl \n\n\"Good Bitch, down with that bowl, down with my good little gelert nubby piss-bitch...\" he said chuckling a bit, seeing the excitable pansy spurted himself just from being pissed on.\n\nUshering the gelert to set the nearly half filled bowl down, and giving that leash a gentle but meaningful tug down. The sissy knew what Brayce wanted and the gelert wanted it too. He got on all fours, like a completely content happy eager gelert bitch and lowered snout and pushed face to the bowl and lapped and licked at that still warm piss, like an obedient bitch. As the naughty gelert licked and lapped the warm pee from his special new Bitch dog bowel he could feel Brayce stand over him. Moments later he heard the sexy ixil moan again and start pissing again! How was it possible! So much pee! It started to splash down right on the top of his velvety gelert head and back of his neck, marking his fur, marking his gelert, his bitch lovingly! As it splashed and marked that fur, it ran off his face neck and snout right into the large waiting bowl, not a drop of it would go to waste, both of them knew it. The gelert whimpered and lapped lapped lapped like any eager gelert, wiggling his stub tail excitedly. To think, all he was hoping for was an autographed picture tonight!",
 "title": ""
}