{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "re_email",
  "kw_down",
  "kw_security",
  "kw_shut",
  "kw_flood"
 ],
 "key": "HF0sZ7YQ",
 "pasteDate": "Feb 26, 2018, 12:53:36 PM",
 "relevancy": 2.0,
 "relevant": false,
 "text": "Flower Dust, this DMT also contains NMT another psychoactive Alkaloid.\n\n-Better for Beginners - easier to smoke than the white DMT\n\n-slightly Body high\n\n-smells like Flowers\n\n-Best way to consume DMT is a simple Oil pipe.\n\nWhat one will experience on DMT is impossible to predict. It can range from heaven to cyberspace to jeweled palaces, visions of jungle animals, contacts with extraterrestrial gods, links with ancient spirits, or adventures with fairies and elves. The DMT user should be prepared for anything. On a full dose of DMT one can not guide the trip with the mind or thoughts the way an LSD trip can be guided. One can, however direct the trip by what I will call the \"intent of the soul\" or will.\n\nTerence McKenna on DMT:\n\nUnder the influence of DMT, the world becomes an Arabian labyrinth, a palace, a more than possible Martian jewel, vast with motifs that flood the gaping mind with complex and wordless awe.\n\nThe extraordinary ease with which DMT utterly destroys all boundaries and conveys one into an impossible-to-anticipate and compellingly Other dimension is one of the miracles of life itself. And this first miracle is followed by a second: the utter ease and simplicity with which enzyme systems in the brain recognize the DMT molecules at the synapses.\n\nWhen intoxicated by DMT, the mind finds itself in a convincingly real, apparently coexisting alien world. Not a world about our thoughts, our hopes, our fears; rather, a world about the tykes  their joys, their dreams, their poetry. Why? I have not the faintest idea.\n\nSmoking DMT for the first time can be a challenge. There are a set of rules one should follow to get the best out of it.\n\nDOSAGE:\n\nThe beautiful thing about DMT is that it is not possible to overdose on it (DMT starts to become poisonous at about 6g). Don't be afraid of taking a bit too much. When asked, most people will say 50mg is the correct amount. The truth is that it varies from person to person and that the technique is crucial. If you manage to vaporize 30mg correctly without burning anything you might have a stronger experience than with 50mg poorly handled DMT.\n\n50mg is a good start nonetheless and the amount I recommend to all beginners because it leaves room for mistakes. If it still does not work out, take the experience with you and don't give up. Be relaxed. It's a journey and you learn a lot on the way.\n\nOnce you become an experienced journeyer you can start using larger amounts of DMT to get deeper into the realm. The experience of 70mg+ can be overwhelming if you take DMT for the first time but once you get used to it you will no longer be afraid.\n\nSETTING:\n\nThe setting is very important. Be in a calm place where you are certain that nothing unexpected will happen. People randomly coming in and things like that can ruin the trip.\n\nIn case you live in a noisy environment it's a good idea to use headphones and ambient/soothing music.\n\nMake sure you feel absolutely safe. Anything that bothers you should be removed. Don't do it anywhere where you think you can feel scared or annoyed once you are tripping.\n\nIt is important that it's very quiet. Only nice sounds are allowed (birds, waves etc). If you do it with someone else, they must shut the hell up! The only exception to that is when someone whispers into your ear to induce thoughts into your trip. That person should be experienced though.\n\nTECHNIQUES:\n\nThe smoking techniques are very important as DMT needs to be evaporated. It shouldn't be burned because that would destroy the effects. You know the DMT is evaporated when you feel a hot sensation in your throat. If your technique is correct the DMT will be completely tasteless. If it's harsh it's because you burned some DMT. Even if you get the harsh taste just continue.\n\nInhalation: Once the DMT is evaporated you need to start  inhaling deeply and slowly until you can't keep going any more. Hold your breath for at least 10 seconds. Do it as long as possible. Else you will waste DMT once you exhale.\n\nTake as many hits as you need to break through. Usually it's 2-3. With a good technique and a little experience you will become able to breakthrough after one single hit.If you do not break through all you will feel is a slight buzz and maybe some light hallucinations.\n\nImportant: If you fail you have to wait at least 1 hour before trying again, else you will just fail again as the body needs to recover.\n\nShipping and Customs:\n\nEverything is sent out from a very low Profile Country Germany with an excellent postal service my successful shipping rate is nearly 100%. \n\nDMT is a rare drug which does not get found by scanners or dogs. The stealth will focus on making the package look as regular and boring as possible. \n\n\n\n------------------------------------\n\n\n\nTerms and conditions\n\nHello dear Travelers!\n\nI am a small Psychedelics Manufacturer from Germany and i offer you the finest:\n\n- NN-DMT\n- Changa\n- Magic Mushrooms\n\nEverything is produced under professional Lab conditions.\n\nI want to deliver the best Quality possible with the highest security Standards available.\n\nMy quantities are very limited to ensure this promise.\n\nI don't sell to Teenager in general or Adults with a bad attitude.\n\nIf you are not satisfied with the service I provide contact me, please. We can try and figure something out together.\n\nIf the Markets go down you can also contact me via Email:\n\nAuraMajesticGarden@secmail.pro\n\nBest is to safe the address somewhere ;)\n\n***Please do not forget to mark your Order as received as soon as you get it, thank you in advance :)***\n\nPlease note that i DONT ship to:\n\n-Russia\n-Australia\n-China\n\nWith placing an Order you accept my Terms and Conditions:\n\n-No Refunds\n-i offer a one time 50% reship on your next Order if the package is lost, if you leave negative Feedback - no Service\n\nUntil i am allowed to FE i will reject some Orders from buyers with no or negative buying History and or risky Countrys.\n---Sorry for the inconvenience---",
 "title": ""
}