{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_evil"
 ],
 "key": "HNxxZYdL",
 "pasteDate": "Feb 17, 2018, 9:11:20 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Race Rules:\n\n-Each race has basic IC knowledge of certain things to their race. In order to know something about a Race that's not your own, is to have someone tell you, or you overhear someone talking about it IC.\nEXP: A Super Saiyan is seen for the first time during a player event that has 3 players present. {Players 4,8, and 9}\nPLayers 1,2,3,5,7 do not know Super Saiyan is possible or happened at all unless told by players 4,8, or 9.\n\nAll caves and zones are OOC unless shown:\n-Humans/Spirit Dolls/Namekians: Has knowledge of all of Earth's caves.\n-Demons: Demons spawned in Hell have Knowledge of the Afterlife races (Kai, Demigod, Demon) and may shift appearance at will. Demons spawned on Earth have no knowledge of the Afterlife.\n-Kais: Know of hell, as well as its location, but do not know of Hells exit.\n-Saiyans: Usage of moons along with Black Moons, it is prohibited unless given admin permission, or IC knowledge of the skill. A Saiyan may only transform into an Oozaru if a Full Moon is out, or the skills to make a fake moon.\n-Icers: Forced evil or chaotic neutral on creation.\n-Makyo: Has the same knowledge as Humans, Namekians and Spirit Dolls. They know of the Makyo Star and its effects.\n-Aliens: Can not know meta information. They may make their own lore.\n\nEach Race has their own restrictions until they reach certain ages. If a character is below the ages stated, they may not do the following:\nBaby: Train/engage in combat (they may flee if granted the opening), apply/use skills, kill.\nChild: Engage in combat (they may flee if granted the opening) or kill\nPreteen: Kill\nTeen: Kill\nAdult: No Restrictions\n\nRace Age Stages:\nHuman/Spirit Doll/Tsujin: Baby 1-3/ Child 4-9/ Preteen 10-13/ Teen 14-18/ Adult 19+\nSaiyan/Demigod/Half-Saiyan/Makyo/Demon: Baby 1-2/ Child 3-6/ Preteen 7-10/ Teen 11-18/ Adult 19+\nAlien - Unknown.\nNamekian - Baby 1/ Child 2-3/ Preteen 4-5/ Teen 6-7/ Adult 8+\nAndroid/Majin/Icer/Bio-Android/Kai: No age restrictions",
 "title": "Dragon Ages RPvP Rules Section 2: Ages/Races"
}