{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "huQK36Dt",
 "pasteDate": "Feb 21, 2018, 7:11:16 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "R.J. Griffin & Company general contractors completed construction of the 46,347 square foot, 1,300-seat sanctuary for the oldest African American church in riverside, New Macedonia Baptist Church at 7725 Highway 85in Riverdale, GA. Contractor R.J. Griffin & Company, Program Manager Silverman Construction Management, Architects Williams, Russell and Johnson along with the Church Building Committee emphasized the definition of team players throughout this nearly three-year, $10.7 million project. The new Clayton County sanctuary building hosted its first church services on Sunday, March 4th, 2007.\n\tCounseled by experienced peers, Church Building Committee Chairperson Mary Joffer and the Committee recommended the hiring of program manager Silverman Construction in 2003 as their advocate for a successful building project. Silverman assisted with contractor selection and, together with the churches selected architect, all four groups collaborated patiently for 1.5 years on the design-build project to design a maximum use facility to the churches budget, all the while negotiating the ever-increasing construction cost index. It took eight budgets to get to the guaranteed maximum price contract and R.J. Griffin broke ground on the 29-acre site on January 9th, 2006.\n\tI take my hat off to Mary Joffer and the building committee for this project going as smoothly as it did, said Griffin project manager Brent Strength. Their desire to make wise. Long-lived decisions set a tone for the rest of the team when the Church hired Silverman Construction as its program manager. Her committees responsiveness and focus on their desired end-product emphasized purpose, over a time schedule, and steadily drove the success of this design-build project.\n\tDave Borchers, V.P. with Silverman Construction Management commented, All-in-all, Mary and the Committee trusted us to do what was best for their church. Our insistence on a collaborative team approach wouldnt have meant a thing without their trust and the trust we had among all members.\n\tThe new building features the sanctuary with moveable choir seating for up to 150, a $1 million audio/video/lighting package and an administrative wing which houses classrooms and administrative services. Future phases are planned.\nThe Georgia Highway Contractors Association recently held its 69th Annual Convention in Amelia Island, Florida. GHCA Executive Director, Steven L. Parks stated, it was one of the best attended meetings in GHCA history.\n\tGHCA President, L. Arnie Pittman, Pittman Construction Co., is pleased to announce its newest members to the GHCA Board of Directors. The new members are James S. Cornett, Cornett Bridge, Inc., E.S. Sandy Sanford, Jr., Blount Sanford Construction Co., Inc., and David E. Snell, E.R. Snell Contractor, Inc. Each will serve a two-year term.\n\tThe remaining members of the GHCA Board of Directors include Mike Copeland, Tractor & Equipment Co., Richard A. Dykes, Everett Dykes Grassing Co., Inc., Dan S. Littlefield, Littlefield Construction Co., Charles E. Matthew, C.W. Matthews Contracting Co, Inc., Cecil Pearce, Rodgers Bridge Co. Inc., J. Donald Peek, Peek Pavement Marking, LLC, Jeff S. Satterwhite, Oldcastle Precast, Inc., Ferrell Scruggs, Jr., The Scruggs Co., W. Clyde.\n\tShepherd III, Plant Improvement Co, Inc., Joel Spivey, Douglas Asphalt Co., Donald B. Stewart, Jr., Stewart Bros., Inc. and A. Frank Whitaker, Reeves Construction Co.\n\tGHCAs Executive Committee consists of President, L. Arnie Pittman, Pittman Construction Co., Vice President, J. Bruce Melton, Oxford Construction Co., Second Vice President, Micheal G. Williams, Sunbelt Structures, Inc., Secretary, Q. William Hammack, Jr. and Treasurer, Max W. Carnes, Jr.",
 "title": ""
}