{
 "espireDate": "1W",
 "format": "text",
 "jSonReasons": [
  "kw_leak",
  "kw_down",
  "lg_en",
  "kw_hack"
 ],
 "key": "igzCwbyF",
 "pasteDate": "Feb 11, 2018, 7:22:33 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "8:36 - St4g: henlo\n8:38 - Lysander Valerius: Heeeeya\n8:38 - St4g: whatsup\n8:39 - Lysander Valerius: Not much just really tired out from sexual stuff lmao. Whats up for you?\n8:41 - St4g: uh...\n8:41 - Lysander Valerius: What? Lol\n8:42 - St4g: why would you even share this information\n8:42 - St4g: yikes...\n8:42 - Lysander Valerius: Lmao you kind of asked sorry, just what was up I'd be straight up lieing if I said something else.\n8:44 - Lysander Valerius: Didnt go straight to what I was doing, was just like oh tired from sexual stuff lmao. Anywho what're you up too?\n9:03 - St4g: whats this i smell here\n9:04 - St4g: smells like a big lying virgin\n9:04 - Lysander Valerius: >Literally after just having sex\n9:05 - Lysander Valerius: I only am in one relationship. ALthough I do have a couple of friends who i've had sex with lmao\n9:05 - Lysander Valerius: Furry convention hotell\n9:06 - Lysander Valerius: What is that like, unbelieveable to you? Lmao\n9:07 - Lysander Valerius: We'd be in a very diffrent world if everyone drank\n9:07 - St4g: no, just think its pretty funny how you keep desperatly defending it each time we talk\n9:07 - Lysander Valerius: Hardly desprerate?\n9:08 - Lysander Valerius: *shrug*\n9:08 - Lysander Valerius: Me grandmum owns a weed farm legally in washington lmao. I'm okay with that\n9:08 - Lysander Valerius: And some friends in a native shamanic tribe do a buncha acids they make.\n9:09 - St4g: understandable, my friend is hitler's grandson and my other friend owns a million dollar fidget spinner\n9:09 - Lysander Valerius: Fine with all that, but just the damnage I've seen done by alcoholics around here has been unparralled.\n9:09 - Lysander Valerius: No literally last year a drunk husband threw his wife out the window of the apartment building ajacent to mine across the sidewalk\n9:10 - Lysander Valerius: I watched that lmao. They where kicked out of course after that, didnt renew their lease.\n9:12 - Lysander Valerius: If you find those little minute details unbelieveable then I just can't help yah lad. I mean honestly those where lame claims to fame relying on just others I know. If I where to talk about myself.......Yeah no way you'd even believe a second of it lmao so why bother talking about myself\n9:13 - St4g: ok so lets make a deal, i will believe all the bs u just said if you say u believe that im terry crews' child\n9:14 - Lysander Valerius: You're quite the oddity.\n9:14 - Lysander Valerius: Although I'm really fucking tired of people these days.\n9:15 - St4g: before you make up any stories about how youre tired of people, would you believe im terry crews' kid?\n9:17 - Lysander Valerius: I know his kid (not personally just from terry crews himself talking about him) and call it a educated guess but going to assume your not him expecially if your in belgium.\n9:18 - St4g: welp sorry u dont believe my story then, thats your problem c:\n9:20 - Lysander Valerius: Lmao, those where hardly stories, I mean honestly those where some weak shits of stories. My religion is shamanism animism so you would assume I wouldnt know a shaman? Thats like saying a christian doesnt know any priests.\n9:21 - St4g: cool cool i main teemo\n9:24 - Lysander Valerius: Thing is I can always back my claims with photo's or bringing others into some conversations. Or even give you a leak of plenty of goverment programs on the down low right now because connections from my stepfather lmao. But even if i sent you said things , gave you the names of all the orginizations I'm working with and let you contact them I'd still feel like you'd be like \"Nah not wasteing the time\" or \"Nah I dont believe you mister illuminati\" you see, I kid you not the last four people who added me who wanted to know about me had similar reactions thats why I said I'm getting tired of people lmao. Going to stick with only friends of friends now I guess, people that know I can get shit done.\n9:25 - St4g: whats that kiddo? you wanna test me? i gruaduated in the top special forces hackermans unit. i can hack the matrix with my eyes closed. expect 500 hitman at your door before noon boyo\n9:27 - St4g: my stephfather is gabe newell, say goodbye to your mario64 saves\n9:27 - Lysander Valerius: K mister memester, I just wonder what it would take to give some people a reality check. I mean imagine from my perspective having to try and tell someone who you are simply and innocently and they go off and act like that lmao.\n9:28 - St4g: \"reality check\" coming from you? really?\n9:29 - Lysander Valerius: I offer hard evidence and proof, and your like 2:27 AM - St4g: my stephfather is gabe newell, say goodbye to your mario64 saves\nso yeah, reality check my man.\n9:29 - St4g: im just trying to joke\n9:29 - St4g: thought u were joking too\n9:30 - St4g: coz you seem edgy as heck\n9:30 - Lysander Valerius: No when I meet people I like to share stories and get to know eachother lmao. What they're all about.\n9:32 - Lysander Valerius: K? I work in alot of fields, labor wise in two years I'll be a licensed medical specialist, physiotherapy, helping people y'know recover from longterm injuries not being on their feet and the such.'n massages. Charity wise I love working with reprieve human rights, the Sculpt Of the Future foundation, and partake in alot of other activities like voting in the tulip human rights award.\n9:33 - St4g: u ever just pick up a pencil and go \"Expecto Autismo\" \n9:33 - St4g: i do that daily\n9:33 - St4g: gives me superpowers\n9:33 - Lysander Valerius: I can only imagine.\n9:34 - St4g: what u dont believe me?\n9:34 - Lysander Valerius: Do you believe yourself?\n9:34 - St4g: do you? \n9:35 - Lysander Valerius: I'm a Physiotherapist not a Cognitive Behavioural Therapist\n9:36 - St4g: think u mean \"im a special boy\"\n9:36 - Lysander Valerius: Yeah maybe one too many drinks today.\n9:37 - St4g: mhmm youve been talking nonsense this whole time. think you need to sleep it off :o\n9:37 - Lysander Valerius: Please you can enlighten me about whats nonesense lmao\n9:38 - St4g: every u made up over the last hour\n\n>> Part that gets actually sad <<\n\n9:39 - Lysander Valerius: I suggest seeing a CBT.\n9:39 - Lysander Valerius: And that is a legitimate suggestion\n9:41 - Lysander Valerius: you actually are worrysome I really do suggest seeking CBT.\n9:41 - St4g: dunno what that is but if its coming from you then it might not even be an actual thing\n9:43 - Lysander Valerius: Google my friend... Cognitive behavioral therapy.\n9:43 - St4g: got any doc u can reccomend? like the one youre visiting or something\n9:44 - Lysander Valerius: Not my department anyway, since I said I'm on the physical therapy side. And even if I was giving you an actual diagnosis over the internet could get me charged with malpractice.\n9:44 - St4g: idk dude u sound pretty autistic\n9:45 - Lysander Valerius: I do hear it is bad to call someone out for their problems too, I once told someone they had bi-polar disorder and they didnt take a word of it they just wanted an apology and I refused to give him one just telling him he needed to seek help. Didn't work\n9:46 - Lysander Valerius: So yeah I suppose I'm not that good at forceing people to get help.\n9:46 - Lysander Valerius: I'm not austistic however I am dysbraxic if you really would like to know.\n9:46 - St4g: stop being so triggered, was joking\n9:47 - Lysander Valerius: More or less, worried, but you call it triggered, a normal mental deflection.\n9:48 - Lysander Valerius: You also prove the point of mine, that it is a failure of mine. I do simply not understand how to explain to someone I think they may need aid.\n9:48 - St4g: it was funny at first seeing you try so hard now i kinda feel sad\n9:48 - St4g: u need to calm down\n9:49 - Lysander Valerius: You're clearly using meme's to deflect everything, jokes. Saying I need to chill. that I'm trying hard, that I'm triggered. These are very odd reactions to me just being uhm normal and expressing worries?\n9:49 - Lysander Valerius: But I have experienced them many times\n9:49 - Lysander Valerius: Infact i have saved longs of other interactions of these types\n9:49 - Lysander Valerius: logs*\n9:50 - Lysander Valerius: Good, I do honestly hope you save the entire conversation. And share it with other medical proffesionals\n9:50 - Lysander Valerius: It would actually be of use for them\n9:51 - St4g: so is your fursona a psychiatrist or\n9:52 - St4g: or does he just wear a nurse costume?\n9:52 - Lysander Valerius: It really is hopeless haha. Can't take a serious conversation?\n9:53 - St4g: if you give me all that bs first and then try to say IM the one having the problems that makes you very delusional. so no i cant take you seriously\n9:53 - Lysander Valerius: You see there are no words I could give you to express real worry, you understand?\n9:54 - Lysander Valerius: I was trying to share some basic backround information, and random comparisons. Things that I could offer to back with action. But that is clearly of no interest to you.\n9:55 - Lysander Valerius: I mean if I wanted I could go real real low, in arguements, but that would be honestly terrible of me , expecially when I am trying to express a bit of concern\n9:57 - Lysander Valerius: And you see, your reactions where not \"Oh really? I cant believe that story can you back this with proof so I know you are not attempting to bait me\" but your reactions are simply, well, look at them. Beyond petty. And show several mental issues. Or lack of critical thinking. Sooo I'm at a loss for how I can assist you as with many others with this cognitive dissonance. So, I mean. Take care?\n9:58 - St4g: mhmm im the one with the mental problems. ok, sure\n9:58 - Lysander Valerius: So honestly no hard feelings, but honestly. Best of luck my man.\n9:59 - Lysander Valerius: I do ask that at a later date you do look back at this after saving the logs and attempt at reflecting. That's all I can ask.\n10:06 - Lysander Valerius: Yes now it is so I'm going to head to bed, wish there was some great word of help I could give you, although I do understand one thing about your cognative state. No single word right now can help. You've placed yourself at a mental immunity. Seeing that this conversation may not actually help you, I don't see a continued friendship lasting no hard feelings of course. And do wish you the best of luck but uh, yeah I could say anything and it wouldnt do anything to you in your cognative state, thats uh really bad. So wish I had some great words to make everything better but that just wont happen. After this conversation I am now concidering speaking to some psychotherapists just to help myself stay sane. Always feel a little drained after this stuff.\n10:07 - St4g: wow, wheres my goodnight kiss?\n10:08 - Lysander Valerius: Yeah, alrighty I'll head to bed. I'll have to do some more reflection of my own behavior after this as well though of course.\n10:09 - St4g: maybe see a psychiatrist or something idk\n10:10 - Lysander Valerius: Yeah I should.\n10:11 - Lysander Valerius is now Offline.",
 "title": "http://steamcommunity.com/profiles/76561198069238706/"
}