{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_pl"
 ],
 "key": "iqXGisL9",
 "pasteDate": "Feb 17, 2018, 6:06:07 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "1. Stwrz nowy projekt o typie WPF Application  Visual C#.\n2. Przejrzyj pliki projektu z poziomu Visual Studio.\n* App.xaml i App.xaml.cs\n* MainPage.xaml i MainPage.xaml.cs\n\nOtwrz projekt w Eksplorerze plikw. Wejd do folderu Obj/Debug. Sprawd zawarto plikw App.g.i.cs i MainWindow.g.i.cs.\n\n3. Przejd do pliku MainPage.xaml w trybie Design. Otwrz okno Toolbox i przypnij je dzi do koca wicze na stae do VS (View->Toolbox lub Ctrl+Alt+X).\n\n4. Metod przecignij i upu umie `Button` na rodku okna MainPage.xaml. Przejd do zakadki XAML i sprawd jaki kod zosta wygenerowany automatycznie.\n5. Zmie waciwo `Content` na `\"Hello World\"`. Skompiluj i uruchom program.\n6. Za pomoc kursora myszy zmie pooenie elementu Button. Potem rcznie zmodyfikuje w kodzie XAML waciwo Margin. Co si stanie jak bd tylko dwa parametry? a co bdzie jeli tylko jeden?\n7. Nacinij `Button` prawym klawiszem myszy. Wybierz opcj Layout i Reset Margin. Gdzie przemieci si przycisk?\n8. Teraz zmodyfikuj waciwo Margin z okna Properties, Layout.\n9. Dla elementu Button zmodyfikuj powicz zmian parametru VerticalAlignment i HorizontalAlignment na 3 sposoby (Designer, kod XAML, okno Properties). Na koniec wyrodkuj Button i wyzeruj marginesy.\n10. Dla elementu Button w oknie Properties w polu Name wpisz Przycisk. Co si zmienio w kodzie?\n11. Na oknie Design kliknij dwa razy na Button. Powinna wygenerowa Ci si `metoda Przycisk_Click`. W jej wntrzu wpisz:\n`MessageBox.Show(\"Witaj wiecie\");` Potem skompiluj i uruchom program.\n12. Do aplikacji dodaj dwa elementy typu TextBox. Nazwij je Liczba1 i Liczba2. W waciwoci Text ustaw odpowiedniej `\"Podaj pierwsz liczb\"` i `\"Podaj drug liczb\"`.\n13. Zmie waciwo Content elementu Button na Dodaj.\n14. Zmodyfikuj wntrze `metody Przycisk_Click` nastpujco:\n```csharp\ndouble liczba1=Convert.ToDouble(Liczba1.Text); \ndouble liczba2 = Convert.ToDouble(Liczba2.Text);\ndouble wynik = liczba1 + liczba2;\nMessageBox.Show(wynik.ToString());\n```\nNastpnie skompiluj i uruchom program.\n\n15. Uzupenione elementy TextBox nie s dobrym rozwizaniem za kadym razem. Usu z nich waciwo Text.\n16. Z lewej strony TextBox umie odpowiednie dwa elementy Label. Content ustaw jako Pierwsza Liczba i Druga Liczba. Zadbaj o dobry wygld aplikacji po kompilacji.\n17. Cay czas MessageBox nie wyglda za fajnie. Pod elementem Button Dodaj umie Label. Usu w niej Content a nazw ustaw na Wynik.\n18. Zmodyfikuj wntrze `metody Przycisk_Click`. Usu linijk z MessageBoxem.\nZamiast tego wpisz:  `Wynik.Content = wynik.ToString();`\n\n19. Z Toolboxa upu nowy Button i nadaj mu nazw `PrzyciskCzas` oraz Content jako Czas. Zaznacz go jako aktywny myszk. W Oknie Properties kliknij na \"piorunik\" i wyszukaj pole MouseEnter - kliknij w nie dwa razy. We wntrzu wygenerowanej metody wrzu:\n```csharp\nPrzyciskCzas.Content = DateTime.Now.ToString(\"HH:mm:ss\");\n```\nNastpnie zrb podobnie z polem MouseLeave i tam we wntrzu wpisz:\n```csharp\nPrzyciskCzas.Content = \"Czas\";\n```\n\n20. Stwrz nowy projekt dla WPF.\n\n21. Za pomoc designera lub rcznie kodem usu grid w MainWindow. Przydatne okno Document Outline (Ctrl+Alt+T).\n22. Na window za pomoc designera upu StackPanel.\n23. Na StackPanel upu 5 przyciskw. led zmiany w kodzie. Jakie parametry moesz pozmienia w designer? jakie w Properties? a jakie rcznie w kodzie? czy moesz w dowolny sposb umieci buttony?\n24. Rcznie w kodzie zmie StackPanel na WrapPanel. Co si zmienio?\n25. Teraz WrapPanel zamie na DockPanel (naciskajc prawym klawisz myszy na WrapPanel, potem Change Layout Type). Sprawd zmiany.\n26. Zmie DockPanel na Grid.\n27. Za pomoc designera stwrz kilka rzdw i kolumn. Spjrz na kod.\n28. Za pomoc designera i bezporednio w kodzie zrb tak, aby kady wczeniej dodany button by w oddzielnym elemencie w siatce.\n\n29. Upewnij si e w kodzie do kadego button jest przypisany rzd i kolumna. Nastpnie za pomoc designera zmie szeroko niektrych rzdw i kolumn. \n\n30. Stwrz kalkulator w WPF.",
 "title": ""
}