{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_abuse",
  "kw_infect",
  "lg_en"
 ],
 "key": "j9kD4AWb",
 "pasteDate": "Feb 18, 2018, 2:42:50 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Dear Donald Trump,\nHI! It's, it's been a while hasn't it? \n\nAnd boy oh fucking boy, we now know the truth, it isn't a hoax, is it? Nope, not at all! in fact, the only thing that's actually a hoax is the fact that you thought you could get away with it, colluding with the Russians to win the White-house just because you thought you could, and then when it turned out that you were a raging, psuedo-pedophilia, incestuous, cheese burger fetish having, ego spanking son of a bitch with less remorse for whatever the fuck you had going on, they wanted nothing to do with you! It's kind of fun in a way! It really is! now i know you've been sitting in the corner, crying about the fake news, and the fake media being, ironically, REAL mean to you... But in this light, don't you think it's worth it? don't you think you deserve this kind of thing?\nNo likes you.\nNo one needs you.\nyou are an abomination unto yourself and the country that you abuse while in the highest office in the land.\nYou are not a king, you are not a lord, and most importantly of all, and I love this bit, I really do:\nyou are not irreplaceable!\nThere's a certain amount of satisfaction that comes with this knowledge,a certain kind of  therapeutic release of endorphins that just allows me to enjoy, very much on a rather large scale, your fat tumbling fall from grace, the hooker you're currently fisting, cheeseburger in hand, and always, always, always, before you stare at the fat sad sack in the mirror and wonder how all of this came to be.\nWell, your parents met for one.... Actually, yeah, let's blame your parents for meeting, if they hadn't, you wouldn't be around, and having never disgraced the face of the earth with whatever blood soaked hands you currently keep in your night stand to give yourself a necrophilia based hand job of the dead, we'd all be a lot happier. Like, truly, a lot happier.\nLet's get to the meat of the matter this time around, shall we? I've been away, too busy to turn a bloodshot eye towards whatever disaster you are currently embroiled in to really keep pace or be angry at you. Because last week, a bunch of teens died in yet another senseless act of gun violence, one perpetrated by one of YOUR supporters, Nickolas Cruz, and lets be honest here, this is where we begin to see the horrifying truth of your venom. This is where we begin to see what kind of influence you have over the youth that's never known a Donald trump free presidency, you infect people with your hate and bigotry, and it's only gotten more widespread, to the point where stupid fucking idiots are essentially plotting out details of mass shootings right before our very eyes, and teens are dying left and right because of it. It's only the first quarter of 2018, and already, there's been eight school shootings, eight, and what are you doing in the process? Absolutely fucking nothing.\n\nAnd while this might be a tree branch long fallen off of a theory, I secretly think that you, in one way or another, directly or indirectly, caused this to happen. By Wanting the public eye to be off the Russia Investigation, you influenced Nick to fuckign pull this off. I know that's not true, or it might be, who the fuck knows. But the proof is in the pudding and in the end, all you did, all any of you fucking idiots did was offer your thoughts and prayers. And you want to know how well that was received? Not very well by the looks of it. Nope.\nThose thoughts and prayers were violently returned to you as if they were racist, sexist, bigoted, and never wanted to begin with. And you know what? They're right! We don't want thoughts and prayers, we want stricter gun control laws, we want gun reform, we want to have a fucking year where we don't hear about how jimmy Fuckheadowitz loaded up on skittles and diet coke and wasted everyone within a ten mile radius with a mini nuke and several cap guns, because ISIS had a pokemon go boom promotion.... Nah, we don't need that at all. \n\nWhat we do need? \nNo more mass shootings. Ever.",
 "title": "@realDonaldTrump #you #are #kind #of #fucked #aren't #you ?"
}