{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "jFLsS1y5",
 "pasteDate": "Feb 17, 2018, 11:06:18 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "In game name ~ PhiloGamingg - Gonna change to ModsOG soon\nDiscord ~ ModsOG#6223\nTimezone ~ EST\nAge ~13 // 14 in May\nWhy do you want to be staff? ~ I wanna be staff on this server because i know it will be a great server because Reece is working on it, And I know Reece was a good Head-Mod on pvpwars and I think he will do a fantastic job on this server, so i would like to be apart of this soon to be community.\n\n\nWhat keeps you motivated? ~ The thing that keeps me motivated is staying within the staff team, having fun and stuff like that.\n\n\nWhats the one thing that annoys you the most? ~ One thing that annoys me the most is when people don't do there job, like i see helpers on pvpwars or even higher staff members just laying back letting everyone curse and boss them around in chat.\n\n\nHow active can you be weekly [include times please] ~ I can be on atleast 5-6 hours a day. around 3pm to 9pm est.\n\n\nWhy are YOU the best person for this position? ~ I think I am better than other candidates I'm ready to take on any task or problem, in a formal manner (if needed) and efficiently. I will work to my fullest to ensure that the players are having a nice experience. I love helping players in any way I can, and knowing that the players are enjoying the server and that I have helped them. I know one of the hardest things about being a staff is having the patience to help everyone in need. \n\n\nAnything else? ~ I can be quite mature and immature at times, but I know when to control myself and when it is an appropriate time but I still like to have fun. I also consider myself as a laid-back type of guy and unbiased. I tend to play quite a bit of steam games with my friends aside from Minecraft, as I enjoy having fun with my friends outside the Minecraft community and it's also fun to meet the new people within the games and learn more game sense asides Minecraft.",
 "title": ""
}