{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_de"
 ],
 "key": "jhF97Bdd",
 "pasteDate": "Feb 20, 2018, 3:50:38 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "3. Grnde fr den Kriegseintritt der USA\nDer Ost-West-Konflikt\nZum einen liegen die Grnde fr Amerikas Engagement in Vietnam in derzeit stattgefundenen  Ereignissen, zum anderen aber auch in der Geschichte des Kalten Krieges, weswegen sie auch sehr eng mit dem Vietnamkrieg verbunden ist. Sie gilt im Zusammenhang als Grundlage vieler Erklrungen.\nIn der Nachkriegszeit, um 1946/47, herrschten Spannungen zwischen den Siegermchten aufgrund von verschiedener Weltansichten bezglich des Menschenbildes, des Demokratieverstndnisses, des politischen Systems, der Gesellschaftsstruktur, der Wirtschaftsordnung und des kulturellen Lebens. 1 Auf der einen Seite bernahmen die USA, welche als West-Block den Kapitalismus bzw. die liberale Demokratie vertraten und auf der anderen, die Sowjetunion, die als Ost-Block sich dem Kommunismus zuwandten.\nSeit dem Kriegseintritt, whrend des zweiten Weltkrieges, im Dezember 1941 mussten die Vereinigten Staaten viele Verluste hinnehmen, jedoch ging es ihnen seither wirtschaftlich ziemlich gut. Was die Volkswirtschaft oder die Machtposition anging, standen die Vereinigten Staaten weltweit an der Spitze. Anders sah es jedoch bei ihren Verbndeten, der Sowjetunion aus. Im Gegensatz zu der USA, waren ihre Gebiete von den dauerhaften militrischen Auseinandersetzungen grtenteils zerstrt und auch die Zahlen der Kriegsopfer waren enorm. \n1945 kam es dann zur Niederlage der Deutschen und der Japaner durch die Sowjetunion, die Vereinigten Staaten und Grobritannien.\nIn solch einer Situation waren sie nicht mehr bereit, sich den Interessen der Westmchten anzupassen, zumal sie sich, als einer der siegreichen Gromchten, sich das Recht zusprachen, in der Weltpolitik stark mitwirken zu drfen.\nMit der Grndung der UN ( Vereinten Nationen) oder heute besser bekannt als UNO, am 24. Oktober 1945, welches die 'vier Freiheiten' (Selbstbestimmungsrecht der Vlker, Garantie der Unabhngigkeit der Staaten, wirtschaftliche Gleichberechtigung und Verzicht auf territoriale Expansion)2 beinhaltet, war nun das Konzept der Nachkriegspolitik geschaffen. Diese fand der Diktator der Sowjetunion Stalin fr gleichermaen realistisch, jedoch strebte er trotz dessen eine Machtexpansion der Sowjetunion in Europa an.3",
 "title": "Facharbeit"
}