{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "K1Auyjmb",
 "pasteDate": "Feb 28, 2018, 4:49:43 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "[05:42:08] The drakanite went back to kneeling in the cell to attempt his meditation, last time it had been interrupted quite quickly... so hopefully things will go a bit better this time.\n(Cershera)\n--------------------------------------------------------------------------------\n\n[07:21:07] The drakanite stayed his focus as his knees were pressed against the cold hard prison floor, his mind had gotten far calmer since he had begun.\n(Cershera)\n--------------------------------------------------------------------------------\n\n[07:31:21] The drakanites mind would occasionally wander in his attempts of meditation, being in the cell reminded him of his first time here, the raid, the exiling, trip...\n\nHis mind began to wonder of the possibilities of ever being able to properly respect his old friend after his death. After around ten minutes of self doubt he went back to trying to focus his mind.\n(Cershera)\n--------------------------------------------------------------------------------\n\n[07:43:18] Cershera had managed to be able to reach a state of calmness in his mind. The prior thoughts of anguish and guilt had left him, the fear of the prison had abandoned him in his days of meditation.\n(Cershera)\n\n\n\nThe drakanite had decided that the best use of his time at this point would be to return back to meditation in hopes of passing the time faster.\n(Cershera)\n\nCersheras mind tended to focus on one thing whenever it wasn't void in his meditation, Trip. The faint possibility of being able to see him again in some day in another realm was something that lingered in the back of his mind... whether that was the real reason he wished to enter the spirit realm instead of helping out his cell brother zaur was something he just couldn't know.\n\nThe thought of being able to lay the blade that he had forged to rest in the spirit realm was something he wished to be able to research soon.\n(Cershera)\n\n[04:30:01] The drakanite returned to his meditation feeling far more safe doing it now than he did earlier.\n(Cershera)\n\n[05:18:40] Cersheras thoughts begin to twist around in his state of meditation, he began to see things a bit more than he did before. In his mind he began to see a bizarre ore that he had yet ever mined let alone seen, as his mind began to focus on it the mineral appeared to shift on its own with an odd yellowish aura around it. \n\nThe drakanite would open his eyes with a tight feeling in his chest, could what he had just seen been a vision of sorts or his imagination playing games with him?\n(Cershera)\n\n[07:13:52] The drakanite let out a defeated little sigh, his mind was still fixated on just what it was that he saw earlier in his mind. As enlightening as it was to be able to spend so much time with his mind, his desires to be able to return to his friends and loved ones continued to grow stronger and stronger each day.\n\n\"I'm sure it won't be much longer...\"\n(Cershera)\n\n\n\n\n\n\n\nCershera had finished climbing the cold Cliffside, feeling the cold gusts of wind almost ripping at his very skin.. For most it would tear apart their will to go through such an arduous task, however for him it was a just a reminder of how powerful the winds were, how powerful his people were, how powerful his god was.\n\nHe sat firmly on the cold pavement, being at the highest point of agartha had allowed him to be closer to Quetzacotl and the skies he reigned over. He closed his eyes, ignoring the conditions. All that his mind was being at peace and his god.\n\n[01:14:36] Lang kneels down upon the snow, murmuring minor incantations under her breath with her eyes closed. After a few moments, a runic circle appears upon the ground, emitting a dim blue light.\n\nLang then looks up to Cershera, gesturing to the circle.\n\n\"Go ahead and seat yourself in the center, and I'll channel my mana into it for as long as I can.\"\n(Lang Xiulan)\n--------------------------------------------------------------------------------\n\n[01:20:35] The drakanite cenetered himself in the middle of the rune that his friend had created for the ritual, he closed his eyes and listened to the sounds of the mountain around him, taking in the sounds of the howling winds as his the gusts pushed at his wings.\n\nThe sounds of the winds had become a key to his meditations, what truly put him at peace and allowed him to silence all of the other noises in his mind, his fear, his doubts, his pride. ALl were absent when he could hear the winds.\n\nHe continued to calm himself as Langs mana flowed into him, the girls rune would hopefully be the conduit for him being able to see into the spirit realm for the first time. \n\nAfter 5 minutes or so of the girl channeling her mana into him, their were... different noises that he could hear, it sounded nothing like that of the mountaintop. He would open his eyes to not see the lookout of the mountain, but the warped land of the spirit world. \n\n\"It... really worked.\"\n(Cershera)\n--------------------------------------------------------------------------------\n[01:24:51] Lang kept up the constant stream of mana, a slight strain showing on her face. Upon hearing Cershera's words, she felt the urge to look up, perhaps for the change that she too might see something. \n\nShe did not open her eyes, however, as she had to focus on channeling her mana into the circle and into Cershera. She was able to still speak, though, and she did so with a strained voice.\n\n\"R-Really..? What's it.. like..\"\n(Lang Xiulan)\n--------------------------------------------------------------------------------\n\n[01:32:32] The drakanites ears twitched for a second, he was in shock that he was still able to hear the girl in the realm he was in. Howevever, he couldn't not find the ability to respond to her right away, being too taken back by his surroundings. \n\nHe could see a large forested area off in the distance... In the centre of it was the largest tree he had ever seen, he believed that he had heard stories of it before. \"I.. It's beautiful.\" Cershera then noticed a river nearby him with an ominous light coming from it, calling to him. \n\nAs he approached it he would notice that the water was pure white, this... wasn't water. \"I.. found a lake of lifestream.. I almost want to touch it.\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[01:34:14] Lang Xiulan says, \"I-I'm not sure what you need to do while you're in there, but if you have to touch that lake thing then go ahead..\"\n[01:35:05] Lang Xiulan says, \"Otherwise, it should be left alone.\"\n[01:41:55] The drakanite gazed upon the lifesteam for quite some time, questioning himself on whether dipping his hand into it would be a terrible idea or not. \"Ya know... I think touching it may be a bad idea..\" He slowly walked away from the stream, focusing on the other surroundings of the realm.\n\nHis gaze became affixed to the gargantuan tree off in the distance, its leaves shimmered in a way that made it look truly more magical than anything he had seen before... It was like one of the fae's trees except larger and even more majestic. \n\n\"I... believe I have heard of what I am looking at before lang. I.. think I am gazing upon Yggdrasil.\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[01:43:37] Lang Xiulan asks, \"Yggdrasil? I've heard stories but.. this is something else. Is that where you need to go..?\"\n[01:48:44] The drkanite paused for a moment... he began to wonder just where the true place he needed to be in the spirit realm was, he kept his gaze upon the tree while questioning it. There were... odd lights flickering around the tree, it made it look quite sparkly, however something didn't sit right with him.\n\n\"I'm... not too sure if this is the right place to be honest. I expected things to feel different upon entering the realm.. Perhaps this is not the right place.\" While there was an odd feeling growing inside of him, this land did not feel right to him. \n\n\"Perhaps, I should come back and try this again at another time.. this must be quite tiring for you\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[01:50:27] Lang's voice sounds more strained than before, despite her efforts to hide it.\n\n\"I-It should be fine, but if you really want to return I won't stop you..\"\n(Lang Xiulan)\n--------------------------------------------------------------------------------\n\n[01:56:25] The drakanite heard the way that the girls voice had changed, he began to get a bit worried of her assisting him. \"It's fine.. We can try again at another time.\" He looked around at the realm around him, drawing it all into him to remember. \n\n\n(Cershera)\n--------------------------------------------------------------------------------\n\n[01:57:16] Lang Xiulan asks, \"O-Okay.. Is there some place that you can leave through, or is it just safe for me to release the spell?\"\n[01:58:08] Cershera says, \"I... think that releasing it should work\"\n[02:00:41] \"Alright, hang on for a moment..\"\n\nThe circle slowly began to fade, drawing Cershera out of the spirit realm as it did. Once the circle had faded completely Lang would sit back, her labored breaths forming a mist in front of her face each time she exhaled.\n(Lang Xiulan)\n--------------------------------------------------------------------------------\n\n[02:02:24] The drakanite was pulled back to reality in a moment from the ritual being finished, it felt as if he was falling off of a cliff as he returned to his body. He blinked a few time and breathed labouredly as he put his hands on himself to reassure himself he were safe, before turning around and holding the exhausted Lang.\n\n\"You... we.. really did it\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[02:03:15] Lang Xiulan asks, \"Y-Yeah.. I'm surprised that it actually worked, what was it like?\"\n[02:04:06] Cershera says, \"It was... amazing.. But, something about it didn't feel right. It wasn't how I expected it to feel\"\n\n[04:45:23] Lynette walks around Cershera. Bending down, she draws out a runic circle in the snow. She goes around once to draw the basic outline, and around a second time to add the final details to the rune, until finally she had made the finished product. A mana transfer rune. \n\nShe took a seat at the edge of the rune and placed her hands on the edges. Mana began to flow from her body, down her arms, into the rune, and therefore into the drakanite before here.\n\nHer eyes close as she concentrates flowing her mana into him through the rune. Her face has a peaceful, yet focused expression as she sits there, almost in a meditative like trance.\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[04:52:12] Cershera closed his eyes as he sat upon the centre of the runic circle that his friend had drawn for him. HE allowed the calming sound of the howling winds of the top of the mountain to void the thoughts in his mind, allowing him to better concentrate on projecting himself to the spirit world as he did earlier.\n\nThis time, the sounds of nature did not interrupt him from his meditation and entrance into the world of the spirits... Instead it was a much more subtle change, the howling of the winds had become different.\n\nThe drakanite opened his eyes to see an area of nothing but mountains before him, however they were not normal... Their shapes were foreign to that of what he was used to from his world, giving the winds their odd howling here.\n\n\"Lynette... this isn't where I went to before.\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[04:56:28] Lynette kept her hands on the edge of the rune. She kept a steady flow of mana flowing through it and into the drakanite, so as to not overload his mana circuits, or exert her entire mana supply at once.\n\n\"Hmm? Where are you now?\" She would ask, a calm and serene tone to her voice. \n\nShe would then hum softly, a little tune or melody, like that a bird would sing in the morning. Her eyes stayed closed and her mana kept flowing.\n\n\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[05:00:44] The drakanite looked over the edge of the mountain that he had projected onto, he was so high up that he could see the clouds below him. There were a near countless amount of mountains near him all of them having their own unique shape. He decided to close his eyes again and take in the sounds of each mountain, hearing their own unique howl from the winds that swept past them. It was more thrilling than finding 100 chunks of nyeshk at once.\n\n\"It's... mountains as far as the eye can see. It's so beautiful Lynette, I can hear the cries of each one as the winds come past.\" The drakanite eagerly opened his eyes and looked at his body in the spirit realm. Wings, check. \n\n\"Okay Lynette.. I'm about to try something, if I start screaming stop the ritual immediately.\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[05:06:43] Lynette nodded, though it wasn't like Cershera could see it. While his body was right in front of her, his soul was someone else. She took a deep breath and responded \"Don't worry.. I will stop it if I sense something wrong.. or off\" She said, reassuringly. \"I wouldn't let anything bad happen to you.\"\n\n\"It does sound like a wonderful place your spirit has found, I wish I could see it.\"\n\nShe regained her focus once more and began to hum again, the rune started to glow even more brightly now. She poured even more mana into the transfer rune. If Cershera was trying something different, he might need a boost in mana after all.\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[05:11:50] Cershera jumped off the mountain in the spirit realm, he opened his wings out letting the heavy winds in the mountainous areas carry him.. normally gliding was quite a difficult thing in the real world even for the drakanite, however the winds carried him with ease.\n\n\"Lynette! I'm flying! The winds of the spirit realm are so powerful yet, they have this weird feeling to them.. I feel at peace here, this must be how Quetzalcoatl feels.\" The drakanite continued to soar, he was unable to ascend in the skies at all yet, this was enough for him.\n\nAfter gliding through the skies for a solid 10 minutes he landed on another mountain, there were no negative feelings in him at all after an experience like that.\n(Cershera)\n--------------------------------------------------------------------------------\n\n[05:16:06] Even though Lynette's soul and mind were still right here in Agartha, she could sense the pure joy and euphoria coming from the drakanite. He was souring through the skies as his god once did, flying freely and without a care, and she could sense the positive emotions buzzing from him. \n\n\"Flying? Wow.. want me to keep giving you mana then?\" She would ask, though she knew the answer. She chuckled a little, almost breaking concentration, but she managed to hold it for longer.\n\n\"Mhmm.. tell me more about how it feels Cershera, if it doesn't break your concentration that is.\"\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[05:24:38] The drakanite looked over at all of the mountains surrounding him, a part of him was curious at just what it was like at the bases of the mountains.. or just what kind of precious ores were in them. But, for once in his life ore didn't entice him as much. He felt like a true drakanite of the wind in the spirit realm.\n\n\"It's.. amazing, with every single turn or movement I can feel the wind that's blowing me around. A part of me doesn't want to leave from here to be honest..\" The drakanite let out a little sigh as he realized he would soon have to leave from this part of the spirit realm. \n\n\"Try and remember everything you did for this one lynette... I really want to return here again some day.\" He got back up and let out a heavy exhale as he stood over the mountain top. \"When I come back... I want the last thing I feel to be the winds of the spirit realm.\" He leapt off again, beginning to worry of lynettes fatigue of doing this, he couldn't be selfish of such a wonderful place.\n(Cershera)\n--------------------------------------------------------------------------------\n\n[05:28:54] \"Wow, it sounds wonderful. it really does.\" She said, her voice sounding comforting and serene. She held in there, pouring mana into the rune. \"Just tell me when you have had enough, I can stop this rune when you ask.\" She would say \"I can keep this up for a lot longer.\" \n\nShe shuffled a little in the snow once more, holding her arms back out to the runic circle, she kept the mana flow going. Steady and calmly.\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[05:37:26] \"Thank you lynette... Everything here feels so right. I really wish that you could feel what I'm feeling right now.\" The drakanite closed his eyes as be continued his soaring through the mountainous skies, putting his faith in the winds of the spirit realm to guide him. \n\n\"It feels as if i'm riding the winds themselves Lynette, these ones feel so different.. They feel like an extension of me.\" HIs flight continued for a few more minutes, he had yet to crash into any of the mountains in his blind flight mode.\n\n\"I.. think I'm ready to leave this place Lynette.\"\n(Cershera)\n--------------------------------------------------------------------------------\n\n[05:40:00] Lynette let out a sigh. Slowly the rune began to fade away into nothingness, the flow off mana decreasing along with it. She would shuffle along the snow and grab both of his shoulders, steadying him there incase the sock of returning to the physical world caused him to fall.\n(Lynette Tensei)\n--------------------------------------------------------------------------------\n\n[05:41:42] The return to the physical world was a lot like it was last time.. It felt as if he was falling, he kept his eyes closed and held onto the feeling of how the winds felt in the spirit realm. \n\nHe would open his eyes in the real world and just look up at his friend after it had finished. \"That... thank you lynette.\"",
 "title": ""
}