{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "KDffrnHA",
 "pasteDate": "Feb 12, 2018, 4:57:59 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "- Tym is upset and dissapointed at me and all civilians. He says the roleplay in the past few days has been terrible, that it's been the same thing over and over, and that it is URGENT that this changes.\n- Me and Romeo have been working on a rule handbook for all departments. This handbook has a section dedicated to civilians. It contains lots of rules and basic civilian conduct that MUST be followed. There is also other sections that are REQUIRED to be read through because they contian information EVERYONE needs to know.\n- The whole point of the ranking system is to give people who are better at roleplay more possible scenarios, and expand the roleplay.\n- You guys are taking it the wrong way. just because you are allowed to use guns and rob banks, etc, doesnt mean you HAVE TO DO IT ALL THE TIME. \n- For example, my well known character Mister Chen has been on the server for weeks upon weeks now, and he's never shot a gun. He's a well known character throughout all the server, and anyone that pulls him over or talks to him knows him. They know his persona, they know his background.\n- And that's what I want you guys to do. I want you guys to build characters that have their story spread around the server, characters that make sense, that have a background to them. I want characters that when they die, the server misses them. I want people to be able to justify their actions. If you are going to kill a person, make sure they know who you are, why you're doing it, and not just drive by and kill them for no reason. You character's actions have to be understandable, if your character has no background, they are NOT JUSTIFIED. You can't start a new character on the server and in 30 minutes start killing people with it. You need to spend a day, as a minimum, preparing your character for a big situation like a bank robbery. Throughout the day you must make actions that show that you are planning for it, foreshadow the future, spread your story around.\n- Just to touch on the topic, make sure you're not using any speed boost and god mode, etc.\n- Make sure you have openinteriors installed.\n- Make sure to get the 7 hour weekly minimum.",
 "title": ""
}