{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_stole",
  "lg_en",
  "kw_targets",
  "kw_down",
  "kw_evil",
  "kw_shut",
  "kw_cracked"
 ],
 "key": "kECqkw55",
 "pasteDate": "Feb 28, 2018, 1:47:49 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "England, A.D 1377 plot, conflict \n\n Tears plunged from my eyes, the atmosphere became dark and gloomy. Many people watched from afar as Pony boy, my brother, the priest, as well as myself, wrapped the frail maiden corpse in a dull grey shroud. Ponyboy was not my actual brother but gave off the same familiar warmth especially after my mother's passing. He has shiny light-brownish red hair matched with beautiful green eyes. Our age gap was only one year and I was born an only child so I was very grateful to meet him. Not to mention Ponyboy was also an orphan since his parents perished in an auto wreck. No one really knelt or showed any respect to my mum, they just stared. Even before her death, everyone just avoided her, thus she had no friends to care for her when she was in her inmate state. Ponyboy's brothers were the only people there to pity my family, or at least what remained of it. I quite fancied them. Aside from Ponyboy, they were also like my dear brothers. Every one of them had very slick, longer-than average hair. The scariest out of them I'd say would be Darrison but we all know he has a good inside to him. Watching the memorial from afar, John aycliffe, the despicable Stewart, commanded me to come close. With a loud and up roaring voice, he spoke \"Look at me\"! I couldn't look at John aycliffe's  nasty sharp eyes. Just from one glance, I could feel the repelling gaze of scorn. After the deep silence, He ordered me to complete my death tax which was delivering my one ox to the manor. I tried to justify myself but it resulted in ignorance. Feeling pretty bad, I decided to go to Father Quinels church to pray. Accompanied by Ponyboy we slowing walked over, still living in the horrible mood we were left with at the funeral. Suddenly, we got approached by one of the rich merchants' sons. \"Hey there buddy\" he spoke in a smug accent. Behind them a gang of people flooded in, a total of six, nicely dressed men. As they were beginning to pound us into bits of grounded meat, a slightly chubby man appeared, with a big red beard and holding a sac full of goods, he came and commanded all the snobs to leave. As Ponyboy and I came to approach him as a token of thanks, he gave us a couple cigars. Ponyboy loved it, but for me, I couldn't stand the foul taste of tobacco. As I was still processing the taste, the man suddenly gripped onto us yelling in an insane manor. Seconds later, we collapsed onto the cold rubble floor. It was poison, my mind concluded. That Fatso had deceived us with poison-filled cigars. Could he be one of Aycliffe's foul men? As my brain shut off, I fell into a deep slumber only to be waken up by the flick of a whip. Pony Boy suddenly fell into reality, he pranced onto me and tried untying the ropes. Since he, for whatever reason wasn't tied. The fat man kept whipping me until my clothes became torn and some blood protruded out. Ponyboy, who couldn't stand the scene, pranced onto the man's arm, biting with all his might. He then collapsed. Ponyboy then took out his cigar, lit it with fire and burned down the iron bars. As we ran out of the dungeon, Ponyboy looked back to check if he was still chasing us, the coast was clear. Eventually we found that we were in the social's castle, a place full of high-standing men and women. If we were caught, we'd be easily sentenced to death. It seems that currently, we'd ran into the ball room, where a party was in play. Many kids played and couples swung to the happy and joyful music composing of recorders, flutes and melodic voices. Ponyboy and I snuck under the long table of food. We slowly crawled under the refectory table, covered by the cloth. \"Do you still have the cigar that the guy gave us? I used mine trying to break the iron bars at the cell\" Pony boy whispered. I replied \"of course\" and gave it to him. He then took out the poison and replaced it with some grass he collected from his clothes and started smoking it. \"Thanks buddy, I owe you.\" Ponyboy thanked me. I couldn't stand the pungent smell so I moved an inch away. Slowly, I started to dose off and fall asleep. \"WAKE UP CRISPIN! THE PALACE IS ON FIRE!\" Ponyboy shouted, bleeding my ears . My eyes blinked twice, then I started panicking. I ran out along with Ponyboy and out the quickly burning doors. Many of the kids ran in chaos as the infrastructure slowly collapsed. Watching as all the chaos before me occurred. The highness, Lord Johnny, who arrived on a carriage, went into burning palace to save the dangered people. He splashed himself with water and ran in, followed by his guards. One by one, many kids and women were safely placed across The building. But as the last one was being saved, a large chunk of flaming wood hit Lord Johnny in the back. He was then rushed to the emergency room as his guards followed after him. Truly a gentlemen, I thought and prayed to my cross that he would be okay. But something with Ponyboy wasn't right. He began to leave my side and rushed into the building. After a period later, I started to panick hoping I didn't lose my brother to the now about-to-fall crispy building. But in the darkness of the opening, my friend appeared carrying the betrayer in his arms, slowly walking over to me. \"What the hell\", I shouted at him,\"Why did you save such a disgrace\", I scolded. \n     \"I.. saw his eyes shine as we were running away, in an almost unforgiving way. I don't think he's evil and I believe in my instincts\" Ponyboy cried, gasping for air. \"Fine, but at least tie him up\", I responded, still wary of the man. Pony boy was covered in a lot of burns so I gave him my water dowsed handkerchief to moisten the wound. We stayed on the ground for a few minutes until Darrison and Sody, Ponyboy's brothers came rushing over. \"Ponyboy you okay?\", They said in unison.\nMy tough brother responded with \"yeah I'm as good as it gets\". But Darry didn't believe him when he saw the burn marks, he rushed over and slapped Ponyboy. Small Crystal tears were surrounding his eyes. He was really worried for Ponyboy but Ponyboy was as oblivious as ever. He screamed \"I hate you!\", and ran off north. \"Wait!\", I screamed, but he just ran. As I chased after him, I looked back and saw that Darrison was now bawling, Sody was comforting him but it was no use. As I finally caught up to him, I saw the man we saved sitting under a tree. Ponyboy approached him and asked \"You okay?\". He replied with silence then he spoke \"Why...why did you save me. After I was so terrible to you.\". I knew that Ponyboy's intentions were right, this man was certainly nice at heart. \"What's your name.\" I asked\n\"Orson, but people call me Bear.\", he replied\nPonyboy smiled an ecstatic laugh and spoke \"No problem! Welcome to the crew, Bear!\"\nMonths later, we spent many of the days perfecting how to play the recorder and how to sing as well as, how to dance. Ponyboy was naturally gifted at learning how to choreograph and was able to master it before I could even understand how to play 5 notes on the recorder. Of course Bear, was constantly screaming at me but eventually I got the hang of it. Despite all the random tantrums, I liked Bear. He always gave us the best food in the world and all the family attention we ever needed. Occasionally, we even went over to towns and sung, earning us tons of money and bread. But one day, one of the villagers were saying that the socials were suspecting two adolescents for lighting the place on fire as an act of arson. Trying not to hide the guilt we said \"Thanks for the information.\" and left the town. As we were following the path, I saw flyers that read, \"The new Society palace is rebuilt now to be covered with glistening marble! Unfortunately, after Lord Johnny's heroic act, he will soon submit to eternal rest  in two weeks at most\". May god have mercy on that poor soul. Al though he always over taxed peasants, his last act will be recorded in history forever. \n\nAs we reached the \"Croutsider's Inn\" we booked the finest hotel room for a total of 5 pounds. I shared a room with Bear and Ponyboy. After all the months of spending nights together I've become quite fine of him. He's shown nothing but respect and kindness to the likes of us. Bear gently whispered, \"Go to bed Crispin, tomorrow will be a new day and you need as much rest as you can get.\" The night darkened and the day ended.\n\nWe went shopping the next day since Bear went off to do some bargaining with the earnings we've collected. So Ponyboy and I used the money we've collected to splurge a bit. Ponyboy bought a fine, slab of white bread topped with dried raisins. I stole a chunk and it was very delicious! Then we went to the nearest church and prayed a bit. Shortly after, we went outside and danced the night away. Once it hit 10, we ran back to the inn. \"Ponyboy, Crispin. Bear got taken away. A group of nicely dressed men kidnapped him away\", she shouted, with a look of distress. I looked around, everything was a mess, the food was spilled and the tables were turned. I started to move my legs, ready to run but the Inn Owner dragged me by my collar. She spoke \"Not now, you must train. As you are now you won't even be able to walk a step without alerting all the knights in the building. We will go in two days. Hopefully by then they won't have already sent him to the guillotine. Go to bed for now and get ready for tomorrow's practice.\" Looking gloomy, I dragged my feet up the steps. Ponyboy tried to comfort me by saying \"It's okay, we will get him saved.\" But I knew the chances were slim to none. As I sat on my bed, I fell asleep, lost in thought. \n\n     The day started with the chirp of birds and the cock- a-doodle-do of roosters on the roof. The Inn owner, called madam Evergreen, knocked down our door and shouted \"Time for practice! Today we will be practicing how to walk as gently as a baby and become as stealthy as a ninja\".\nBeside me, Ponyboy started to wake up. \n    \"Evergreen, five more minutes please *yawn*.\", Ponyboy mumbled\n     \"Ponyboy if you want to be an excellent ninja you must wake up early and train until the clock ticks midnight!\". From that, Ponyboy woke up and left the room to fetch some water. I followed after him since I was feeling quite parched myself. \n\n\"Okay! First we will train your steps. Stand on the very tips of your feet and focus all your power into it. You should have enough power to control the sound of your foot. Not run back and forth to the farthest hill while only on the tips of your foot. Reach the hill and come back ten times, now go!\".\nIt felt weird at first, but I soon realized it was the same sensation as tip toeing to steal from my mom's secret food stash. Ponyboy on the other hand, clearly struggled to balance on his toes since he was much taller than I was. Through some teamwork and patience we finished the ten laps and took shade by a nearby tree. Evergreen also fetched us some water and we took a five minute break. Before long she spoke again, \n    \"Well done, now we need to train your stamina. Run around the town five times and meet back here. Make sure to keep down the sounds of your pants. For each loud breath I hear, the more laps you'll have to run.\"\nI was quite scared of this one. I hated running and especially five long laps around the never ending town. I took a deep breath and started jogging. Ponyboy was much faster than I was. He was amazingly exceptional at long distance running. But unfortunately for him, I couldn't go one full lap without stopping. Therefore I breathed a lot. Ponyboy eventually fell to exhaustion from all the extra laps we had to run. She gave so many extra laps that surprisingly soon enough, we were able to pace really well while limiting the heavy panting. Half way into the practice, Evergreen took out some small black pouches from her room. She handed each of us a different bag. Ponyboy opened his bag first then gestured I do so too. My face lifted with excitement. Two large black flash bombs were rested on the bottom. \n\"Use these during emergencies only. Like if you were on the run from Aycliffe's men. Don't overuse the smoke bombs since they can give you severe breathing problems for a week.\" Evergreen instructed \n   \"Awesome!\", Ponyboy replied\n   \"I can finally be a real life ninja!\", I added \n\"I love the enthusiasm! But get back to work! We don't have all day. I've already placed some softballs on the ground to your right. You'll them use to practice your aim. Throw them at the wooden targets. Until you hit a bullseye, no one is getting a good nights sleep.\" Evergreen threatened \"Very well! Challenge accepted\" Ponyboy replied\nHe flexed his puny muscles then took one of the balls. In a battle stance, he flung the ball with all his might, hoping for it to hit the middle center. Nope no luck. Now it was my turn, I picked up the ball and-woahhh it's much heavier than I anticipated. I gave a good swing and the ball managed to hit the edge of the frame. It's gonna take a while, I thought. One after another, we swung only to hit the same exact place. But I can tell that after a couple more throws that we were getting closer. I was just about to throw my tenth ball when Ponyboy bumped into me. My reflexes went mayhem and shot as hard as my arm could move. *Bam*, The ball pierced right through the center. \n\"Nice job Crispin! Ponyboy Curtis,  you have also exceeded my standards. You boys will be released into the real world at the rise dawn tomorrow. Finish with one more lap then go to bed.\" grinned Everygreen, who headed back into the inn.\nThe last lap felt like a breeze. With the final moonlight reflecting off of us, accompanied by the late night wind, I was able to reach the Inn before the clock hit 12:00 AM\nRight as we entered the chilly bedroom, Ponyboy collapsed on me and I fell to a soft slumber from listening to his gentle breathing sounds. \n\n  The morning started as I wore on some cloth to hide the bottom half of my face. Ponyboy chose the cloth mask since he loved those. Time to get on with the adventure I thought.\n\"All Hail the lords of England!\", Ponyboy commended.\nI chucked and together we followed the path and the paper posters to find where the new castle was located. \n\"South Earl Drive-123 8183 huh. I know where that is! Follow me bro!\"\nHe then ran off north into the distance.\n\nWe finally reached the luxurious, fully improved castle. Outside I can hear the loud thumps of protests coming from the inside. I slowly put my ear on the largely closed doors\n\"Let's demolish all the peasants. Their weak and frail bodies are no use to society!\"\n\"But that's just cruel. Lord Johnny wouldn't want this.\"\n \"They are just a waste of space and food!\"\n\"I guess you are right. It doesn't even matter what Johnny wants, he's as good as dead.\"\nSoon everyone screamed in unison;\n\"GET RID OF ALL THE USELESS, IRRITATING PEASANTS!!!\" \n\"Idiots.\", Ponyboy exclaimed\nMe and Ponyboy both came from pretty poor villages. Some random merchants on the path would even call us plebs. But everyone was oblivious to the fact that we were the foundations of this country!\nFrom all the hatred, we flung the metal door open.\n\nAll the socials looked at us. Suddenly I felt an ominous vibe tingly at the back of my spine.\n\"PEASANTS!\"\n\"GET THEM!\" \nA stampede of men and woman ran after us. Ponyboy looked at me and whispered \"Let's do this!\". Together we charged at all the soulless snobs. Ponyboy started running and led them in circles. His breath was so light I could barely hear it. I jumped in the air, grabbed the chair and flung it at them. *Bam*! Instantly 6 people were knocked down. Next, Ponyboy took off his belt and shouted,\n\"Next time, use your brains before you go bunching all of us together and BE THANKFUL!\" \nThen, he went and whipped another five until they all fell flat onto the carpet. \n\"Hey Ponyboy, Crispin!\"\nI looked back and realized Ponyboy's brothers were here.\n\"Darrison, Sody! So great to see you guys! Can you help me finish off these punks?\"\n\"Of course!\" Darrison shouted with glee.\nHe then cracked his knuckles and stretched a bit. \"\nAlright here I come!\"\nHe charged head-first into several socials, bending their limbs until they fell to a halt. Then alongside him, Sody grabbed the tablecloth and wrapped it around another three. Unfortunately in the process, he got hit by a pretty powerful swing. \n\"You okay?\" Ponyboy asked\n\"Don't worry about me.\" Sody reassured while finishing them with another swing. \nPonyboy then climbed on Darrison and kicked four guys while his brother ran at what felt like mach 10 speed. Soon after, I released a smoke bomb to finish off the remaining socials. From behind, I could hear the distant coughing as Ponyboy pulled me along away. I looked back to see if the brothers were okay. Darrison gave a thumbs up for approval and Sody smiled proud fully while sticking up a fist.\n\nEventually, we reached the dungeon where we spotted a clump of flesh on the rubble ground. I instantly ran over, \n\"Bear... You okay?\", I shook him gently.\nThere were no words. Next to me Ponyboy called again,\n\"Bear... Bear please speak to us.\"\nAgain, there were no words. Ponyboy shed a tear and spoke with a dry throat,\n\"Bear, you can't leave us like this. You promised that we'd learn about all the cool instruments and how to play them. You..you can't leave us!\" \nMore tears started falling from his eyes. I placed my arm around his head and comforted him while hiding in my own.\n\"Bear's in a better place now. Let's head back and go to the church.\" \nIt wasn't until long until we both bawled. Our best friend was lying in front of us, as still as a rock. But we didn't live in this sad moment for long. Ahead of us, Aycliffe walked in limping and half covered with fresh wounds. \n\"I've come to finish you guys off.\", he threatened. Prepared for combat Ponyboy and I got into a fighting stance. He came slowly and thrusted his fist. To my surprise he was weaker than a newborn baby. Taking this chance, Ponyboy went in and destroyed him to bits with one revengeful punch.\n\"Go to hell you scumbag!\", he shouted.\n Aycliffe soon lied there as still as Bear. I took out my lead cross and made the gesture over my heart. \n\"May God forgive our sins\", I spoke\nNext to me, Ponyboy was still living in a moment. \n\"Are you hurt?\"I asked\n\"I'm okay, let's leave now\" He suggested.\nTogether we left the premises and hit the road. \nPonyboy's Perspective \n\n10 years passed and I became an English teacher. One week had taken all three of them. Lord Johnny, John Aycliffe, and Bear. And I decided I could tell people this amazing and sentimental adventure beginning with all my diligent students. Crispin on the other hand, felt like a completely new person. He was more brave and expressed more emotion. My little bro set his heart on exploring every corner of this world, every type of music, every type of laughter and turned into the greatest showman. In the end, we were still peasants, but with all the new experiences engraved into our minds, we were able to spread positivity, knowledge and happiness. \n \nThe End!\n\nBy: Rebecca Bao",
 "title": ""
}