{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "KPej2rPg",
 "pasteDate": "Feb 20, 2018, 1:42:55 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "ZDARZYO CI SI KIEDY BY NA POCZCIE JEDEN Z DRUGIM? MI KURWA NIESTETY ZDARZA SI BYWA BARDZO CZSTO. \nSPIESZYSZ SIE? MASZ WOLNE P GODZINKI I MYLISZ E ZE ZDYSZ WYSA SZYBCIUTKO MALUTKI LICIK ALBO ODEBRA MALUTKA PACZUSZK? \nOT KURWA NIC BARDZIEJ MYLNEGO. STEREOTYPOWA POCZTA POSIADA KILKA STANOWISK DO OBSUGI PETENTW JEDNAK MAMY TUTAJ SYNDROM POPULARNEGO W POLSCE MARKETU O PORTUGALSKIM KONSORCJUM POSIADAJCEGO W SWOIM LOGOTYPIE CZERWONEGO OWADA Z RZDU CHRZSZCZY WIELOERNYCH KTREGO CECH CHARAKTERYSTYCZN JEST CZERWONY PANCERZYK CHITYNOWY I SIEDEM KROPECZEK. JEST KURWA OTWARTE JEDNO OKIENKO/KASA.\nJEDNO.\nNIE MNIEJ.\nNIE WICEJ.\nJEELI KTREGO RAZU WEJDZIESZ I BD 2 GRAYNY NA DWOCH OKIENKACH TO CZEKA CIE DELIKATNA NIESPODZIANKA W POSTACI \"MAM PRZERWE/PROSZ DO OKIENKA OBOK/PIJE KAWE/PALE/SRAM/PALE I SRAM/NAKURWIAM PIECZATKI/ROBI Z TWOICH LISTW POLECONYCH MODELE HINDENBURGA/SIEDZE NA PIZDZIE ZA PIENIADZE PODATNIKA XD\"\nZAPYTASZ JAK ZA PIENIADZE PODATNIKA? OTOZ KURWA BAJECZNIE PROSTO. POSADKA URZEDNIKA POCZTOWEGO JEST OPLACANA Z PODATKOW KTORE PLACISZ TY WIEC TAK JAKBY JESTES PANEM JEGO ZYCIA I SMIERCI. \nDOBRA DOBRA FINANSE NA BOK. PRZECHODZIMY DO MERITUM.\nWCHODZISZ NA POCZTE.\nZGODNIE Z PROSTYM SCHEMATEM OPISANYM POWYEJ OTWARTE JEST KURWA JEDNO OKIENKO.\nJEDNO.\nNIE MNIEJ.\nNIE WICEJ.\nUSTAWIASZ SIE W KOLEJCE DORWNUJCEJ TYM PO OCET ZA KOMUNY.\nPRZED TOB JEST TABUN PIERDOLONYCH MIERDZCYCH SAPICYCH UMIERAJCYCH STARYCH BAB JEBANYCH OPACAJCYCH KURWA RACHUNKI O 7 RANO W ROD ALBO WYSYAJCYCH KARTECZKI Z KAWUSI DO SSIADKI Z DRUGIEGO KOCA MIASTA. \nJA PIERDOLE TRZYMAJCIE I MNIE I SPJRZCIE NA KALENDARZ. CO TAM ZOBACZYCIE? 2018 ROK. XXI WIEK A LUDZIE KURWA ROBI OPATY NA POCZCIE ZA POMOC PAPIEROWYCH RACHUNKW. JAKBY POKAZA TAKIEJ STAREJ KURWIE BANKOWO INTERNETOW ALBO BANKOWE APLIKACJE NA TELEFON ZA POMOC KTRYCH MOESZ WYKONA W KILKA SEKUND I JESZCZE MNIEJ KLIKNI PRZELEW W DOWOLNE MIEJSCE NA WIECIE NA DOWOLN KWOT OGRANICZON TWOJ CHUJOW EMERYUTUR OTRZYMYWAN ZA ZAPIERDALANIE STU LAT PRZY AZBECIE TO TAKA STARA RURA JEDNA Z DRUG ZACZA BY SKAKA, DRZE MORD, LINI SI I NAPIERDALA BEM O PODOG JAK TE MAPY W ZOO. JEDYN STYCZNO Z TECHNOLOGI MAJ JAK KTRA Z NICH W KOCU LDUJE POD RESPIRATOREM. A JU KURWA TELEFONU Z DOTYKOWYM EKRANEM ANI INTERNETY NIE WIDZIAY NA OCZY JAKIE OCZY. POWIEDZIAEM NA OCZY? W YCIU CZEGO TAKIEGO NA CZUJKI SWOJE NIE WIDZIELI BO ONI MAJ CZUJKI TAKIE DY DY JAK MRWKI KURWA JAK KALARUCHY I INNE ROBACTWO. BIEDAKI KURWA. NIE DA SI POMIN FAKTU E TO JEST TAKIE ZACOFANIE I OCIAO UMYSOWA ZE CO TYDZIEN NA NATIONAL GEOGRAPHIC EMITOWANY JEST SPECJALNY PROGRAM POD TYTUEM PATOLOGIE SPOECZNE W KRAJACH TRZECIEGO WIATA.\nWRACAJAC. \nW KOLEJCE STOISZ 400 LAT BO GRAZYNA NA OKNIE ZAMIAST SPI PIZDE PRACUJE JAKBY BYA PO MIKSIE ALPRAZOLAMU Z KODEIN ZARZUCAN PER RECTUM. PO TYM BLIEJ NIE OKRELONYM CZASIE STANIA W KOLEJCE GDY TO ZDYE OBMYLI KAD SEKUND TWOJEGO CHUJOWEGO YCIA, KAD ZMARNOWAN SZANS I KAD LE PODJT DECYZJ NADCHODZI TEN DUGO WYCZEKIWANY MOMENT CHWAY.\n>OOO BARDZO MI PRZYKRO ALE PO LIST TO PAN MUSI JUTRO PODEJSC BO JESZCZE LISTONOSZ NA MIECIE\nKURWA JUTRO.\nMAM TU PRZYJSC JUTRO TYLKO PO TO ZEBY POWTORZYC JESZCZE RAZ CALY TEN ZABIEG SKURWIENIA UMYSLOWEGO ZEBY DOSTAC KAWALEK PIERDOLONEJ KARTKI? \nAAAAA KURWA\n>OOOO ADRES MUSI PAN PRZEPISA NA MOJ KARTK Z KODEM KRESKOWYM Z NASA (KOD Z NASA DLA ZMYKI EBY MYLA E DOJDZIE SZYBKO JAK RAKIETA ALE TAK NAPRAWD TO PRZEKAZ PODPROGOWY E TWJ LIST ZOSTANIE WYPIERDOLONY W KOSMOS I NIGDY NIE DOJDZIE) PROSZE TU DLA PANA DUGOPIS I ZAPRASZAM DO STOLIKA A POTEM NA KONIEC KOLEJKI XD\nSPOKO DOBRZE E MAM W CHUJ WOLNEGO CZASU I WCALE MI SI NIE SPIESZY.\n>MA BYC OSTROZNIE? \n>NIEE PROSZE PANI NIE TRZEBA JEST DOBRZE ZAPAKOWANE (ZYD MODE ON NIE BEDE DOPLACAL KILKU ZLOTY SKURWIELOM) \n>OK SPRAWDZIMY (WKLADA DO POJEMNIKA OZNACZONEGO \"DO ROZJEBANIA XD\")\nJAK SIE DOMYSLASZ CHUJE POTRAFI ROZPIERDOLI NIEMIECKIEGO 57 TONOWEGO PANZERKAMPFWAGEN VI TIGERA OWINITEGO TON FOLII BBELKOWEJ.\nOSOBICIE UWAAM E INSTYTUCJA POWINNA TA ZOSTA ZRWNANA Z POZIOMEM GRUTNU W RACZKACH ELBLSKICH ALBO CAKOWICIE ZREFORMOWANA. \nREFORMA?\n1. BABY PRACUJCE NA POCZCIE POWINNO WYBIERA SIE ZE SKAZANYCH ZA NAJGRONIEJSZE PRZESTPSTWA Z ZAKADW KARNYCH O NAJCISZYM RYGORZE I FASZEROWA SSRI TAK EBY ELEGANCKO, MIO I Z UMIECHEM NA TWARZY OBSUGIWAY KADEGO KLIENTA. \n2. TAKA SKAZANA MIAABY DO ODSUENIA 10 PIERDOLONYCH LAT NA OKIENKU BEZ PRZERWY ALE TO ZADNEJ PRZERWY. ZADNEGO SIKU, ZADNEJ KURWA KAWUSI A O PARZAKU TO KURWA W OGOLE ZAPOMNIJ.\n3. REFORMA DOPROWADZIABY DO OGLNEGO DOBROBYTU PONIEWA NIE BYOBY ADNYCH PRZESZKD BY POCZTA BYA OTWARTA 24 KURWA GODZINY NA DOB 7 JEBANYCH DNI W TYGODNIU.\n4. PO 10 LATACH KULA W EB I D Z WAPNEM.\nCZY TO JEST TAKIE TRUDNE JA PIERDOLE",
 "title": ""
}