{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "N7C8Zxvs",
 "pasteDate": "Feb 26, 2018, 2:08:27 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "I know I texted u saying that I wanted to talk to you earlier. But I'm sure I'm not going to see you from now until you leave, or until you come back to see Avionne so I'm gonna send you a fucking ESSAY that outlines what I wanted to speak about... And my position on each.\n\nDifferent drugs have a different effect on everyone. Alcohol makes people angry. Weed makes some people lazy or even yet more creative and active.\n\nAmbien makes me feel.... Like telling people how I feel. I know It's not something you want to hear, but. I'll still say it anyway.\n\nWhat I wanted to talk to you about was about me and you. \"Me and you?\" you're probably saying, and I'm pretty sure you would be saying it to deny there's anything there other than friends, but... I believe there's something more than simply being friends.\n\nNow let me get this out of the way - if there isn't anything more than friends between us, then I'm asking you to let me go about my merry way and re-focus on what I was focusing on before, regarding people in my life, and everything else. And also, for you to fully undestand why. (explanation coming soon)\n\nNot that being your friend isn't without it's benefits. But there's more to it than that. Let me explain. Yesterday (Saturday) I told Avionne that I didn't want to talk to you anymore cuz you be on some bullshit sometimes. And that I wasn't going to go downstairs when you came over, that I wasn't going to bother you, text you, call you, or even speak to you. Pretty much just go on my merry way.\n\nWhy?\n\nBecause I'm confused by you. I feel... The utmost respect, desire, need, and a want for you. I feel as if I need to hold your neck and pull you to me. I need to GRAB you, and feel your body next to mine. \n\nAnd then on some days I get nothing. Just NOTHING. Then some days, things happen that motivate me. Like... U laying on me this morning on the way back from the diner, me putting my arm around you. You coming UPSTAIRS AT FIVE AM, TO COME AND GET ME.\n\nME.... ME!!!!! You walked to my fucking room door, and stood there... Because you wanted me to come downstairs with you.\n\nI don't know what your intentions were, or if you felt embarassed, or not. But I looked at that, and thought:\n\nHoly shit... She's here. This beautiful, amazing, gorgeous motherufcker is here... For me. She came up here and no matter what was gonna try to get me down there. I fuckin' want this bitch forever.\n\nBut then.... You won't let me do what I want to do. I can't kiss you. I can't cuddle with you. I can't fuck you. I can't eat you out. I can't touch you. I can't look into your eyes and ask dark questions about you. I can't come get you at 3AM and drive about with you. I can't do.... Anything. Because you won't let me. You tell me you're not ready for a relationship, but you show up AT MY ROOM DOOR at 5AM in the morning and bring me back down.  And let me guess \"I was high.\" (which doesn't matter cuz when ur high ur true feelings are easier to come out)\n\nPriscilla, I can't do that. I can't have all these things I want to do, and then you shoot it down or don't return it, and when I say \"alright, I'm out\", you come to me and in doing so you open up all these feelings for you. I'm complicating shit, I'm sure. But I can't. I can't sit here and pretend like we're \"FRIENDS\" smoking a blunt. When YOU'RE THE BITCH I WANT TO BE AROUND AND GROW WITH 24/7.\n\nSo I get it. You're trying to get over your ex. You don't want to feel pressured into something that you're going to ruin. You're afraid of whatever if is that you're afraid of.\n\nBut all I can say is this:\n *Fuck your fears. You know damn well I would love you for fucking ever.\n *Fuck your ex man. I'm not him. Do right by me and I'll do right by you unconditionally.\n *Fuck you feeling pressured into something, because I feel like I face the same amount of pressure. (if we get together, i'm gonna have to move out of here, i'm gonna have to find a way to stack bread to make a down payment. i'mma have to flip hard to get money for furniture, tv, services, etc. i'mma have to be on my bully shit, and it'll be all for you, because i would want to start the relationship off right, and make sure you know, ain't no other bitch coming around me or near me but you.)\n \nAnd I guess the final thing I can say is:\n\nI never wrote this long ass essay to say: \"Hey, I'm gonna pressure you into a relationship / thing with me.\"\n\nI wrote this to say: \"What's going on now isn't working for me. And I don't think it will. If you think things can change - please... Change them and let's make something amazing together. But if not? Then you should still come over to the house, and hang with Avionne. Still come thru and blow it down. I'm just not going to be down there. And we'll say Hi and Bye, but nothing more.\n\n#overthinkingit #shrug",
 "title": ""
}