{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en",
  "kw_evil"
 ],
 "key": "NhgJF337",
 "pasteDate": "Feb 8, 2018, 7:42:14 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "JP Soundtrack is far superior. What I can say about the US version is that it tries too hard. It really tries to be atmospheric, and as far as present stages go they're okay. It's not trying to be fun to me, being too standard, too safe. Yeah it's atmospheric, and that's it. Tidal Tempest Present JP is very atmospheric and it's catchy too, even more atmospheric than any song on the US soundtrack really. Good futures are plain zzz and bad futures try waaaaaaaaaaaaaaay too hard to make it seem horrible and bad. We don't even need to talk about the US boss theme. Literally summoning Satan. It's just un-Sonic like. There's a reason why the majority of the time when a Sonic CD track is brought into a later Sonic game, it's the JP one. Just look at Sonic Mania. It's cuz the JP track is far superior. Give up. \n\nPalmtree Panic\nPresent - A happy and exciting tropical island. Children cheering, it's so happy. \nPast - A more relaxed, but still exciting tone. Feels like it belongs in a Harvest Moon game. Summer theme anyone?\nGood Future - An even happier version of the Present. Sounds like you won $1 million on a game show.\nBad Future - False. Distorted. Twisted. It's still an exciting place, that's the whole theme of Palmtree Panic, but now all of that excitement has been replaced with robots. Parts of the melody that's present in the Present/Good Future is just gone (as with all of the bad future themes). The robots boo you when you enter the stage, the cheering is roboticized. A truly bad future. \n\nCollision Chaos\nPresent - Very 90s. Very Cool. I have a hard time deciding if this is my favorite Present theme.\nPast - It's like Present theme but on a lower firmware. Really cool. Feels Gameboy like.\nGood Future - It feels very 'SEGA' to me. Like I dunno, you might hear this from PSO or Air Channel(?) or something. Very futuristic and peaceful sounding.\nBad Future - The chaos is gone. It's become 'stagnant', or 'dormant'. Feels like you're on the wrong side of town. Of the bad futures this is the place that's the most well off, but it's still pretty bad. \n\nTidal Tempest\nPresent - A relaxing, watery deep. Soothing, like you could just melt into the water. Hard to decide if this is my favorite Present theme.\nPast - Very prehistoric sounding. It's the most 'past' sounding of the past themes to me.\nGood Future - It sounds truly happy. Like you've been whisked into a watery paradise. One of the happiest sounding Good Futures next to Palmtree Panic, Metallic Madness, and Quartz Quadrant.\nBad Future - The contrast is very very noticeable. It sounds hellish. Completely roboticized. Polluted. One of the worst sounding bad futures. This is truly not the place you were in a moment ago.\n\nQuartz Quadrant\nPresent - A relaxing, catchy, and happy song. It feels like a song you'd hear on a sitcom or something. Hard to decide if this is my favorite Present theme.\nPast - Has a pretty ancient feeling. Also sounds like it belongs on a GBA.\nGood Future - It actually sounds like paradise. Beautiful.\nBad Future - It's gotten really bleak. Eggman has got this place now, and the important part of the melody that makes this tune catchy and cheery is gone. The second half of this song really gives the feeling of this place being mined at an alarming rate. It's gotten really bad.\n\nWacky Workbench\nPresent - Like a wacky factory. Pretty cartoony to me. I like this theme a lot.\nPast - It's still wacky, but now it's even more funky. This is probably my favorite Past theme. The sounds are so fun.\nGood Future - Just like Collision Chaos Good Future, it has a very 'SEGA' feeling to it. Hard to describe.\nBad Future - This place has become ROBOT HELL!!!!! A dystopian robot world!!!! Robots everywhere!! Everything is falling apart!! Oh no!!!\n\nStardust Speedway\nPresent - It's quite black sounding not gonna lie. Funky beats, the guitar, the sax, this bossa nova jazz whatever the heck it is makes this a really good song. Probably the least VGM sounding. \nPast - A smoother, more soulful feeling to it. Sonic Mania did a really good job with this one btw.\nGood Future - Sounds like an ending theme, or the version of Stardust Speedway you hear at a graduation or something.\nBad Future - Speeding down a highway, cops on your tail, crime all over the place, it sounds like Inglewood in Chicago. \n\nMetallic Madness\nPresent - It sounds like an awesome final stage. The rapping is so corny. Yo we outta here!\nPast - I like the piano in this version better than the Present. Sounds a lot more... dark and funky I guess you could say? A lot more evil sounding, boogey woogey. \nGood Future - This is such a good sounding future that it just blobs you. You legit win if you're seeing this future, so be happy.\nBad Future - Yup, you failed. You failed BIG TIME. There is no going back. Eggman is mocking you. An absolute bad end for a loser like you. Don't even try. Reset the game, get some help. Just give up.",
 "title": "Onions on Sanic She-Dee Muzak"
}