{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en",
  "kw_expose"
 ],
 "key": "nQZesEu6",
 "pasteDate": "Feb 17, 2018, 1:58:04 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "1\nBEC: Bec began to circle around her feet, desperate for her attention. If one were to look under him they'd see a large throbbing dog cock. The poor pup was in heat and needed release desperately.\n2\nROXY: Roxy wasn't... Used to canines in the slightest. Come on, she was the cat girl after all! But Jade, being the dog girl, was just so cute and fun to hang out with... Even when it meant having Bec prowl after her when she was left alone for a couple of hours. Even not being used ot them, though, the short, curvy girl couldn't help but crouch down a bit- Hand ruffling through his head, and a sigh leaving her black painted lips. \"whats up boy? hungry or somethin...? ugh, jade didnt even tell me where she kept ur food..\"\n1\nBEC: He growled and barked softly, nothing aggressive but more of a sound of dismay. He jumped up on Roxy, licking her face as his real problem poked her in her side. Bec was a big dog, and as such, he had a big tool to boot.\n2\nROXY: In turn, Roxy was quite the short girl. Well under 5' for sure, wearing a nice pair of leggings that /hugged/ her thick thighs and wobbly rear, and a loose boatneck shirt with her pink symbol. Feeling him leanin in to lap at her face made her snicker, but soon enough, thrown back to sit on the ground, she could feel how he /pressed/ himself closer and how something ground against her, making her little laugh slowly fade. \"hah... ah- bec, cmon ur heavy and... warm, get off will ya?\"\n1\nBEC: He didnt stop. He kept licking her face as hia body rubbed against hers. It was the only form of relief he had gotten and he wasn't going to stop soon. His cock was now rubbing against her stomach, the soft fabric of her shirt feeling wonderful. God he was big. Bigger than any dog his size should be. And considering how big he was, that was saying something.\n2\nROXY: Roxy never got an answer with Jade about what kinda breed her dog was, but whatever he was? He really was big. If Roxy were a bit smaller, she'd be able to ride him like a horsey, and that was saying something! So having this beast trying to overpower her and actually /grinding/ that... Thing against her belly, it was quickly getting her uncomfortable. Breathing getting heavier, whines leaving her lips, and her hands moving down to /squeeze/ around his cock- Trying to push it to the side, away from her belly and shirt...\n1\nBEC: He barked when she touched his cock, pushing it even harder against her now that he felt her touching it. He growled lightly from pleasure. He was almoat as big as roxy herself, so she wasnt getting up at all with this big pup on top of her and humping away at her stomach tits.\n2\nROXY: The fact that thing actually /pushed/ against her chest from time to time really made her cheeks pale. It was not possible, her hands weren't stopping him from thrusting a single bit, and so, soon enough they moved from that shaft to his head- Trying to keep him away, to breathe in and groan without risking having his tongue dip into her maw. \"b-bec, bad dog, bad dog! stop tha- ahn- j-jesus, i thought jade had u fixed...!\"\n1\nBEC: He growled when she pushed on his face amd snapped at her. She wasnt the alpha here so she didn't get to command him. He moved so he was completely on top of her, cock hanging over her stoamch and almost resting against her crotch.\n2\nROXY: Snap. Okay- Bad idea to have her hands there, she removed them from the vicinity of those sharp fangs and /pressed/ her body back against the floor! Letting him easily crawl over her, whining- And then letting her hands dart back down to his cock. Maybe... If she just squeezed a bit... \"o-okay okay i get it! sorry, haha, see im- my hands are... warm and smooth right? hah... if i just... jerk u a lil like this ull... not bite me right...?\"\n1\nBEC: His growling lessened when she went back to stroking him, it turning from aggressive to pleasurable once again. He pumped his cock against her hands, they were warm and smooth, but ndot as warm amd smooth as what he truly wanted.\n2\nROXY: Still, she tried... She wasn't going to get fucked by something of this size, so maybe jerking him off and letting him rest would leave an opening to sneak out of the house or call Jade? Her heart pounded, as it dawned on her what she was doing... Her hands running up and down that veiny, tapered shaft, feeling its texture, how /wide/ it got towards the base... \"ah...\"\n1\nBEC: He licked her face as she kept stroking him. Her hands felt great but after a certain point he wasnt getting anything from it. He growled again as he nuzzled\n1\nBEC: Her stomach, moving lower to Her thighs.\n2\nROXY: \"y-yeah... thats right u perv of a dog... cmon just get off soon and-\" Nope, she wouldn't have that luck. Her heart skipped a beat as he started to nuzzle down her chest and belly, and towards her groin- Thighs soon squeezing together, and her eyes wide, the dog moving back enough that her fingers couldn't reach his shaft anymore! \"h-hey, hey come back up here! shoo, not...\"\n1\nBEC: He nuzzled into her thighs, licking and sniffing at her crotch before lightly nipping at the tights she had. He was trying to get her cloths off, or at least rip a hole so he could get at her holes.\n2\nROXY: And with just black leggings and silky panties in the way? Those fangs of his would surely catch on the fabric easily and /tear/ it without any difficulty! Starting to expose more of that lovely, smooth skin, letting the scent of that pink little slit between her thighs waft through and out at the canine. \"n-no no come on pls!\" Her legs started to flail more- Trying to push him back!\n1\nBEC: He growled aggressively as he placed his paws on her legs. He could smell her sex and he needed to get at it. He continued to rip and tear at her clothing until she was finally bare from the waist down. He went back to licking her thighs and getting the occasional lick at her pussy.\n2\nROXY: Not even awkwardly flailing. This was so bad! He just kept tearing at her clothes, leaving the girl shaking. His warm breath, his hot tongue, dragging along the sensitive skin of her thighs- And then finally, a lick to her vulva. That wide, warm tongue /dragging/ along her folds and making her entire body arch back! Eyes wide, gasping, freezing her legs in that lightly spread-open position...\n1\nBEC: With her legs spread he could get at her pussy with no problem. His wide and rough tongue lapped at her sex repeatedly, it able to slide across her clit with each lick. He was preparing her. Making sure she was nice and wet for his cock.\n2\nROXY: She didn't want this! At first... But that hot tongue, and the way he insistently /buried/ his nose against her sex, each stroke and lap at her clit- It was really starting to make her folds oh-so wet, moisture drooling down her thighs, to the ground beneath, all while she was left gasping and /biting/ down on her lower lip. \"f-fffng- b-beeeec...\"\n1\nBEC: He lapped at the entire area, enjoying the taste of her juices so he just kept licking. His nose pressed against het clit for a moment but something that cold touch hey clit would sure send a jolt through her. Her pussy was just getting wetter and wetter so he had plenty to lick and taste.\n2\nROXY: It wasn't just her cunt either- That intimidation she felt, there was a warmth coursing through her that little by little got rid of it. Huffing, whining, and bringing her hands to her face, to cover her mouth- Only to feel the lingering scent of his cock right against her nostril! Just in time for the pressure of that cold nose, a quick /rush/ of endorphines flowing throguh her and- Her little cunt twitching a few times, clamping, and a little /gush/ of her juices squirting at the dog's face! Leaving her shaking for a moment with her eyes rolled back...!\n1\nBEC: He licked her clean after ahe squirted. He was getting impatient and started to nudge at her sides, trying to get her to roll over onto her stomach. He cock throbbed harder and harder as his nose was filled with the scent of her arousal. He was looming over her, no where for her to go unless she rolled over.\n2\nROXY: Why did it feel this good? He was... Bec was a dog- Just a dog! A feral beast! But his tongue, his nose, so easily he'd made her just cum on the spot like that! Leaving her shuddering and weak in the afterglow, tongue out of her mouth- And limp enough to easily flop over onto her side! Rear jiggling briefly, still ever so slightly covered with a few strands of what was left of her leggings, and soon after, flopping over onto her belly and chest, still panting. \"f-fffnn...\"\n1\nBEC: Thats when he mounted her, wrapping his front paws around get hips so that he could raise her ass a little. His cock poked around at her fat ass before finally pushed into her pussy, sinking half of that massive dog cock inside her soaked pussy on the first thrust.\n2\nROXY: This couldn't be happening. She didn't believe she was allowing this- That she was... Looking forward to this? The feel of those strong paws, the warm fur along her back, the tapered tip prodding around, she was too weak to complain, too... Dazed to care! His mouth had been good so this would be even better right...? But there was no care, no delight as that pretty much dry thing /slammed/ forward with a powerful hump. Those poor walls /split/ open under the sheer strength and her body clamping down immediately, as the tip /battered/ directly against her cervix in a swift strike! Face right against the ground and /squealing/ as her rear was left up and /quivering/, insides pulsing quickly around him, eyes wide open. \"o-ogh- f-ffnnghh!!\"\n1\nBEC: He began to thrust into her, thick cock rubbing against her walls as his tip pounded against her womb. And he still had more cock left. He barked and growled in pleasure as he grew faster with his thrusting, slamming harder into her to force those last inches inside her.\n2\nROXY: But those walls didn't want to give in! Too tight, too clingy around Bec's shaft, she was left to pant and /groan/ as she felt with her hands the /bump/ that thing left on her lithe belly! Bulging it out with each ravishing thrust that aimed to bury him entirely in her, but doing little more than to /yank/ her poor cunt back and forth, to shake her womb around, cervix tight as ever, not wanting to give in to that narrow tip, drool rolling down her lips as little tears ruined the girl's mascara...\n1\nBEC: He didnt slow down, only sped up. He was hammering at her cervix with increasing force. He was\n1\nBEC: Going to make sure every inch was inside her. He howled as he pounded harder and harder. She was his bitch now and he was going to knot her like a real breeding bitch should be.\n2\nROXY: \"f-fuuuck- fuck fuck- nnnggghh!!\" Her voice could barely make it past her low moans, eyes still rolled back, hips /grinding/ into each of his humps, the poor girl kept whining and gasping for air, as finally, her womb was unable to keep him out- That narrow tip /hammered/ forward and /pierced/ through that last barrier, in a swift movement /burying/ that thing into her womb and against the furthest wall of it! Forcing a loud yelp out of the girl, biting at the neck of her shirt to try and muffle her noises...!\n1\nBEC: With her womb now penetrated he could get his full length inside her. He howled once more as his knot slammed against her folds. He was close to just knotting her now,making her his bitch. But now wasnt the right time.\n2\nROXY: She could feel it. Pulsing, throbbing, /filling/ every nook and cranny of her insides! Warping the shape of her poor womb and making her belly /bulge/ out obscenely, drawing back, nearly feeling like she was being gouged, and then /slammed/ right back in! That enormous bulb at the base /slapping/ against her cunt, against her clit, bigger than anything she'd ever had inside, even when that cock alone was /widening/ her like no toy ever had! It felt more like her insides were being /punched/ over and over more than anything else, and yet... It was so... Intense. \"g-god- fuck- b-bec- f-fuckin p-plow me l-like u would fuckin jade- nmnnghh!!\"\n1\nBEC: More howls and barks left his mouth as he slammed into this bitch. She knew her place now. She knew that her pussy belonged to him. He had reshped her cunt and womb to take him. And take him she would. His nails scratched at her sides lightly as his knot pushed against her entrance. He had her filled to the brim already but now she was going to take the last stretch. She was going to be knotted like the proper breeding bitch she had now become. He slammed one one more time, forcing the knot inside her he plugged her cunt. His knot started to swell and so did his cock. That only meant one thing, he was ready to cum. And cum he did. Of she felt full with his cock inside her, the amount of puppy batter he was now pouring into her was another level. He flooded her womb with his seed, forcing her to be filled with good young.",
 "title": "BecRoxy2"
}