{
 "espireDate": "1D",
 "format": "text",
 "jSonReasons": [
  "lg_es"
 ],
 "key": "NUbs9gBk",
 "pasteDate": "Feb 18, 2018, 11:55:03 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Muy feliz ao nuevo, amigas mas. El 2011 lleg a nuestras vidas hace ya casi un mes, y yo ya vengo cargadita de historias que contaros. Historias que, como siempre, son para rerse, para llorar o simplemente para contar algo al mundo, porque merece la pena ser contado.\n\nDicen que entrar en el nuevo ao con buen pie es importante. En realidad no s si esto es as o la mayora de personas as lo cree. No s vosotras, pero en mi caso, no pude empezar el 2011 de una manera peor. Esta ha sido, con diferencia, la peor nochevieja de que haya habido y habr en mi catlogo de historias para olvidar. Pero antes de que se me olvide, permitidme compartirla con vosotras, porque de todo se aprende en esta vida.\n\nPues bien, ya os habl una vez de aquel amigo con el que intent cruzar la \"lnea verde\" en ms de una ocasin. A pesar de nuestros tropiezos, supimos mantener la amistad por encima de todo. El chico est ahora estudiando el extranjero y, en un principio, nos invit a todo el grupo de amigos a pasar la nochevieja all, prometiendo que sera inolvidable. Bueno, en eso no se equivoc el muy desgraciado\n\nPoco despus de comprarme los billetes de avin, supe que mis amigos todava \"no saban nada\" de este presunto viaje. Total que cuando fueron a mirar vuelos, estaban ya por las nubes (y perdonad el chiste malo) y ninguno pudo apuntarse. \"Geniaaal, sola con mi amigo. Qu pedazo nochevieja nos espera\" pensaba con excesivo sarcasmo enfermizo. El chico me dijo que no me preocupara, que all estaran sus amigos y nos montaramos una buena fiesta. Y yo acced, totalmente ajena a la pesadilla que me tena planeada el destino (o l).\n\nMaldigo la hora en que puse mis pies en aquel avin que me llev al congelado culo de Europa. La catstrofe estaba anunciada desde haca das. Estaba tan claro y no hice caso a las seales ni mis propios instintos. Despus de haber pasado unas navidades bastante tranquilas e inusualmente felices, me apeteca quedarme ms tiempo en casa con los mos. \"Pues no vayas si no quieres\", me deca mi querida mam. Ojal le hubiera hecho caso. Amigas fminas del mundo entero, esta es la primera leccin que he aprendido en el 2011: sigue tus instintos, y si tus instintos te dicen que no quieren irse a un puetero pas en vas de desarrollo con un imbcil prepotente, entonces no vayas.\n\nDemasiado tarde. Yo ya estaba all, muerta de fro, de hambre, y hasta dira que aterrorizada de ver un pas tan feo, tan oscuro y tan triste. Llevbamos ya un par de das juntos y la tensin empez a hacerse notar. Comenzamos a discutir por cualquier cosa, llevarnos la contraria, sacarle la puntilla a cualquier comentario, etc. Incluso antes de salir de Espaa yo ya estaba hartsima de l y no poda ni verle masticar la comida con su cara deformada y calavrica (ntese el extremo odio y rencor en mis adjetivos).\n\nMe trat fatal. Nunca he visto (y espero no ver) a un hombre pisotear y escupir sobre la palabra \"caballerosidad\" como mi \"amigo\" hizo en aquella semana. Me oblig a dormir en un sof-piedra con el pretexto de \"o duermes conmigo en la cama o en el sof\". Le expliqu lo mejor que supe que no quera meterme en la cama con l. Primero porque no me atrae lo ms mnimo. Y segundo porque odio dormir con personas que no me inspiran confianza, porque acabo durmiendo todo el rato hacia el mismo lado y al da siguiente quiero morirme. Tampoco me daba de comer. Esta fue una de las peores partes del viaje, el hambre que pas. Cuando llegaba el ansiado momento de la ingesta de alimentos, yo devoraba como una vagabunda en un festn. El muy cretino me estaba creando ansiedad por la comida porque dios saba cundo volvera a tener oportunidad de llevarme algo a la boca. Entre estos detallazos que tuvo el representante mayor de los mea-caballeros, nos tirbamos horas sin hablarnos porque simplemente no nos aguantbamos. Yo le odiaba por dentro. Senta ganas de pegarle, de gritarle, insultarle y dios sabe qu ms. Me senta engaada, secuestrada, atrapada, insultada. Si aquello era una venganza porque lo nuestro nunca funcion, el maldito bastardo se debi quedar bien agusto.\n\nY bien, vayamos al grano: nochevieja 2010. Antes del viaje, ya le iba preguntando por los planes para esa noche. \"No te preocupes de nada. Yo controlo\". Yo controlo? Y TANTO QUE LO HACA EL MUY CABRN. Presuntamente iramos a 3 fiestas que organizaban diferentes grupos de amigos suyos. El da 30 ya me dio la primera mala noticia: que cenaramos en su casa l y yo solos y nos uniramos a las fiestas despus de las campanadas. A m esto ya me sac de quicio. POR QU TENAMOS QUE CENAR SOLOS L Y YO EN NOCHEVIEJA? Pero este to qu se pensaba, que ramos una parejita feliz? Pero ah no acaba la cosa Hicimos la cena juntos (pattica, con ingredientes medio-podridos sacados de la mismsima II Guerra Mundial) y l se encarg de poner la mesa \"lindsima\", con velitas incluidas. Yo flipaba. Aprovechaba cuando iba al bao para llorar y desahogarme. Me odiaba a m misma por haberme hecho pasar la peor nochevieja de mi vida.\n\nAcabadas las campanadas, el patn llam a sus amigos. No pude escuchar nada, porque el muy lerdo por no saber, no sabe ni hablar ingls. Dudo mucho que aquellos pudieran entender lo que deca. Total, que me empez a contar la vida con que una fiesta estaba \"demasiado lejos, en otro pueblo, y ahora no hay taxis\", que si \"es que la otra fiesta ya est acabando porque aqu acaban pronto\" (eran las 2 de la maana). Excusas. All estaba yo, divina de la muerte, con mi vestidito, maquillada, lentillas puestas y el poco nimo que me quedaba, dispuesta a intentar pasar una buena noche al menos. Casi exploto a llorar all mismo. Encima el muy cnico me deca que esta estaba siendo la mejor de sus nocheviejas. PERO CMO SE PUEDE SER TAN NECIO!!\n\nCuando se puso a mirar el Facebook a las 3 de la maana de una nochevieja, decid que era hora de emborracharme y olvidar mi pattica existencia por unas horas. Y vaya que si lo hice. Cuando quise darme cuenta, all estaba en plenos preeliminares con el zoquete en persona. HORROR!! Pero no. El monstruo de la peli an no haba llegado. Cuando fui a meterle mano a \"all abajo\" quise morirme! No pude pensar en nada, en realidad. Estaba totalmente en shock. El paleto tena, y no exagero, los testculos ms grandes que el propio miembro!!! Encima la cosa ni se le levantaba. Estaba como aturdida. An as, como era tan pequea, le puso un preservativo, que se le caa todo el rato. (Cuando creis que esta historia est siendo lo suficientemente pattica, escapad al siguiente prrafo). Yo no saba que hacer. En aquel momento se me fue la borrachera, la lbido y hasta la heterosexualidad. Cmo puedo tener tan mala suerte? Mi primera experiencia sexual en meses y me sale esto?! Por supuesto, con \"aquel panorama\" no se poda hacer nada, y a m ya se me haba quitado las ganas de todo. As que le dije que nanai y que cada cual a dormir a su cama. l se indign y hasta dijo algunas groseras porque no quera dormir en su cama abrazaditos. A VER, MICROPENE DE M****A, QU PARTE DE \"NO SOMOS PAREJA\" NO ENTIENDES?\n\nLa maana siguiente fue como una resaca, pero mental. Quera morirme. Me senta sucia, manchada, engaada, como violada. El chico me haba tendido una clara encerrona desde el principio. Haba planeado todo ese viaje rollo pareja feliz y me haba invitado engaada. Mujeres y hombres, habr hecho cosas crueles en mi corta vida, pero JAMS hara yo una guarrada semejante. \"Secuestrar\", porque as me vi yo (atrapada por la nieve en un pas tercermundista con este baboso micropenal), a una persona para llevrtela al catre. Eso no se hace, NO. Me cost mucho tiempo contar estar historia, aunque, por supuesto, una vez abr la boca, ya no pude parar de contarla a todos mis amigos (incluidos los comunes entre l y yo). La gente merece saber la verdad sobre este individuo.\n\nNunca hablamos de lo sucedido. En realidad no hablbamos de nada. Nos tirbamos 4 o 5 horas sin hablarnos. Como ya he dicho, me senta atrapada en aquel lugar, y mi nica obsesin era que pasara el tiempo rpido para poder besar mi patria querida cuanto antes. Tena hasta pesadillas por la noche. Para acabar de coronarlo todo, estbamos siempre solos, l y yo. No tena con quin desahogarme y empec a volverme loca. En aquellos largos periodos sin dirigirnos la palabra, yo discuta con l en mi cabeza. Me imaginaba a m misma rindome en su cara de su micro-problema. Me pareca que haba descubierto Amrica. POR FIN todo tena sentido. Su prepotencia y chulera, su falta de personalidad, su inseguridad, su manera de caminar y de comer Todo es debido a que no tiene pene! Y entonces me herva la sangre: cmo se haba atrevido a meterse en la cama conmigo con ESO??? Porque el chico est totalmente negado. No ve que tiene un grave problema. Con razn nunca ha tenido novia en los 8 aos que le conozco!\n\nCuando ya volv a casa, ms relajada y contenta, investigu un poco sobre los micropenes. Clnicamente, se considera micropene al que mida menos de 7 cm. Mi apodo no poda haber sido ms apropiado. En general, nunca me he fijado en el tamao. Si bien Mr. Big era un caso especial que dudo que vuelva a encontrar, el resto de mis amantes siempre fueron, pues, \"normales\". Incluso los asiticos estaban bastante bien dotados. Pero lo de este to no tena nombre Adems, cuntas veces hemos criticado a esos \"super-dotados\" que van de chulos por la vida pensando que no hay mujer que se le resista. Pues os digo, amigas, que un \"micro-dotado\" chulo es mucho peor. El otro al menos tiene motivos reales para chulear!\n\nObviamente no nos hemos vuelto a hablar. Yo no quise discutir en el viaje mientras dependiera de l que yo volviera a mi deseado pas. Me daba miedo que yo afilara mi lengua demasiado y pudiera hasta pegarme. Nunca te puedes fiar de un hombre con claro problemas de autoestima. Es como un perro con miedo, cuya agresividad es impredecible e inminente. Adems, me haba tratado tan mal que dios sabe de lo que sera capaz\n\nPues s, as fue mi apotesica entrada en el 2011. Estaba muy preocupada por lo que me pudiera deparar tal desgracia. Por eso me propuse celebrar tantas nocheviejas como fuera necesario para atraer la buena suerte. Y as llevo el mes de enero. Arruinadsima y con resacas dominicales. Pero no me arrepiento de nada. Porque aquel desgraciado me ense a valorarme ms y la traumtica experiencia ha hecho que quiera aprovechar mi vida. Ser feliz y sonrerle a esta mierda de destino que me putea constantemente.",
 "title": ""
}