{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "NvQTrZqT",
 "pasteDate": "Feb 28, 2018, 12:36:35 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "She should have known not to sneak into her roommates bedroom, the strange woman who always went around in floor length purple dresses, spangled with starry decorations. They could have been constellations, but, if they were, they were not of stars that Lauren was familiar with, having spent many a night with a telescope trained on the night sky. The woman was weird enough, a college student who was ever elusive about her major, pushing her thick glasses up her nose every other second. Her blonde, curly hair was ever unruly, much unlike Laurens carefully tamed and styled locks.\n\nLauren was plain. Lauren was normal. And yet it was for Lauren that everything was about to change.\n\nShed mooched in, eyes sullen and lips turned down, sure that it was the bitch of a day-dreamer that had taken her phone, but shed barely started looking around the unkempt mess of a bedroom before her attention was caught by something that perhaps should have skated under her radar entirely. But shed always had an eye for an antique, much to her final drama of downfall.\n\nA small lamp, like one out of an Aladdin type story, with one small, red triangle engraved on the side. It called to her in its simplicity and her lips curved up in a cruel sort of smile as she reached for it, greed swallowing up what remained of her heart.\n\nIf the cow was going to take her phone, shed have something that was no doubt valuable of hers too!\n\nIt would be the last mistake she ever made  at least as a human. For the moment her fingers touched it, her skin rippled as if suddenly rendered fluid and she recoiled in horror as her body, inexplicably, changed before her very eyes.\n\nShe tried to scream, falling to the floor and clawing at the bed like a wild animal, fighting to get herself back upright once more. The bed spread slipped from the mattress and she clutched at her throat, a strangled sort of gargle burbling out as spittle trailed over her lips. But they were not her lips again any longer, soft and pliable and coated with gloss, but something far, far more natural, more animalistic than she could ever have hoped to achieve with her feral style make-up.\n\nHer head pounded and she groaned brokenly as her shoulders jumped, twisting and grinding into a new form entirely. More and more, the bulk of her body swelled, fat and muscle slapping onto her bones in layers that should never have been present on a human body. Her breasts sucked back into her chest as she stretched up on all fours, legs coming further beneath her body as her toes pressed together into something hard and unyielding, digging into the carpet.\n\nHacking a cough, eyes bulging, the young woman lunged for the door, but found her fingers coming together in a hard, gloopy mass much the same as her toes, clothes ripping from her body as she simply grew too large for them. The blouse that she had taken hours on hours to choose in that trendy new shop  the name eluded her as she desperately tried to cling to her memories, shakier and shakier with every passing second  tore right down the chest and hung from her back and the jutting ridge of her spine as if she had become a grotesque sort of display herself.\n\nBut it didnt end there: the otherworldly workings were far, far from done with her. Her face bulged out, eyes moving back towards the sides of her head as he ears migrated up, becoming softer and more pliable as they waggled back and forth seemingly with a mind of their own. A tongue out of place in a human mouth grew thick and heaver and she whimpered around its mass as her face grew thicker, into a clearly animal snout. It fattened up her cheeks, slickening flesh down over bone in such a way that her features were erased completely, her line of vision rising up above the bed as she grew taller, legs lengthened on either side of the joints.\n\nIt was easier, horribly, to stand on all four legs rather than on her hands and knees  not that she had anything recognisable as those body parts. Slender hocks and forelegs were her fresh means of getting about and Lauren grunted, eyes growing dull and unintelligent as an animals nature slowly but surely took hold of her mind.\n\nA prickle of hair, a black and white patchy coat, spread over her nude skin, completing her transformation as a pair of full, heavy udders, complete with fat teats, swelled beneath her stomach, right where they belonged. Her new ropey tail lashed back and forth, drawing out from her spine as her body produced bone that had never been there before, a faint crackling noise causing her ears to flick. A very pink, fleshy tongue slithered out along the side of her muzzle and the animal that had been Lauren blinked unknowingly at the strange scene before her, a young womans bedroom and her knick-knacks suddenly beyond her lessened sense of comprehension.\n\nTrying to turn, she found the wardrobe in the way and exhaled a huff of air that could have been a sigh. But it was not from any sense of emotion and, finding nowhere to go, she stood facing the radiator, barely able to see out the window at the opposite row of college buildings, grey and stark and forlorn. It didnt matter to her that the whole place was like a block of prison cells  not anymore. All that mattered was the rumbling in her gut that told her she should have been chewing lush meadow grass, hooked up to a milking machine or with a bouncing, leaping calf at foot.\n\nA perfectly bred dairy cow, she mooed lowly, ears floppy as she waited on her new mistress to see just what use she could make of her.\n\nHer life would never be the same again.",
 "title": ""
}