{
 "espireDate": "N",
 "format": "javascript",
 "jSonReasons": [
  "kw_target",
  "re_url",
  "lg_en",
  "kw_evil",
  "kw_protection",
  "kw_targeting",
  "kw_attacks",
  "kw_attack",
  "re_ast1"
 ],
 "key": "NyftafU6",
 "pasteDate": "Feb 12, 2018, 11:29:45 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "var iFileName = \"witch.js\";\nRequiredSheetVersion(12.999);\n// This is an implementation of Mage Hand Press' Witch class\n// Transcribed by Joseph T. Foley <foley AT RU dot IS>\n\n/* Based upon: This class has been made by /u/Zarieth on the subbreddit /UnearthedArcana \n   It can be found here: https://reddit.com/5dtd1x/\n   This code is based on v0.4 of /u/Zarieth's work (2017-03-06)\n*/\n\nSourceList[\"MHP:CW\"] = {\n    name : \"MageHandPress: Complete Witch\",\n    abbreviation : \"MHP:CW\",\n    group : \"MageHandPress\",\n    url : \"https://store.magehandpress.com/products/witch\",\n    date : \"2018/02/10\",    \n};\n\n\n/*************** SPELLS ********************************/\n// Define the \"witch\" spells that are not already defined\nSpellsList[\"accursed act\"] = {\n    name : \"Accursed Act\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 26],\n    level : 1,\n    school : \"Ench\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,M\",\n    compMaterial : \"incense and a black candle\",\n    duration: \"Conc, 1min\",\n    save : \"Wis\",\n    description : \"1 crea save or take 1d8/SL+SpellMod psychic when Attack or Cast\",\n    descriptionFull : \"Lighting a candle, you speak dark curses in a lost tongue, directed at one creature you can see within range. That creature must make a Wisdom saving throw or be cursed for the duration. While cursed, whenever that creature takes the Attack or Cast a Spell action, it takes psychic damage equal to 1d8 + your spellcasting modifier. The creature can repeat their saving throw at the end of their turn, ending the effect on a success A remove curse spell ends this curse early.  \\n   At Higher Levels. When you cast this spell using a spell slot of 2nd-level or higher, you deal an additional 1d8 psychic damage for each slot level above 1st.\"\n};\n\nSpellsList[\"corruption curse\"] = {\n    name : \"Corruption Curse\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 26],\n    level : 6,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,\",\n    duration: \"Conc, 1hr\",\n    description : \"disadv on: DEX chk +save or CON sav+no regain HP or WIS sav+spel atk \",\n    descriptionFull : \"With a piercing glare and sinister gesture, you send a ribbon of dark magic into a targets body. A creature you can see within range is cursed for the duration and suffers from one of the following effects of your choice while cursed: \\n   Dull Reflexes. The target has disadvantage on Dexterity checks and saving throws. \\n  Feeble Fortitude. The target has disadvantage on Constitution saving throws and can't regain hit points. \\n  Weak Will. The target has disadvantage on Wisdom saving throws as well as spell attack rolls. \\n  A remove curse spell ends this curse early.\",\n};\n\nSpellsList[\"curse of aging\"] = {\n    name : \"Curse of Aging\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 26],\n    level : 6,\n    school : \"Trans\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S\",\n    duration: \"Until dispelled\",\n    save : \"Wis\",\n    description : \"WIS save or disadv STR chk+sav\",\n    descriptionFull : \"A creature you touch must succeed on a Wisdom saving throw or become cursed to age and wither. While cursed, the target ages at twice their normal rate, becoming two days older for every day that passes. In addition, it has disadvantage on all Strength checks and saving throws.\\n   A remove curse spell ends this curse.\",\n};\n\nSpellsList[\"curse of binding\"] = {\n    name : \"Curse of Binding\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 26],\n    level : 7,\n    school : \"Ench(rit)\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,M\",\n    compMaterial : \"body part targ\",\n    duration: \"Until dispelled\",\n    save : \"Chr\",\n    description : \"Bind creat to 20ft loc.  STR sav DC or dragged back.  Teleport CHR save.\",\n    descriptionFull : \"You bind one creature or object to a location, cursing it so that it may never leave. Choose a target and a location within range, both of which you must be able to see. If the target is a creature, it must make a Charisma saving throw (a willing creature may choose to fail this save), or be cursed to be permanently bound to the chosen location. While cursed, the target can act and move around freely, as long as it remains within 20 feet of the point it is bound to. If the target begins its turn outside of this area, it must make a Strength saving throw against your spell save DC or be dragged 60 feet towards the point it was bound to.\\n   In addition, if the creature attempts to teleport or use any other means of extraplanar travel, it must make another Charisma saving throw. On a failure, the travel attempt fails and any resources used are wasted. On a success, the curse is suppressed until the creature returns to the plane on which it was bound, at which point the dragging effect resumes.\\n   A remove curse spell ends this curse.\",\n};\n\nSpellsList[\"curse of blades\"] = {\n    name : \"Curse of Blades\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 26],\n    level : 3,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S\",\n    duration: \"Conc, 1min\",\n    save : \"Wis\",\n    description : \"Crea save or attack self.\",\n    descriptionFull : \"Unholy bands of black energy tie a creature to its weapon. Choose a creature you can see that is holding a weapon within range to make a Wisdom saving throw. On a failed save, the creature is cursed for the duration. A cursed target can't willingly drop or stow its weapon. Additionally, whenever it takes the Attack action on its turn, it makes one additional attack using its weapon targeting itself, against its own AC, dealing damage as normal on a hit.\\n   A remove curse spell ends this curse early.\",\n};\n\nSpellsList[\"curse of chains\"] = {\n    name : \"Curse of Chains\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 27],\n    level : 1,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"120 ft\",\n    components : \"V,S\",\n    duration: \"Conc, 1min\",\n    save : \"Con\",\n    description : \"Two crea 30 ft apart save or cannot move away from each other\",\n    descriptionFull : \"A black brand resembling iron shackles darkens the ankles of two creatures you can see. Choose two creatures you can see within range of the spell and within 30 feet of each other to make a Constitution saving throw. A willing creature can choose to fail this saving throw. On a failed save, a target is cursed for the duration. If only one target is cursed by this spell, you can use your action or bonus action on a subsequent turn to choose another target within 30 feet of the cursed creature to make a saving throw. While two creatures are cursed by this spell, they are unable to willingly move further away from each other.\\n   A remove curse spell ends this curse early.\",\n};\n\nSpellsList[\"curse of tomes\"] = {\n    name : \"Curse of Tomes\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 27],\n    level : 1,\n    school : \"Ench\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S\",\n    duration: \"24 hr\",\n    save : \"Wis\",\n    description : \"Creat save or illiterate.  Check 1/hr.\",\n    descriptionFull : \"You speak the backward words of a dead language, scrambling the letters in a target's mind. Choose one creature within range to make a Wisdom saving throw. On a failed save, the target is cursed for the duration. A cursed target can't read or write any language for the duration, prepare spells from a spellbook, perform rituals, or cast any spells that involve writing runes or sigils. At the end of each hour, the target can repeat this spell, ending the effects early on a success.\\n   A remove curse spell ends this curse early.\",\n};\n\nSpellsList[\"curse ward\"] = {\n    name : \"Curse Ward\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 27],\n    level : 2,\n    school : \"Abjur\",\n    time : \"1 a\",\n    range : \"Touch\",\n    components : \"V,S\",\n    duration: \"1hr\",\n    description : \"Prot curse, posessed, hex.  Max HP can't be lowered.\",\n    descriptionFull : \"You reach out your hand and touch a willing target within your reach, raising a smoke-like barrier around it. For the duration, the target has resistance to necrotic damage and can't be cursed, possessed, or targeted by a hex. Also, its maximum hit points can't be lowered. If the target is already affected by one of these effects, the effect is suspended until the spell ends.\",\n};\n\nSpellsList[\"curse weapon\"] = {\n    name : \"Curse Weapon\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 27],\n    level : 5,\n    school : \"Trans\",\n    time : \"1 a\",\n    range : \"Touch\",\n    components : \"V,S\",\n    duration: \"Until dispelled\",\n    description : \"Enchant weapon (fey immune), cursed roll d6 see table MHP:CW p.28\",\n    descriptionFull : \"You touch a weapon. Until the spell ends, the weapon becomes magical (if it wasnt already) and gains the following property in addition to any others it has:\\n   Curse. This weapon is cursed, and touching it extends this curse to you, unless you are a fey creature, in which case you suffer no ill effect. As long as you remain cursed, you are unwilling to part with the weapon, keeping it within reach at all times.  Whenever you roll a 1 on an attack roll with this weapon, roll a d6 and apply the result from the table below. \\n   1: You fall prone and your turn ends immediately.\\n   2: You are blinded until the end of your next turn.\\n   3: You are deafened until the end of your next turn.\\n   4:   You are immediately teleported 20 feet in a random direction. If you would end up within a solid obstacle, you take 2d6 bludgeoning damage and end up as close to the destination as possible.\\n   5: All food items within ten feet of you immediately spoil, becoming completely inedible.\\n   6: The weapon transforms into a live goose (or another animal chosen by the GM), which is magically bound to your hand and cannot be removed by any means (except by ending the curse). It reverts to its original form after one minute.\\n   A remove curse spell ends this curse\",\n};\n\nSpellsList[\"curse of youth\"] = {\n    name : \"Curse of Youth\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 28],\n    level : 4,\n    school : \"Trans\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,M\",\n    compMaterial : \"a child's toy\",\n    duration: \"Conc, 1hr\",\n    save : \"Wis\",\n    description : \"Crea to baby if not save.  Baby 50% HP, can't do anything, prone.\",\n    descriptionFull : \"This spell reverses time for a creature that you can see within range until it becomes a helpless baby. An unwilling creature must make a Wisdom saving throw to avoid the effect. Shapechangers and creatures that do not experience infancy automatically succeed on this saving throw.\\n   If the target drops to 0 hit points, it reverts back to its original age, and excess damage carries over to its normal form. As long as the excess damage doesnt reduce the creatures normal form to 0 hit points, it isnt knocked unconscious.\\n   The target retains all of its game statistics except its base movement speed, hit points, and size, which are changed to 10 feet, half of the target's maximum, and one size category smaller, respectively. It cannot take any actions, bonus actions, or reactions, cannot cast spells, and cannot communicate, except by crying (a person using the spell comprehend languages or similar abilities can interpret such crying to gain a rough understanding of the babys emotional state). While under the effects of this spell, the target is prone and cannot stand up without the help of an adult.\\n  The targets gear is unaffected by this spell; it will likely fall off the target due to being vastly oversized.\\n   A remove curse spell ends this curse early.\\n   At Higher Levels. If you cast this spell using a spell slot of 7th level or higher and maintain your concentration on it for the entire possible duration, the target makes another Wisdom saving throw. On a failure, the target is cursed to remain as a baby until a remove curse spell ends the curse. Additionally, if the target drops to 0 hit points, it does not revert to original age, and begins making death saves as normal. On a success, the effects end.\",\n};\n\n// Elemental Curse is missing from book\n\nSpellsList[\"flawed reconstruction\"] = {\n    name : \"Flawed Reconstruction\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 28],\n    level : 1,\n    school : \"Trans\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,M\",\n    compMaterial : \"needle and thread\",\n    duration: \"Inst\",\n    description : \"Targ regain 4d8.  Start of targ turn bleed 1d8, stop by action\",\n    descriptionFull : \"You stitch together the wounds of a creature you touch, which regains 4d8 hit points. However, the mending is imperfect, and the target begins to bleed profusely. At the start of its turn, the target takes an unavoidable and irreducible 1d8 damage. A bleeding creature can stop the bleeding by using its action to bandage its wounds. A creature that regains hit points due to this spell will be left with some permanent scars.\\n   At  Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st\",\n};\n\nSpellsList[\"frolicking fountain\"] = {\n    name : \"Frolicking Fountain\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 28],\n    level : 1,\n    school : \"Ench\",\n    time : \"1 a\",\n    range : \"120 ft\",\n    components : \"V,S,M\",\n    compMaterial : \"conductor's baton\",\n    duration: \"Conc, 1min\",\n    save : \"Wis\",\n    description : \"5ft cube water hypnotize.  Save or approach.  At 5ft, bons 4d6 bludg\",\n    descriptionFull : \"You cause a 5-foot cube of water within range to animate in a hypnotic motion. The water swirls for the duration, not leaving its space except to send small jets up to five feet into the air. Each creature except for the caster within 60 feet which sees the fountain must make a Wisdom saving throw or become charmed by you for the duration. While charmed by this spell, a creature must use its movement on each of its turns to get as close to the water as possible. A charmed creature cant willingly move away from the fountain. At the end of its turn, a charmed creature can attempt the saving throw again, ending the effect on a success. Once a creature has succeeded on a save against this spell, it cannot be affected by the same instance of it again.\\n   If a creature is within 5 feet of the dancing waters, you can use a bonus action to command the water to lash out at that creature. Make a melee spell attack against the target. On a hit, the water deals 4d6 bludgeoning damage to the target. If the target is charmed by this spell, it can attempt the saving throw again after taking damage from it.\",\n};\n\nSpellsList[\"hollowing curse\"] = {\n    name : \"Hollowing Curse\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 29],\n    level : 1,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"30 ft\",\n    components : \"V,S\",\n    duration: \"Conc, 1min\",\n    save : \"Dex\",\n    description : \"Mist drain 1d12/SL failed save, next action 1d12\",\n    descriptionFull : \"Tendrils of black mist extend from your fingertips, latching onto a creature and draining its vitality. Choose a creature you can see within range to make a Dexterity saving throw. On a failed save, the target takes 1d12 necrotic damage and is cursed for up to one minute. While the target is cursed, you can use your action to deal 1d12 necrotic damage to it automatically. The curse ends early if you use your action to do anything else, or if the target is ever outside the spells range or if it has total cover from you. A remove curse spell also ends this curse.\\n   At Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st.\",\n};\n\nSpellsList[\"identity curse\"] = {\n    name : \"Identity Curse\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 29],\n    level : 9,\n    school : \"Ench\",\n    time : \"1 a\",\n    range : \"60 ft\",\n    components : \"V,S,M\",\n    duration: \"Until Dispelled\",\n    save : \"Wis\",\n    description : \"Fail save uncon 1hr and forget identity\",\n    descriptionFull : \"You extend a finger to a creature's temple, who then forgets its own name. Choose one creature you can touch to make a Wisdom saving throw. On a failed save, the target falls unconscious for 1 hour and is cursed to forget its identity. When the target awakes, it loses all its personal memories, though the target retains all of its general knowledge, proficiencies, and other statistics. The target will not realize it has any class features or special abilities, and so does not willingly make use of them. If left to its own devices, the target will quickly adopt a new name and begin to build a new identity.\\n   A remove curse spell ends this curse. When this curse ends, the target regains all its past memories.\",\n};\n\nSpellsList[\"intrusive thought\"] = {\n    name : \"Intrusive thought\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 29],\n    level : 2,\n    school : \"Trans\",\n    time : \"reaction\",\n    range : \"60 ft\",\n    components : \"V,S\",\n    duration: \"Instantaneous\",\n    save : \"Wis\",\n    description : \"Crea save on Atk, Dash, Dodge, Diseng. fail and you choose\",\n    descriptionFull : \"As a reaction when a creature you can see within range takes the Attack, Dash, Dodge, or Disengage action, you can attempt to distort its thinking. The target makes a Wisdom saving throw. On a failed save, the creature instead takes your choice of those actions.\",\n};\n\nSpellsList[\"pharaoh's curse\"] = {\n    name : \"Pharaoh's Curse\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 29],\n    level : 5,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"10 ft\",\n    components : \"V,S\",\n    duration: \"Until dispelled\",\n    save : \"Con\",\n    description : \"Puff of dust.  Creat fail mummy rot: -3d6 HP/24 hr, no regain HP\",\n    descriptionFull : \"Opening your palm, you release a puff of dust, the pestilence of mummy rot. Choose one creature within range to make a Constitution saving throw. On a failed save, the target is cursed with mummy rot. The cursed target cant regain hit points, and its hit point maximum decreases by 10 (3d6) for every 24 hours that elapse. If the curse reduces the targets hit point maximum to 0, the target dies, and its body turns to dust.\\n   The curse lasts until removed by the remove curse spell or any other spell or magical effect that cures mummy rot.\",\n};\n\nSpellsList[\"ruby-eye curse\"] = {\n    name : \"Ruby-Eye Curse\",\n    classes : [\"witch\"],\n    source : [\"MHP:CW\", 29],\n    level : 3,\n    school : \"Necro\",\n    time : \"1 a\",\n    range : \"Touch\",\n    components : \"V,S\",\n    duration: \"Conc, 10min\",\n    save : \"Con\",\n    description : \"Red haze in eyes.  Crea save or blind past 5ft\",\n    descriptionFull : \"A red haze clouds the eyes of a creature that meets your gaze. Choose one creature you can see within range to make a Constitution saving throw. On a failed save, the creature is cursed for the duration. A cursed target can see normally out to 5 feet, but is blind beyond this radius\",\n};\n\n\n// Add the witch as a class for spells that do not already have it\n[ // cantrips\n    \"acid splash\", \"chill touch\", \"dancing lights\", \"mage hand\", \"message\", \"minor illusion\", \"presdigitation\", \"resistance\", \"spare the dying\", \"true strike\",\n    \n    // 1st level\n    \"animal friendship\", \"bane\", \"charm person\", \"comprehend languages\", \"detect magic\", \"disguise self\", \"expeditious retreat\", \"faerie fire\",\n    \"fog cloud\", \"hellish rebuke\", \"hex\", \"hideous laughter\", \"protection from evil and good\", \"silent image\", \"sleep\", \"thunderwave\", \"unseen servant\",\n\n    // 2nd level\n    \"animal messenger\", \"blindness/deafness\", \"calm emotions\", \"curse ward\", \"darkenss\", \"detect thoughts\", \"enthrall\", \"hold person\", \"intrusive thought\", \"invisibility\", \"knock\", \"misty step\", \"ray of enfeeblement\", \"shatter\", \"suggestion\",\n\n    // 3rd level\n    \"bestow curse\", \"clairvoyance\", \"curse of blades\", \"dispel magic\", \"fear\", \"hypnotic pattern\", \"magic circle\", \"major image\", \"nondetection\", \"sending\", \"slow\", \"speak with dead\", \"speak with plants\", \"stinking cloud\", \"tongues\",\n\n    // 4th level\n    \"arcane eye\", \"banishment\", \"compulsion\", \"confusion\", \"confusion\", \"dimension door\", \"greater invisibility\", \"locate creature\", \"phantasmal killer\",\n\n    // 5th level\n    \"dispel evil and good\", \"dominate person\", \"dream\", \"geas\", \"hold monster\", \"insect plague\", \"mislead\", \"modify memory\", \"planar binding\", \"scrying\", \"seeming\",\n\n    // 6th level\n    // elemental curse seems to be missing\n    \"eyebite\", \"guards and wards\", \"magic jar\", \"mass suggestion\", \"programmed illusion\", \"true seeing\",\n\n    // 7th level\n    \"etherealness\", \"forcecage\", \"mirage arcane\", \"project image\", \"plane shift\", \"sequester\", \"symbol\",\n    // 8th level\n    \"antipathy/sympathy\", \"demiplane\", \"dominate monster\", \"feeblemind\", \"glibness\", \"mind blank\", \"power word stun\",\n\n    // 9th level\n    \"astral projection\", \"foresight\", \"imprisonment\", \"weird\"\n].forEach(function (mySpells) {\n    if (SpellsList[mySpells]) SpellsList[mySpells].classes.push(\"witch\");\n});\n\n\nClassList[\"witch\"] = {\n    regExpSearch : /witch/i,\n    name : \"Witch\",\n    source : [\"MHP:CW\", 1],\n    primaryAbility : \"\\n \\u2022 Witch: Charisma;\",\n    abilitySave : 6,\n    prereqs : \"\\n \\u2022 Witch: Charisma 13;\",\n    improvements :  levels.map( function(n) {\n        return n < 4 ? 0 : n < 8 ? 1 : n < 12 ? 2 : n < 16 ? 3 : n < 19 ? 4 : 5;\n    }),\n    die : 8,\n    saves : [\"Wis\", \"Cha\"],\n    skills : [\"\\n\\n\" + toUni(\"Witch\") + \": Choose two from Arcana, Animal Handling, History, Insight, Medicine, Nature, and Religion.\"],\n    toolProfs : {\n        primary : [\"Alchemist's supplies\", [\"Herbalism or poisoner's kit\", 1]],\n        secondary : [\"Alchemist's supplies\", [\"Herbalism or poisoner's kit\", 1]]\n    },\n    armor : [\n        [true, false, false, false]\n    ],\n    weapons : [\n        [true, false, [\"blowgun\", \"shortsword\", \"whip\"]]\n    ],\n    equipment : \"Witch starting equipment:\\n \\u2022 A whip and blowgun -or- a light crossbow and 20 bolts -or- any simple weapon;\\n \\u2022 A component pouch -or- an a totem;\\n \\u2022 A scholar's pack -or- dungeoneer's pack;\\n \\u2022 Leather armor, any simple weapon and one daggers.\\n\\nAlternatively, choose 3d4 \\xD7 10 gp worth of starting equipment instead of both the class' and the background's starting equipment.\",\n    attacks : [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],\n    spellcastingFactor : 1,\n    spellcastingKnown : {\n        cantrips : [2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4],\n        spells : [4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14],\n        prepared : true\n    },\n    // Don't need the list because we have our own spell list\n    spellcastingList : {\n        class : \"witch\",\n        level : [0, 9]\n    },\n    subclasses : [\"Witch Craft\", [\"witch-red magic\",]],\n    features : {\n        \"spellcasting\" : {\n            name : \"Spellcasting\",\n            source : [\"MHP:CW\", 3],\n            minlevel : 1,\n            description : desc([\n                \"I can cast prepared witch cantrips/spells, using Charisma as my spellcasting ability\",\n                \"I can cast my prepared witch spells as rituals if they have the ritual tag\"\n            ]),\n            additional : levels.map( function(n) { return (n < 4 ? 2 : n < 10 ? 3 : 4) + \" cantrips known\"; })\n        },\n        \"subclassfeature2\" : {\n            name : \"Witch Craft\",\n            source : [\"MHP:CW\", 1],\n            minlevel : 3,\n            description : desc([\n                \"Choose a Witch Craft that you belong to and put it in the \\\"Class\\\" field\",\n                \"Choose either the Magic of Black, Blue, Red, Green, etc.\"\n            ])\n        },\n        \"cackle\" : {\n            name : \"Cackle\",\n            source : [\"MHP:CW\", 3],\n            minlevel : 2,\n            description : desc([\n                \"Extend hexes in 60ft for 1 rnd\"\n            ]),\n            action : [\"action\", \"\"],\n            usages : \"at will\",\n        },\n        \"improved familiar\" : {\n            name : \"Improve Familiar\",\n            source : [\"MHP:CW\", 3],\n            minlevel : 2,\n            description : desc([\n                \"Familiar summoned without components\"\n            ]),\n            action : [\"action\", \"\"],\n            usages : \"at will\",\n        },    \n    }\n};\n\nClassSubList[\"witch-red magic\"] = {\n    regExpSearch : /^(?=.*witch)(?=.*red).*$/i,\n    subname : \"Red Magic\",\n    source : [\"MHP:CW\", 16],\n    spellcastingExtra : [\"burning hands\", \"heat metal\", \"fireball\", \"wall of fire\", \"immolation\"],\n};",
 "title": "Simple Witch Class"
}