{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_threat",
  "kw_down",
  "lg_en"
 ],
 "key": "P9jbrvWG",
 "pasteDate": "Feb 17, 2018, 11:02:36 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Death: The Spillage of Red Ink\n\nAssassins were common in the day and age that he lived in, yet he never expected one to ever come after him and his family. The death of the male was something that he never expected. In the middle of a summer night, he had found himself doing something that was quickly becoming a habit -- training in the middle of the night, until the early hours of the morning. It was a night that was like any other, with him taking his bokken -- wooden sword -- and practicing the various kata that he had learned over the course of the week.\n\nIt was something that had become so ingrained in his collective subconscious, that it really had just become second nature to do this. Yet, this is also what prolonged his life for just a bit longer than it would have been. As the male stepped outside, there was one thing that he could smell as he had taken a moment to rest and take into consideration the surroundings. \n\nSmoke.\n\nSomething was burning. \n\nTurning the corner, he saw it. A fire had broken out in not just one, but multiple places at once. Everything around him was a wild inferno. His blood ran cold, and shivers began to writhe up and down his back. It practically overwhelmed him. He never thought this day would have come. He couldn't force himself to look away from the raging red and orange. For what seemed like forever, he remained there, trembling in fear, absorbing the screams and cries of his friends and family.\n\nBut, there was one thing that he caught from the blackness of the night.\n\nA single, green orb from the shadows, darting towards the head building. There was only one man that he knew that had an eye like that. There was only one that knew this location, too. Tatsuo Hattori. This caused his panic and fear to quickly melt away into bitterness, and the male immediately took off towards the head building, where he knew his father and master was. He burst into the room, weapon ready. He cried out for his father, and for his master. While his father was nowhere to be seen, his master, however, was.\n\nTakeshi Masamoto was fighting for his life against a lone man, clad entirely in black. One thing stood out about this particular ninja -- that same single, green eye. Several other shadows lay on the ground, crimson leaking from various parts of their bodies, and some even missing limbs. Sparks flared from the steel that clashed, the two warriors engaged in a deadly dance. Heat swirled around them like a shield, seeming to halt anyone from coming close to the battle. He had barely stepped into the room when all combat froze.\n\nHe watched Masamoto's gaze switch to him immediately, his eyes bulging in surprise. This was his mistake. He had to watch as the ninja took advantage of the registered shock on his enemy's face, adjusting himself to begin a killing strike. Overcome with emotion, Henrex foolishly charged at the ninja, bringing his weapon above his head and cut down at his head. As the wooden weapon was mere inched away from his enemy's head, he stopped. A cold, heartless laugh came from the ninja as he uttered two words to him:\n\n\"Never hesitate.\"\n\nWithin the span of a single second, he was immediately disarmed and brought to the ground, pinned by the threat of a sharp ninjato piercing his back. Everything had gone by so fast, Henrex was barely able to keep up with it. His vision was spotted and blurry, and everything in his midsection stung like the very flames that surrounded them. The assassin ordered Masamoto to kneel. With his student in danger, the man had little choice but to obey.\n\nDragging his arms forward and pinning them to the floor with a spare tanto, Dragon Eye reveled in such an easy victory over \"the mighty Takeshi Masamoto\". The assassin drew a new weapon, holding it over the man's neck as he asked him if he had any last words. The male simply turned to Henrex and smiled warmly, before closing his eyes and making one last prayer. Then, he imparted his last words to him.\n\n\"It's alright, Henrex. This is the Way of the Warrior. It is the resolute acceptance of death. Remember what my master said to me: Though you give up your life, do not give up your honor.\"\n\nThose final words burned themselves into his mind as the knife smoothly slid across Masamoto's throat. \n\nGore splattered across the once beautiful and clean tatami mats, drying near instantly from the surrounding heat. The body of the mighty swordsman collapsed to the ground as the last bits of light faded from his eyes. Tears welled in the young man's eyes as he watched his master, teacher, and idol breathe his last right in front of him. With his head bowed, Henrex silently grieved. But, it would be cut short by the sudden sound of soft footsteps across the room, directly towards him. Barely a mumble, the assassin would bare one compliment towards the now dead swordsman:\n\n\"As fearless in death as he was in life...\"\n\nThe assassin crouched down behind him, pressing the cold steel of the tanto against his back.\n\n\"Unfortunately for you, you won't be getting such a quick and painless end.\"\n\nThe icy blade left, before the flare of pain rocketed through his body as the assassin thrust the blade into him, pinning another part of his body to the floor. This process repeated until every part of him, outside of his vital spots, would be pinned to the floor. The process was rather quick, as the assassin was not exactly one with spare time. It was complete and utter agony for Henrex. He desperately wished to writhe around and scream from the flaring pain, but he couldn't.\n\nAs Henrex's eyes opened for the last time as a human, he saw the face of his killer. There was only one trait that he needed to see; the single, green eye. A sadistic grin was plastered on his pale features. Henrex could feel his heart sinking into his chest. The form of his killer vanished, Henrex felt a searing pain in his heart as heat flared throughout his entire being, and his vision whitened.\n\nAnd then...nothing.\n\nWith that -- the Child of the Mountain, Henrex Astillon, breathed his last.",
 "title": ""
}