{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "re_url",
  "lg_sv"
 ],
 "key": "pCyWD0iP",
 "pasteDate": "Feb 17, 2018, 9:11:12 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Vad kommer din karaktr heta: (Frnamn Efternam)\nRickard Bergqvist\n\nHur definerar du RP:\nRP r rollspel, det finns rollspel inom mnga olika spel som kan vara lite olika.\nI GTA ska du rollspela och agera ssom du hade gjort i verkligheten. Vrlden ska vara uppbyggd av realism och man ska alltid leva sig in till 100% i sin karaktr. Du ska se allting verkligt och inte gra orealistiska saker. r man osker ska man alltid tnka efter innan man agerar s det inte blir fel.\n\n\nVad r FailRP:\nFailRP r nr du gr ett ogiltigt rollspel. T,ex gr OOC mitt i ett scenario. Sger konstiga saker i ett visst sammanhang. Loggar ut nr du har dtt. Det mesta som bryter mot rollspels reglerna helt enkelt.\nFr att undvika FailRP ska man spela efter reglerna och anvnda sunt frnuft, ven g efter realism.\n\nVad r RDM:\nRDM r nr jag ddar en person helt utan anledning eller giltigt rollspel. \nEn vldigt simpel regel som br ge permaban direkt.\n\nVad r VDM:\nVDM r nr du anvnder ditt fordon som ett vapen mot ngon. T,ex kr ver personen s att den dr eller liknande. \n\nVad r FearRP:\nFearRP r att du ska agera rdd i livshotande situationer. Ditt liv r allt och du vill INTE d.\nKommer ngon med gun mot mig SKA jag agera rdd. Jag kan ocks bli hotad med annan form av vld och ska agera rdd. Det r en vldigt simpel regel om man tnker med sunt frnuft. I verkligheten hade du inte lekt maxad mot en kille som har pistol mot dig. Har du ingen vidare backup ser jag heller ingen realism med att \"hmnas\" p en person som har hotat dig till livet. Du ska f respekt fr personen d du riskerar att d. \n\nDet handlar ven om att du inte ska dra dig till skottlossningar, bankrn och andra brottsplatser bara fr att du r lite nyfiken. Utan istllet ska du avvika frn dessa platser d du r RDD att d.\n\nSmrta har ocks en del i det hela, kommer ngon med tazer mot mig SKA jag agera rdd och inte hlla p och jiddra vidare bara fr att det inte knns. I verkligheten hade det gjort fruktansvrt ont.\n\nVad r Powergaming:\nPowergaming r nr du fr fysiskt omjliga drag fr din karaktr. Ett exempel i era regler r:\n\"att du rollspelar att du bryter upp en lst drr med dina bara hnder\". \nDet kan ven vara att gra animations frn ingenstans. t,ex dra upp en lvblsare i fngelsecellen och sdant. Att jag sker igenom ngon utan vidare rollspel. Att jag som sjukvrdare revivar ngon utan att f svar och andra saker. \n\nVad r Metagaming:\nMetagaming r nr jag anvnder mig av OOC info IC. T,ex att jag fr reda p en sak i verkligheten, discord eller p en stream. Att jag sedan anvnder det till min karaktrs frdel r metagaming. Jag fr allts inte ta in ngot i min karaktr om han inte har hrt/sett det sjlv. Jag har heller ingen aning om vem ngon r ven om jag har sett hens stream 100 gnger. Allt du vet utanfr spelet stannar utanfr spelet helt enkelt.\n\nHar du spelat RP tidigare: (Svara med ja eller nej)\nJa. (600+ timmar)\n\nKnner du ngon som spelar p vran server just nu? (I s fall vem/vilka)\nJag knner Tage (Rezoh) och Arne (BAUZ). r dock redo p att ge mig in i rpandet ensam!\n\nOm du har svarat ja p ovanstende skriv d vart:\nAntar att detta r till \"Har du spelat RP tidigare\"\nJag har spelat en hel del p StadusRP, RevengeRoleplay, SwedishLawbreakers och SwedishHeavyRoleplay. Jag knner dock att jag vill dra upp mitt rpande p en nnu hgre niv!\nJag anser att jag ligger p vldigt hg niv men det r ven roligare att rpa med andra som r vldigt erfarna.\n\nBertta om din karaktr: (Minimum 400 ord)\nRickard r en social och trevlig kille p 23 r som precis har flyttat hemifrn, han har nu gett sig ut i livet fr att upptcka vrlden p ett annat stt n vad han gjort nr han bodde i sin lilla hemort med sin mamma och lillebror. Pappan dog i tidig lder och han stod Rickard vldigt nra, detta fick Rickard att tnka ver lallt och han vill gra sin pappa stolt i livet. Fr att leva i den nya staden mste Rickard socialisera sig med nytt folk och inom snar framtid skaffa ett jobb som passar honom. Han har sina funderingar och vet inte riktigt vad han vill bli nnu, dock lutar det mot ett mer statligt jobb som polis eller sjukvrdare. \nEftersom hans farfar var intresserad av bilar och han har ftt lra sig en hel del har han ven funderingar t det hllet. Som ni mrker r han vldigt bred t vilket hll han ska ta sig framt i livet och r vldigt ppen fr arbetsintervjuer och letar fr fullt efter tillflliga eller fasta tjnster p arbetsfrmedlingen. \n\nEftersom att Rickard r nyinflyttad r han vldigt social och trevlig person d han inte knner sig s kaxig nr han har flyttat in i en storstad frn en liten ort mitt i ingenstans. Han anstrnger sig s mycket som mjligt fr att passa in i det nya samhllet och frsker ven att hjlpa mnniskorna i staden s mycket han kan, vilket kanske inte alltid gr som planerat nr han r fr snll. \n\nRickard r en vldigt rligt person vilket inte alltid r till ngon frdel, han kan vldigt ofta rka frsga sig och det kan skapa mycket problem fr Rickard nr det gller tillit och vnskap. Problemet ligger inte i att Rickard r en dlig vn fr det r han, utan att han r vldigt dlig p hemligheter och det kan bidra till att hans vnner blir vldigt besvikna p honom. \n\nHan har ven ltt att lita p andra folk och r ganska lttlurad. Detta gr att han kan flja med p saker som han egentligen inte borde och drfr hamna i skiten. Detta r ngot Rickard skms otroligt mycket fr och han frsker numera tnka efter p vad han faktiskt hller p med i sna hr lgen. Innan han accepterar ngot tnker han efter en lngre stund pga tidigare hndelser.\n\nRickard finner en stor gldje till att kpa nya saker. Den dr underbara knslan nr ngot nytt r ditt, problemet r ju att denna knslan varar inte s lnge och han vill kpa nya saker. Det som hindrar honom r att pengarna inte alltid rcker till. Hans frsta ml i den nya staden r att f tag p en hyfsat billig fastighet och ngot slags fordon han kan transportera sig fram och tillbaka med.\n\n\n\nVilket yrke hade du tnkt ha p servern?\nJag har tnkt mig ngot lagligt yrke, har funderingar p polis eller mekaniker.\nr inte 100% sker nnu och vill se vart mitt rpande tar mig.\n\nVad kan du bidra till vrat community:\nJag kan bidra med hrligt roleplay i staden, kommer bidra med ett gott skratt och vara aktiv.\nKommer ven vara hjlpsam och trevlig bde i discorden och staden. r mycket frstende och har inga problem med att fra en dialog i normal samtalston och p ett moget stt. Driver ven min egna server men skulle hellre vilja slappna av och bara roleplaya. Sen jag startade med min server SwedishHeavyRoleplay har mina rollspelsegenskaper utvecklas oerhrt mycket och har ven ftt bredare kunskapsomrden inom rollspel och regler generellt. Ni kommer inte att ngra att ni tar in mig, jag kommer ven anpassa mitt rollspelande s som staden behver det.\n\n\nVad r din lder:\n15.\n\nOm en man kommer upp till dig och hotar dig med en pistol och vill ha dina pengar, hur skulle du agera: Jag skulle agera rdd som i vekliga livet, skulle ven gett ver alla kontanter jag hade p mig och lyssnat p allt han sa. Fr att utka scenariot p en serisare niv kommer jag att bli lite darrig i rsten och verkligen bete mig rdd.\n\n\nNr r det okej att g \"OOC\":\nDet r aldrig okej att g OOC, skulle ett failrp scenario uppst spelar jag klart scenariot och tar upp det senare med personen i discord. Eller admins OM ndvndigt.\n\nGr du med p att det kan ta tid att g igenom alla whitelist anskningar: (Svara med ja eller nej)\nAbsolut, frstr exakt hur det r.\n\nGr du med p vra regler: (Svara med ja eller nej)\nJa.\n\nVart hittar du vra regler och skriv lnken dit:\nhttps://forum.swedishfamily.net/threads/server-regler.518/\n\nGr du med p att respektera admins beslut: (Svara med ja eller nej)\nSjlvklart.\n\nSteamprofil lnk: (Hur man hittar sin Steamprofil lnk: hr) T.ex https://steamcommunity.com/id/john\n\n\nDiscord ID: (Hur du hittar ditt Discord ID: hr) T.ex: John#1234\nSwizzix#6410\n\nTwitch kanal (frivilligt):\n\n\nvrigt som kan vara vrt att tillgga: \nJag hoppas att min lder inte lgger allt fr stor vikt p min anskan d jag anser att jag hller en vldigt mogen niv bde skriftligt och rp-mssigt. Hoppas verkligen att ni vill ge mig en chans trots min lder.",
 "title": ""
}