{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_crack",
  "re_sql",
  "re_url",
  "kw_attacks",
  "kw_owned",
  "lg_en"
 ],
 "key": "pm2T2wfW",
 "pasteDate": "Feb 12, 2018, 2:00:12 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "<NO MERCY>\n\nName: Miyazaki Kaeda\n\nStage Name: Kae \n\nAge: 22\n\nBirthdate: 1st March, 1996\n\nNationality: Japanese \n\nBirthplace: Osaka, Japan\n\nHeight: 163cm\n\nWeight: 49kg\n\n<WARRIOR>\n\nPersonality:\nKaeda is an extremely sweet girl that gives off a motherly vibe, being very calming and kind. She isn't the type to be very excitable but can be energetic when she needs to be and is always seen smiling.\nShe can be a little shy at first but will always try to make it a point to at the very least, try to smile and say hi to others. However, once she opens up to new people, she can become extremely wild and give weird laughs that includes snorting and will tell really lame jokes and laugh at them.\nHowever, when Kaeda gets really attached to someone, she starts trusting that person with everything and would do anything to protect and help that person. She will cling desperately to the other party which some end up finding irritating, afraid of losing them like how she lost Yuta for a long year. \nHence, Kaeda is known to be very sensitive to others, always being able to tell how someone feels no matter how much they hide it, but is also always extremely sensitive of how others view and talk to/about her, getting extremely scared if she feels as though someone doesn't like her even if it was just a mild misunderstanding.\nShe hates any kind of conflict and is always trying to calmly resolve any feuds. However, she has extremely strong beliefs and will get very ticked off if anyone contests them, getting herself into a bicker.\nShe gets passionate about things very easily and will not stop obsessing over something after falling in love with it. For example, getting into fandoms/falling in love with new trends etc.\nShe is also relatively studious, working hard for things that she knows that she has to do well in and hates getting interrupted when she's trying to concentrate on something.\nKaeda is also extremely innocent, never understanding anything dirty, getting very confused and curious when someone tells a dirty joke or references something dirty. \nShe loves lame jokes and will immediately crack up, giving her weird, silent, wide-mouthed laugh, banging the table/clapping her hands together like a seal, snorting every now and then.\nShe is also an amazing cook and loves to cook for others as a form of relieving stress. However, she hates cleaning up and can get very lazy despite hating anything messy.\n\nBackground:\nKaeda was born into a loving family in Osaka that owned a traditional tea house which resulted in nurturing her calming side and love for cooking. \nShe has a younger brother, Miyazaki Kento, whom she loves and treasures to death and would be willing to do anything for him. However, because of how she had been alone for the first couple of years, she had stuck to her neighbour, Nakamoto Yuta, as their families were extremely close and he was the first person she had ever got to meet since birth.\nThey had been best friends since then and never left each other's side, Yuta being her pillar of strength, protecting and helping her through everything and Kaeda being his energy source as she continuously supported and cheered him on through anything.\nHowever, their paths started to diverge a little as Yuta grew more and more interested in the Kpop industry and started setting his eyes on getting accepted into a Kpop company while Kaeda was pretty confident that her family, being so traditional, wouldn't like it if she chose to follow suit.\nOne day, Yuta suggested trying out for the SM Auditions that would be held in Osaka that year. It took a few weeks of convincing before her family gave her their blessing to join Yuta at the auditions as they decided that Kaeda was probably not cut out for performing and would not get accepted nor like it anyways.\nAfter the auditions, Yuta had been accepted into SM while Kaeda was forced to decline her acceptance into SM because of her family. Despite that, Kaeda had started to realise how much she loved singing and wanted to continue being able to perform, which she was denied of doing. \nBeing forced to leave Yuta's side, Kaeda was extremely hurt and scared of what would become of her without Yuta by her side, starting to get mild panic attacks when she had to work with others.\nHer family got extremely worried about her mental wellbeing and came to their senses after Kaeda's younger brother talked them out of their traditional mindsets. \nA year after Yuta left Japan, Kaeda had been accepted into YG Entertainment and started packing her bags to leave too, this time with her family's full blessing. \n\nLikes:\n- Young Children\n- Animals\n- Anything cute/pretty\n- Cooking\n- Making tea\n- Sweet foods\n- Anime/Manga/Gaming\n- Disney \n- Being acknowledged by others\n- Green tea\n\nDislikes:\n- People whom smoke\n- Bullies\n- Being ignored\n- People that don't work hard/being interrupted by others when trying to concentrate on something important\n- People that constantly challenge/question her principles/what she believes in\n- People with bad mannerism\n- Anything scary\n- Messy places\n- Cleaning up\n- Coffee\n\nTrivia:\n- Is childhood friends with Nakamoto Yuta\n- Is a surprisingly good at gaming thanks to her practice with Yuta\n- Despite being close to Yuta, his love for sports had not rubbed off of her at all and she's actually extremely lazy\n- Owns 2 rabbits, a Holland Lop and a Netherland Dwarf\n- Is always mixing Japanese with Korean and vice versa\n- Is a hopeless romantic and loves watching shows, hoping that her future relationships would end up like in those stories\n- Has the weirdest laugh ever, laughing silently with her mouth wide open as she bangs the table and/or claps her hands like a seal, snorting at random moments\n- Despite looking so pure and is typically very easy going, Kaeda is actually very easily irritated but tries her best to suppress it every time \n- Her brother, Kento, is an Instagram star for his cute looks and aesthetics. However, Kaeda hardly ever tries to be aesthetic and only takes pictures when she thinks that it is an important moment\n- Is amazing at making traditional Japanese snacks/sweets like mochi, daifuku, takoyaki etc.\n- She begged her parents to teach her how to make takoyaki balls right after she discovered that is Yuta's favourite snack\n- Can never start the day/go to bed without a cup of good green tea\n\nHabits:\n- Leaving her favourite thing on her plate to the last so that she can \"taste it longer\"\n- Drinks green tea for breakfast and just before she goes to sleep\n- Will close her eyes and clench her hands tightly when waiting for results and is extremely worried about them\n- Puffs out her cheeks when thinking of how to solve a problem\n\nTalents:\n- Vocals\n- Is pretty decent with acting\n- Cooking\n\n<POWER>\n\nFace claim: APink's Eunji\nBackup: EXID's Solji\nBack backup: WJSN's Bona\n\nLove interest: NCT's Yuta\nBackup: ikon's Junhoe\nBack backup: Wanna One's Jisung\n\nRelationship: Childhood friends (Yuta)/Acquaintances (Junhoe)/ Idol-Fan relationship (Jisung)\n\nDo you know each other?: Yes (Yuta)/No (Junhoe)/No (Jisung)\n\nHow did y'all meet?: \nYuta -\nKaeda and Yuta's families were extremely close as they had been neighbours for a long time. Hence, when Yuta was born, both families celebrated his birth and when Kaeda was born a year later, they did the same and decided to allow the two to grow acquainted to each other so that they could help each other out and hopefully become close friends, which surprise, surprise, came true.\nAfter Yuta left for Korea, leaving Kaeda lonely and heartbroken, they meet again later in the streets of Korea after Kaeda gets accepted into YG and the two meet up regularly as well as contact each other a lot. They even help with each other's skill sets, Yuta helping Kaeda with her dancing and Kaeda helping Yuta with his vocals.\n\nJunhoe -\nSince ikon is from YG Entertainment, Kaeda and Junhoe first met at YG's lobby and she was dying a little bit inside, knowing that she was standing next to an idol. However, she did not notice that she wasn't keeping in her fangirling very well and got laughed at by Junhoe, giving the two of them a conversation starter, allowing them to become acquaintances and soon friends.\n\nJisung -\nKaeda had always been a huge fan of Produce 101 and biased Yoon Jisung. Ever since moving to Korea, she had been hoping and praying to be able to meet Jisung which she gets to later on when Yuta invites her backstage to one of NCT's musicbank showcases which Wanna One was at too.\n\n<SECRET LOVE>\n\nLine: Vocals\nBackup: Dance\nBack backup: Rap\n\nSelf evaluation:\nVisuals - 89/100\nRap - 31/100\nCharisma - 56/100\nDance - 74/100\nVocals - 98/100\n\nAudition videos:\nVocals -\nTender Rain from Soredemo Sekai Wa Utsukushii\nLink: https://youtu.be/pM7az6rWfnc\n\nDance -\nHunter, Choreography by Mina Myoung\nLink: https://youtu.be/osyrQJfo0i0\n\n<ONE SHOT>\n\nMessage to fans: \n\"Anneyonghaseyo~ Miyazaki Kaeda desu~ thank you all so much for supporting and sticking with me despite all my imperfections... I really hope to be able to grow my talent even more in this show and I really hope that you'll continue lending me your support as I work harder to improve myself! Thank you guys for everything~ daisuki!!\"\n\nMessage to MNet: \n\"Annyeonghaseyo, producer-nims! I really hope that you'll accept me into Produce 50. I promise to work my hardest to ensure that your efforts in this show will not be wasted! Thank you for this opportunity to showcase and nurture our talents! I'll work hard!\"\n\nMessage to other trainees: \"Annyeonghaseyo~ I really hope that we'll all work well together and support each other onto our road to stardom. Of course, I won't be giving in too easily either so let's all just do our best!! Gambatte!\"\n\nMessage to author:\nHi author-nim!! Thank you so much for creating this af X)) all the best for it and please do remember to rest well and not let this pull you down too much as it should just be a leisure activity for you, not a burden:')) atb author-nim!! Thank you X)))\n\nAnything extra:\nPassword - Yoon Jisuuuuung X')))",
 "title": "Produce 50 Survival AF | Crazymofo443's Form"
}