{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "PxVSJdwH",
 "pasteDate": "Feb 26, 2018, 10:59:20 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Left wing and  holy shit I thought that said Posadism and I got really excited\nso I already know this but bradley youre probably gonna read this since youre not here as Im writing it\nso basically the national assembly divided into reactionaries/monarchists and revolutionaries, and the revolutionaries stood on the kings left side while the reactionaries stood on his right side and thats why we have left wing and right wing today\nand even when they had a legislature the people who wanted change sat on the left and people who didnt or wanted to reverse change would sit on the right and losers would sit in the middle\njacobine republic  cool dudes\nMAXIMILIENROBESPIERRE FUCK YEAH\nGeorge danton\njean paul marat\nrevolution eats its own\nguillotined each other\nT H E R E C A N O N L Y B E O N E\nRobespierre dies \nforgot to write the date\nbut he did die so\nshit I havent been paying attention\nsomething about a guillotine\npainless?\nlouis xvi sentenced to guillotine\nAH CA IRA CA IRA CA IRA\nPlace de la Revolution/Place de la Concorde\nCommittee of Public Safety\nsome Orwellian shit\ngerondists\ncharged with orgies?\naight\ncharged with CHILD MOLESTATION\nkekd\nIf I have not replied, it is because nature itself refuses to respond to such a charge laid against a mother. I appeal to all mothers who may be present\nmarie antoinettes children went to prison one of them died of tuberculosis like a pussy\nbtw Bradley if you want to be cool and pronounce shit correctly say maximili-yeah ro-bess-pyeirr\ncult of the supreme being was robespierres cult\nbit of a weirdo I guess\nhe took dechristianization too far\nIMPOSSIBLE\nreligion is the opium of the people\nyoure goddamn right\nrobespierres arrest and execution ordered\nRobespierre tried to shoot himself but shattered his jaw\nloser\nafter the death of Robespierre the revolution became conservative\nreign of terror ends\nafter Robespierre directory takes over",
 "title": ""
}