{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_secure",
  "lg_en",
  "kw_bitcoin"
 ],
 "key": "Q0yaHvja",
 "pasteDate": "Feb 25, 2018, 10:02:36 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "    Bitcoin futures have been up and running for more than two months on Cboe Global Markets and CME, and already market participants are calling for a big shake-up in the market.\n    Numerous market participants are calling on exchanges to switch from cash settlement to physical settlement.\n    Such a change would require numerous players including exchanges and clearinghouses to upgrade their infrastructure.\n\n\nSome of the biggest players in the cryptocurrency market are calling for a shake-up in bitcoin futures trading.\n\nBitcoin futures started trading on Cboe Global Markets and CME in December and have been steadily growing since, with volumes for both markets at just under 10,000 contracts traded Wednesday, according to data from Bloomberg. At least 30 firms trade on Cboe, according to briefing documents from the exchange.\n\nBitcoin futures are cash-settled futures contracts. At the point of expiration, a trader will receive (or pay out) the difference between the price he or she bought the future at and the settlement price. In contrast, with physical settlement a trader takes ownership of bitcoin at the price established in the futures contract.\n\nThe cash-settled bitcoin futures market was seen as an attractive option for those looking to bet on the market without needing the infrastructure to handle the coin itself.\n\nBut now many top bitcoin traders, including B2C2, DRW, and DV Trading, are calling for the Cboe and CME to switch or add physical settlement. These firms, which also execute multimillion-dollar trades in the bitcoin market, were among the first participants in bitcoin futures and are active traders in the market.\n\nPricing for Cboe's contracts rely on the auction of a single exchange, whereas CME's contracts rely on a price index from four exchanges. The problem with this setup, opponents say, is that it could result in contracts settling at a price that doesn't reflect the most precise price of the coin.\n\n\"There are so many variables,\" John Lothian, a former trader and founder of the industry newsletter John Lothian News, told Business Insider.\n\n\"Each exchange shows different price levels, they operate in different countries, and are exposed to different regulatory risk,\" Lothian added.\n\nRichard Gorelick, the head of market structure at the trading firm DRW, which operates the crypto trading giant Cumberland, said during a meeting with the watchdog Commodity Futures Trading Commission earlier this month: \"We continue to have concerns that the way these futures contracts are pegged to these cash markets  which are less transparent  could result in dislocations in the future.\"\n\nPhysical settlement would also better facilitate an arbitrage trade, according to Garrett See of DV Chain, a cryptocurrency trading firm. If bitcoin is trading at a discount in the spot market relative to the futures market, a trader can go long bitcoin and short the future for a profit. See said:\n\n\"If they are physical delivery futures, then I know exactly what my P&L will be if I hold it to expiration. If they're cash settled, I have to make another trade to unwind the spot position at expiration and I have to hope that I can unwind my position at the expiration price (including fees) even though I may not have the ability to trade on the exchanges that are being used to determine settlement price.\"\n\nTo be sure, firms like Cumberland and DV Chain stand to benefit from such a setup more than firms that don't trade in bitcoin and are just speculating on bitcoin futures, CoinRoutes CEO Dave Weisberger said.\n\nStill, he said that \"if the arbitragers costs come down, spreads tighten and the markets get more efficient.\"\n\nIt's also unclear what, if anything, these firms will do if there's no switch to physical settlement. And the switch to physically settled futures would require the CME and Cboe to build out the necessary infrastructure, which is easier said than done.\n\n\"There's no mechanism for clearing physical delivery,\" one industry insider told Business Insider. \"Today's infrastructure does not yet support the clearing and custody of digital assets in a secure manner. Nor does it have the ability to facilitate simultaneous settlement of cash versus digital assets.\"\n\nMax Boonen, the founder of B2C2, a UK-based crypto market-making firm, supports a physical delivery model but also noted that such a settlement infrastructure would be difficult to implement.\n\n\"Basically the clearing houses and the FCMs/brokers would need a bitcoin infrastructure to transfer crypto,\" he said in an email to Business Insider.\n\nPhysically settled bitcoin futures would also need to get the green light from the Commodity Futures Trading Commission.\n\nA spokeswoman for CME told Business Insider that the exchange didn't \"have plans to introduce a physically settled contract.\"\n\n\"We are always talking with our customers to understand their risk-management needs as the marketplace evolves,\" she added.\n\nCboe didn't respond to messages seeking comment.",
 "title": "businessinsider_article"
}