{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_target",
  "re_url",
  "lg_en",
  "kw_security",
  "kw_attacks"
 ],
 "key": "q8kvzg3a",
 "pasteDate": "Feb 17, 2018, 7:26:29 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "I wanna be careful with how I word this, but:\n\nI want people to ask the real questions about why guns are legal in the US- it's not just because of some archaic bill of rights law. And most people aren't asking the right questions about that either.\n\nAsk why the founding fathers, coming on the back of a successful violent revolution, would include the right to bear arms?\n\n\"A well regulated militia being necessary to the security of a free state, the right of the people to keep and bear arms shall not be infringed.\"\n\nIt clearly doesn't imply that you would own a gun for specific personal safety, but defend your community and country from forces trying to infringe on your rights from both with-in it and outside of it. Which is very often, not the reason touted why anyone should own a gun, rather than protect yourself from say, an oppressive government, ala the British, or from foreign Invaders, ala Russia, who everyone fear suddenly, they want you to protect yourself from either lone wolf gunmen, or from \"criminals trying to harm you\", both of whom are just other civilians like yourself. So again, why would the founding fathers write the right the way they did, and why does pro-gun rhetoric frame it a different way.\n\nHowever, we see frequently that, lawmakers neglect rights of the people when it it beneficial to them, and a willingness to remove rights where they see fit. A look over at the increasing surveillance from places like the NSA etc in the post 9/11 world, that Americans will just give up rights if it makes them feel safer. And the right to gun ownership is no exception, as increasingly anti-gun sentiments grow in the wake of these attacks.\n\nSo then, if not because \"It's an American Right\", as we acknowledge that those come and go based on the sentiments of the populace and what are in lawmakers personal interest. 52% of people want stricter gun laws in America, based on a article by politico from 7/22/2017. And we acknowledge that more often than not, pro-gun rhetoric never specifies the point about a Militia, that the founding fathers included. So now we ask our next question: why would lawmakers only play lip service to gun reform, or oppose it full force, and if it is in their interests to do so, why is that? We can make some educated guesses, based on the Military budget in the United States. Based on 2016 numbers from wikipedia (https://en.wikipedia.org/wiki/List_of_countries_by_military_expenditures), we can see that our budget was approximately 3 times larger than that of the second place country's budget (China) and almost ten times that of the 3rd place Country (Russia). We can accurately assume that some of that money goes to weapons development, and we know that weapons development is primarily done by private contractors and private companies. In which case, why are lawmakers so interested in spending a large amount of money on the military, weapons etc.\n\nThis fact that private companies/contractors develop and manufacture weapons is far more interrelated to the gun debate than politicians themselves are. The NRA is often directly tied to these weapons manufacturers through membership. We obviously don't need to ask why gun manufacturers want guns legal- they make money off the American legal market. Instead, we should ask: If guns were to be outright banned, how would these corporations determine to make up that lost profit? They'd either need to pump more guns and push one of their other, already existing markets- we can make assumptions that this would be the Black Market and/or Terrorist/Rebel Militia Organizations across the globe; Governments, especially ones who have strong global military presence or are looking to expand their military presence; Police and Law Enforcement related groups; A new, yet untapped market, or lobbying to legalize gun ownership in the US or Abroad. And when we look at each of these options, we need to look at the long term effects such changes would have on those areas, and the world as a whole.\n\nSo ultimately, while I'm not expressly against gun reform, I think a lot of questions need to be asked, answered and examined. I do believe that the issue is a lot more complex because of the fact that people are not looking at these outside factors.\n\nTo recap:\n\n-Why did the founding fathers word the Right that way?\n-Why do people frame and interpret gun ownership around other factors, largely civilian threats, and not the way the writers of the Bill of Rights likely intended?\n\n-Why are Lawmakers so largely indifferent to gun reform, (speaking strictly on action taken)?\n-Why do lawmakers allow our Military budget to be so high, and in what ways could it possibly relate to guns being legal?\n\n-If guns are outlawed, where will gun manufacturers try to recoup that loss?\n-How will that shift in target market affect the world at large?",
 "title": ""
}