{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "QMeD2i7y",
 "pasteDate": "Feb 11, 2018, 9:26:51 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "(\"It's now or never\" Brett thought to himself. He managed to get a private lesson with Sylvia, their teacher, and his uncontested crush. He normally spent his nights fantasizing about it would like to be her, with her voluptuous creamy curves that offered rippling waves with every step she took and her volumes of wavy and wild dirty blonde hair tamed into a neat ponytail behind her head. Her voice was like, if colors were associated to tones, a creamy brown or even a deep and alluring purple, and she didn't even need to try to sound that way. On his way home yesterday, he had stumbled upon a muttering form of an old man who,  upon approach to see if he was in bed of any help, shoved a sealed glass vial and told him to drink that and a kiss would grant him his deepest desires. After drinking the bitter solution the next day, being today, he decided to try and give it a shot, organizing a private lesson with Ms. Cooper, as he thought the worst that could happen was he would get a kiss from the originator of his lust. \"H-hey Ms. Cooper? C-could you help me with this problem?\" He pleaded with a slightly quivering voice, anxious of the coming events that he was trying to put into action. She smiled and sauntered over to his lone desk and leaned over the front, her ample bosom squishing against the top of his binder and her face merely inches away from his own.* \"Of course~ Anything for my favorite student!\" *She cooed in the voice that reigned in leagues all it's own. The intoxicatingly sweet and flowery aroma of her perfume drove him over the edge as she looked down to his paper to see where he left off. His hands firmly clamped down on the sides of her face as he suddenly jettisoned his mouth to hers in an amateur's attempt at a kiss. In the sudden motion, flinging his chair back, he had caught her off guard, her freezing in place, eyes wide as her mind tried to catch up to the events that were occurring.*) \n(*Almost immediately soon after his kiss connected, he experienced a burning warmth throughout his stomach and chest that rose upwards towards his mouth, which he dismissed as nerves as he continued,  but suddenly the afflicted areas began bulge and contort the surfaces of his chest and abdomen as it continued to force it's way upwards into his throat. As the anomaly began to worm it's way into his mouth, his eyes began to roll into the back of his head, the mass now at his tongue. Without warning, it proceeded to shoot it's way into Sylvia's connected maw, causing violent choking noises and slight retching sounds to emanate from the unison of their lips.* \"Mmmppth?!\" *A noice eked its way out of their mouthes as she tried to free herself, she find she was unable to, Brett being surprisingly too strong for her as the escalated effort caused them to rotate and tumble in between the desk aisles, with Brett on top of her. As the substance continued to worm it's way from Brett into Sylvia, her throat stretched and contorted to permit its entry as it creeped further into her. Soon, the hands placed on her by Brett fell to the ground, his expression blank as he flopped upon the now convulsing Ms. Cooper. Her body wasn't responding to what she was telling it to do and the fear from the encroaching numbness alongside the pain was causing her eyes to water profusely as she flailed on the ground, the unknown entrant reaching her now-undulating core. Then suddenly, a stillness passed through her and an almost complete silence permeated the classroom, other than the quiet creaking, crackling, and shifting noises occurring from Sylvia's motionless frame.*)",
 "title": "Random Possession Story 1 (Part 1?)"
}