{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_scanner",
  "kw_down",
  "re_url"
 ],
 "key": "quCk2uRV",
 "pasteDate": "Feb 26, 2018, 1:12:41 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "I stand in affirmation of the resolution, Resolved: Science leaves no room for free will.\n\nId like to offer the following definitions to clarify the ground of this debate:\n\nFirst, as defined by Oxford English Dictionary, science is The intellectual and practical activity encompassing the systematic study of the structure and behaviour of the physical and natural world through observation and experiment.\n\nSecond, Doctor of Philosophy Kevin Timpe explains free will:  Minimally, to say that an agent has free will is to say that the agent has the capacity to choose his or her course of action. But animals seem to satisfy this criterion, and we typically think that only persons, and not animals, have free will. Let us then understand free will as the capacity unique to persons that allows them to control their actions.\n\nFree will entails that people have the true ability to choose between possible courses of action. It is important to note that this requires more than being presented with different choices. In order for free will to exist, a person must be able to choose between multiple actions in the face of equal historical conditions.\n\nAlfred Mele, Professor of Philosophy at Florida State, explains this requirement:\n\nIf you have free will, then alternative decisions must be open to you in a deep way upon which I will try to shed some light now. Sometimes, you would have made a different decision if the situation had been a bit different. For example, if you had been in a slightly better mood, you might have decided to donate $40 to a worthy cause instead of just $20. But this is not sufficient for the kind of openness at issue, something I call deep openness. What is needed is a plurality of options, given everything as it actually was at the time, including your mood, all your thoughts and feelings, your brain, your environment, and, indeed, the entire universe and its history. Having been able to have made a different decision if things had been a bit different is one thing; having been able to have made a different decision in the absence of any prior difference is another.\n\nGiven this interpretation, it follows that the affirmative burden will be to show that observations of the physical world suggest that our decisions are determined rather than free.\n\nThroughout this debate, the affirmative will show that three areas of science leave no room for free will: physics, biology, and psychology.\n\nMy first contention is that free will is incompatible with physical principles that govern the universe.\n\nBecause the universe is a closed system, every action is causally determined.  Professor Herman Horne from Cornell University goes on to describe how the physical properties of the world preclude the possibility of any action happening without prior determination. He writes,\n\n\nThis argument rests on the hypothesis of the conservation of physical energy. According to this hypothesis the sum total of physical energy in the world is a constant, subject to transformation from one form to another, as from heat to light, but not subject either to increase or diminution. This means that any movement of any body is entirely explicable in terms of antecedent physical conditions. This means that the deeds of the human body are mechanically caused by preceding conditions of body and brain without any reference whatsoever to the mind of the individual, to his intents and purposes. This means that the will of man is not one of the contributing causes to his action, that his action is physically determined in all respects. If a state of will, which is mental, caused an act of the body, which is physical, by so much would the physical energy of the world be increased, which is contrary to the hypothesis universally adopted by physicists.\n\nEvery action in the universe has a prior cause, and this is the foundation of our epistemology, or way that we gain knowledge about the world. While it may seem like our own experiences and intuition describe the physical world, it is actually the other way around - physics can explain both our actions and our experiences. \n\nProfessor Horne continues,\n\nThe law of causation is one which no man would care to deny; it simply and undeniably asserts that every effect has its cause. No one indeed can think otherwise. Causation, in fact, as Kant showed, is one of the ways in which we must think; it is, as he says, an a priori form of thought; we did not learn from experience to think causally, but rather by thinking causally we help to constitute experience. The mind does not so much experience cause as cause experience. Upon this basis the argument for determinism proceeds as follows: Like effects have like causes, the effect is like the cause, the effect is in fact the cause transformed. as the lightning is the effect of the preceding electrical conditions. Now human action is of course a physical effect; hence we must expect to find only a physical cause; hence any nonphysical, psychical cause is from the nature of the case precluded, hence of course the human will effects nothing. The actions of a man, a dog, a tree, a stone, all are due alike to antecedent physical conditions which alone as causes determine the effects. We no longer explain the lightning in physical terms as the bolts of Jove, no more should we explain a man s deeds by reference to the intention of his soul.\n\nLaws of physics clearly show that scientific principles leave no room for free will because every action is determined by a cause, not freely chosen.\n\nContention 2: Biology is inconsistent with free will. \n\nProfessor of Physiology at the University of Oxford, Colin Blakemore, describes the tension between science and freedom, writing: \n\nAll our actions are products of the activity of our brains.  It seems to me to make[s] no sense (in scientific terms) to try to distinguish sharply between acts that result from conscious intention and those that are pure reflexes or that are caused by disease or damage to the brain.  We feel ourselves, usually, to be in control of our actions, but that feeling is itself a product of the brain, whose machinery has been designed., on the basis of its functional utility, by means of natural selection. The sense of will is an invention of the brain.  Like so much of what the brain does, the feeling of choice is a mental model  a plausible account of how we act, which tells us no more about how decisions are really taken in the brain than our perception of the world tells us about the computations involved in deriving it.  To choose a spouse, a job, a religious creed - or even to choose to rob a bank - is the peak of a causal chain that runs back to the origin of life and down to the nature of atoms and molecules.\n\nAny negative arguments about how we intuitively know that we are able to choose freely between different actions needs to take into account Blakemores idea that our perception of free will is an illusion created by mechanics in our brain. \n\nKerri Smith, of the scientific journal Nature, describes a neuroscientific study that provides empirical support for this idea: \n\nThe experiment helped to change John-Dylan Haynes's outlook on life. In 2007, Haynes, a neuroscientist at the Bernstein Center for Computational Neuroscience in Berlin, put people into a brain scanner in which a display screen flashed a succession of random letters. [and] told them to press a button with either their right or left index fingers whenever they felt the urge, and to remember the letter that was showing on the screen when they made the decision. The experiment used functional magnetic resonance imaging (fMRI) to reveal brain activity in real time as the volunteers chose to use their right or left hands. The results were quite a surprise. The conscious decision to push the button was made about a second before the actual act, but the team discovered that a pattern of brain activity seemed to predict[ed] that decision by as many as seven seconds. Long before the subjects were even aware of making a choice, it seems, their brains had already decided. As humans, we like to think that our decisions are under our conscious control  that we have free will. Philosophers have debated that concept for centuries, and now Haynes and other experimental neuroscientists are raising a new challenge. They argue that consciousness of a decision may be a mere biochemical afterthought, with no influence whatsoever on a person's actions. According to this logic, [, free will is an illusion. \"We feel we choose, but we don't,\" says Patrick Haggard, a neuroscientist at University College London.\n\nContention 3: The scientific discipline of psychology leaves no room for free will.\nDoctor Raj Raghunathan from New York University describes how our actions are determined by a combination of our nature and our nurture, meaning that there are factors that leave us unable to freely make choices.\nRaj Raghunathan. PhD. From New York University. Psychology Today. 2012. https://www.psychologytoday.com/blog/sapient-nature/201205/free-will-is-illusion-so-what\nIf you think carefully about any decision you have made in the past, you will recognize that all of them were ultimately based on similargenetic or socialinputs to which you had been exposed. And you will also discover that you had no control over these inputs, which means that you had no free will in taking the decisions you did. For instance, you had no choice in where, to whom, and in what period of time, you were born. You also had no choice in the kind of neighbors and friends to whom you were exposed during early childhood. You therefore had no choice in how you made your decisions during that time. It might seem, at first blush, that many of the decisions you made laterduring late childhood or adolescencewere based on free will, but that is not the case. The decisions you made during late childhood and adolescence were based on the tastes, opinions, and attitudes you had developed in your early childhood, and on those to which you were exposed through your family, friends, media, or the natural environment. And so on, which means that the decisions you now make are based on the tastes, opinions and attitudes you have developed over the years or on those to which you are now exposed through contact with the external environment. Looked at in this light, belief in free will is itself a consequence of genetic and social inputs: without the development of the neocortex and without exposure to the idea of free will from societal inputs, we wouldn't believe in free will.\nIf every action is determined by our prior experiences, we do not have the ability to truly choose between actions. The negative may try to argue that nature and nurture merely influence our range of actions rather than determine them; however, remember that the negatives burden is to show that under the exact same circumstances, we would have the ability to make a different decision. \nFinally, if determinism isnt true, then indeterminism is true, and we still have no free will\nColin McGinn, philosopher from the University of Oxford, explains: \n\n\nThe argument is exceedingly familiar, and runs as follows. Either determinism is true or it is not. If it is true, then all our chosen actions are uniquely necessitated by prior states of the world., just like every other event. But then it cannot be the case that we could have acted otherwise, since this would require a possibility determinism rules out. Once the initial conditions are set and the laws fixed, causality excludes genuine freedom. On the other hand, if indeterminism is true, then, though things could have happened otherwise, it is not the case that we could have chosen otherwise, since a merely random event is no kind of free choice. That some events occur causelessly, or are not subject to law, or only to probabilistic law, is not sufficient for those events to be free choices.\nThus one horn of the dilemma represents choices as predetermined happenings in a predictable causal sequence, while the other construes them as inexplicable lurches to which the universe is randomly prone. Neither alternative supplies what the notion of free will requires,, and no other alternative suggests itself. Therefore freedom is not possible in any kind of possible world. The concept contains the seeds of its own destruction.\n\nBecause science leaves no room for free will, I affirm.",
 "title": ""
}