{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "r7zukmy9",
 "pasteDate": "Feb 8, 2018, 3:17:19 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "As a passionate Google user, I was thrilled to see your posting for a software engineer position in Sydney. I am confident I can help with Google's upcoming challenges. I have experience with big software projects, coming from having worked the last year and a half on a project where about 90M are moved yearly, in France. \n\nThroughout my career, I have been part of several projects, from which I would like to emphasise an internship I made in European Space Agency (ESA), where I developed a new platform that aimed to strengthen the cross support between space agencies, more specifically between ESA and NASA, and having been a member of a fast growing Swedish startup, AdFenix AB, where I was involved in the day-to-day of the company and had the opportunity to code using Starcounter, a in-memory technology that allows developers to code high performance applications without the need of glue code. \n\nI have always wanted to contribute to something that truly matters, rather than to fill up the pockets of some greedy CEO. Google would provide me with that opportunity, by working in projects that impact the way we evolve as a species, like \"organising the worlds information and make it universally accessible and useful\" impacted our world by being a huge step towards achieving freedom of press worldwide. Moreover, by working in Google I would be working with the world's brightest minds, which would be perfect for my personal growth. \n\nLiving in Australia is a goal I have since few years, therefore being selected for this job offer in Sydney would allow me to kill two birds with one stone. From the professional point of view, because the salaries are high, there are plenty of opportunities and extensive resource reserves, which attracts investment and keeps Australia's economy booming, even in times of global financial crisis. Furthermore, it has a reputation of having a great work environment, coming probably from the friendliness of Australians. From the cultural point of view, because Australia is a true melting pot, and I really enjoy being surrounded by people from different backgrounds and with distinct traditions. In addition to that, the official language in Australia is English, and living in a country where English is a native language is also a personal goal I want to attain. Lastly, the good weather, the unique fauna, and the fairly unexplored nature of Australia were also important elements in my decision to move there. \n\nI would be pleased to have the opportunity to be interviewed by you, and therefore have a chance to prove my value and fulfil a dream: being hired by Google.\n\nKind regards,\nCelso Coutinho",
 "title": ""
}