{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_es"
 ],
 "key": "Rcdv3fw7",
 "pasteDate": "Feb 8, 2018, 2:27:51 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "QUE SE NECESITA REALMENTE PARA QUE COLOMBIA SE CONVIERTA EN OTRA VENEZUELA SI PETRO LLEGA A SER PRESIDENTE DE COLOMBIA?\n(Felix Rafael Carrillo Hinojosa)\n\nEn primer lugar, no hay en el mundo Nacin que sea exactamente igual a otra. Segundo, Petro va a gobernar inicialmente solo por cuatro (4) aos y no por 19 como s lo lleva haciendo el Chavismo. Al trmino de esos cuatro aos, si decide reelegirse, deber volver a competir con los mismos con las mismas, con los partidos polticos tradicionales y derrotarlos nuevamente en las urnas.\n\nPara que Colombia se convierta en otra Venezuela, se necesita que Petro sea chofer de bus, que nunca haya pasado por una universidad y que no tenga ni puta idea de cmo funciona la economa Usted ha visto en algn debate o en alguna entrevista que Petro sea igual de ignorante que Maduro? Saba usted que Gustavo Petro es economista de la Universidad Externado de Colombia? En eso nos parecemos a Venezuela? En eso se parece Petro a Nicols Maduro?\n\nPara que Colombia se convierta en otra Venezuela, Petro deber tramitar ante el Congreso de mayora opositora un referendo para que exista en la Constitucin Poltica de Colombia la reeleccin indefinida. Usted si cree que el Centro Democrtico, el Partido de la U, Cambio Radical, el Partido Liberal o el Conservador le van a tramitar semejante proyecto a Petro en el Congreso?\n\nPara que Petro se anime a tramitar un referendo en el Congreso con la finalidad de hacerse reelegir indefinidamente, lo primero que tiene que hacer es GOBERNAR IMPECABLEMENTE BIEN durante su primer mandato. De que tenga las ganas de hacerlo si lo creo pero pregntese Si se lo permitir el Congreso de mayora opositora?\n\nQu es lo que creo yo? Que Petro no lo va hacer impecablemente bien, de uno a diez va a tener una calificacin de seis raspao (aceptable) por la tremenda oposicin que tendr, pero al menos considero que si se dar un cambio positivo en la calidad de vida del grueso de los colombianos durante los primeros cuatro aos en materia de salud, educacin, empleo, disminucin de la corrupcin y paz. Grbese una cosa: si la gente no ve al trmino de su primer mandato un cambio significativo en estos cinco ejes, nadie lo va a volver a apoyar, incluyndome.\n\nPor otra parte, para que Colombia se convierta en otra Venezuela, nuestro pas debe tener actualmente una riqueza inmensa de petrleo como el vecino pas y obtener enormes ingresos por este concepto. Haga el ejercicio mental: Tenemos la misma riqueza de Venezuela? Tenemos actualmente enormes ingresos? Si usted es de los que cree que s tenemos esa riqueza que nos genera grandes ingresos Para qu se hizo entonces la reforma tributaria del 2016? Si no sabe la respuesta, investigue.\n\nPara que Colombia se convierta en otra Venezuela, nuestro pas debe importar el 50% de los alimentos que consumimos. Actualmente no importamos esa cantidad pero s importamos el 30% Y esta situacin se debe gracias a quin? A los gobiernos castrochavistas de Santos, de Uribe hasta llegar a Gaviria quienes acabaron con esta parte de la produccin nacional. Qu con Gustavo Petro podemos llegar a estar como Venezuela y pasar a importar el 50% de los alimentos? Y cmo? Dnde est esa plata para comprarla? Acaso una de las propuestas de Petro no es impulsar la agroindustria nacional para revertir la actual situacin de estar importando gran parte de nuestra comida? La idea central de Petro es pasar de una economa rentista (como consecuencia del petrleo) como lo es actualmente Venezuela a una economa productiva Cmo podemos llegar a ser como Venezuela si no tenemos la misma riqueza y si vamos en direccin contraria con el modelo econmico?\n\nInsisto, si Colombia desea ser como Venezuela debe elegir a un presidente cuyo eje siga siendo el mismo: la economa rentista y Petro no propone eso. Tambin se necesita que Petro sea igual de ignorante que Nicols Maduro, que cada vez que salga a declarar algo en los medios se la pase diciendo burradas Usted ha visto que Petro dice burradas? Al contrario, ese el temor que tienen los Uribes, los Santos, los Vargas Lleras y toda esa rosca poltica, de que alguien inteligente que conozca sus fechoras llegue al poder y empiece a meterlos a todos a la crcel tal cul como lo hizo cuando fue senador y ayud a condenar a varios congresistas y funcionarios del Estado por parapoltica y corrupcin. Ese es el verdadero miedo de los que se oponen a que Petro llegue al poder, de que destape las ollas podridas de las que todos los colombianos estamos cansados.\n\nNo siga permitiendo que otro piense y decida por usted. Antes de repetir lo que otros dicen, reglese la oportunidad de investigar y analizar bien los hechos.No lo invito a que vote por Petro (eso me queda mal), lo invito a algo mejor: a que investigue, coteje, analice y cruce informacin por su cuenta acerca de la verdadera historia econmica y poltica de Colombia. Si lo hace, de seguro tendr una visin diferente.",
 "title": "QUE SE NECESITA REALMENTE PARA QUE COLOMBIA SE CONVIERTA EN"
}