{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_threat",
  "kw_security",
  "kw_shut",
  "kw_target",
  "lg_en",
  "kw_cracked"
 ],
 "key": "Sf4GZiwF",
 "pasteDate": "Feb 28, 2018, 3:55:57 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Dai Kaiju (Pluro) - Today at 12:33 PM\nPluro would follow him out of the room, there was no need to stand on ceremony so once Jason was prepared Pluro would make himself clear. \n\n\"It Is my job to ensure crew safety, that being said Jules Is a special case, she's able to make her own decisions as are you. I will not make moves to force anything upon you, but I will be greately displeased If masses of darker shaded individuals catch wind of her. Certain job hazards increase such odds, such jobs often follow at your heels.\"\n\nDuase - Today at 12:39 PM\nJason nods his head sagely. One minute, he threatens to kill him, and the next he says that his job is to ensure crew safety. There is a contradiction here. \"So this is about Jules,\" he says, realising. \"It's obvious that you care about her. But clearly you know something that I don't.\"\n\nDai Kaiju (Pluro) - Today at 1:05 PM\nIn truth he never threatened to kill him, he just Is very casual with his capability of doing such. For him such Is an honest way to talk. \"I know much that you don't, In fact Burp likely knows more than you do on such matters. Jules' well being Is of great interest to me, and things that negatively effect such must be addressed.\"\n\nDuase - Today at 1:16 PM\n\"I understand that you don't want to have her in danger,\" Jason says in a level tone. He doesn't exactly know why Pluro feels how he does. \"But if her wellbeing is important to you then perhaps you should know that she's miserable. She feels like she has very little control in her life, especially since she can't go anywhere on her own now,\" Jason tells him. \"She was grateful for even the smallest thing I could give her to do, which is honestly a little upsetting.\"\n\nJason frowns. \"Look, I'm not trying to seduce her into becoming a secret agent side-kick. I'm offering her the means and support for her to self-determine her way towards pursuing her dreams. You can blame me for it all you want, but the truth is you're not going to get anywhere unless you speak to Jules directly. I'm not going to let you bully me into abandoning somebody who wants my help. And the fact you'd kill me over it speaks volumes about you, Pluro.\"\n\nDai Kaiju (Pluro) - Today at 1:24 PM\n\"You make a lot of assumptions, amusingly so, I'd kill you to ensure she Is safe yes, but you're not special In that regard. I will make things clear, one, I have spoken with her and am happy that she Is looking to gather experience and grow, two, I have yet to say that I do not want you to interact with her at all you are projecting heavily. Three, I have yet to blame you for any of the troubles that follow Jules In fact I've done nothing but compromise and be calm with you this entire time.\" \n\nPluro would shake his jaws and let out a soft rumble, \"My actions speak clearly of my purpose here, I've been nothing but civil, and just to note the skinning discussion wasn't a threat I spent a long time working with a tanner on Vesk 3.\"\n\nDuase - Today at 1:28 PM\nJason nods and smiles. \"Oh, I see. So you weren't trying to intimidate me? I guess we're on the same page, then.\"\n\nDai Kaiju (Pluro) - Today at 1:30 PM\n\"If you were intimidated It's likely because I am reptilian and large, If I wanted to intimidate you I'd do things such-\" his jaws lunged forward  and cracked  shut a good 3 feet above his head, no true threat of contact a clear demonstration, \"As that.\" He'd rumble as he retracted his jaws and returned back to his calm position. \"Your ancestors learned quickly to not get too close, something that social interaction changes at times.\"\n\nDuase - Today at 1:36 PM\nJason watches him, and folds his arms and shakes his head, evidently not impressed. \"You don't scare me -- stop embarrassing yourself,\" Jason says. \n\n\"For the head of security, you inspire zero confidence in personal safety.\" He looks just about done with this.\n\nDai Kaiju (Pluro) - Today at 1:52 PM\n\"The intent was demonstration of  what It would look like and I don't need your approval, I have kept this ship safe and my records and paper reflect such. And If you wish to speak of my actions during that incident regarding Jules, she was the clear target, verbal and motive so I took what steps were need.\" \n\nHe'd clear his throat and lightly flared his nostrils. \"I attempted to alert the ship, such was counteracted, I then had to free myself and get to a place where I could counteract the threat, I know my job Mr. Conway, and I've done It well.\" He had and given that he had to deal with a series of people who loved pulling strings In he back ground he'd done his best to be clear and honest. If they ignored such that was on them.\n\nDuase - Today at 2:00 PM\n\"Threatening the lives of crew members and blatant attempts to intimidate crew members are not what constitutes the job description of a security head,\" he says. \"For somebody who's made their claim from being a good leader, you clearly have no respect for the people you're protecting, to the point where you've gone ahead and made the feeling mutual. I offer you nothing but patience and respect, and you shit all over it.\" He huffs, turning around, waving a hand dismissively as he walks away. \"We're done.\"\n\nDai Kaiju (Pluro) - Today at 2:09 PM\nPluro would watch him go and chuckled softly, this was the burden of dealing with folk like Jason, they don't see themselves as causing issues. He wouldn't have to make threats If Jason was such a shady fuck, amusingly it was only people who were likely to cause trouble that he needed to go out of his way to speak to, and these were the people to nip back like this, he was happy with how the calmer crew were working, being disrespected by poisoned silver tongues was no skin off his tail.",
 "title": ""
}