{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_exploits",
  "lg_en",
  "kw_bug"
 ],
 "key": "sNrSeqBK",
 "pasteDate": "Feb 23, 2018, 10:49:50 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "<size=125%><b>Workshop</b><size=100%>\nAdded workshop support. This first workshop support, only support hit/shot sounds.\nBut in the future a lot more things will have workshop support.\nYou can upload to the workshop by downloading \"Aimtastic Workshop Tools\" under the tools menu on Steam.\nI'm looking forward seeing your content.\n\n<size=125%><b>Wizards</b><size=100%>\nAdded wizards. Wizards are an easy way to convert your settings from different games to Aimtastic.\nAll you need to do is enter the settings from the game you want to convert from, then it automatically set your FOV and sensitivity and other settings to correct values.\nCurrently it only supports Overwatch, Counter-Strike: Global Offensive, and PlayerUnknown's Battlegrounds. But a lot more games are coming in future updates.\n\n<size=125%><b>Presets</b><size=100%>\nAdded settings presets for room settings. Got your favorite settings for your warmup routine.\nNow you can easily save them, so you don't have to re-enter the settings every time you launch the game.\n\n<size=125%><b>UI</b><size=100%>\nBig UI rework, that is gonna let me make bigger changes faster.\nI rewrote the while UI, the old way didn't let me make changes as fast as I wanted, and had some performance issues.\n\n<size=125%><b>Sensitivity</b><size=100%>\nIt now saves sensitivity as CSGO/Source/Quake sensitivity instead of unity. It's gonna automaticly convert your settings, so don't worry about your settings being wrong.\nThis is more to make it easier for people to convert sensitivity, and make sensitivity bit less confusing for people.\nBut what games really needs is a set standard on how mouse sensitivity work, so you don't have to use third-party sites every time you want to transfer your sensitivity to another game.\n\n\n<size=125%><b>Patch notes:</b><size=100%>\n\n[Left To Right] Lowered the penalty for missing to 200, to keep it inline with Reflex.\n[Skeet Shooting] Now shows pop-up scores.\n[Assault Course] Fixed exploits. Also wiped the scores, since it was mainly full of exploiters.\n[Game] Fixed bug where you couldn't shoot if you aimed at the sky.\n[Game] Fixed so the game doesn't freak out if you tab out while loading the game.\n[Graphics] Improved the floor texture.\n[Player] The player have been on a diet. Lowered player collision radius to 0.4m.\n[Player] Fixed bug where player could fall through the floor when going up ramps.\n[Audio] Fixed bug where having hit sound off also turned off shot sound. (Thanks Mac McLovin)\n[UI] Added a main menu.\n[UI] No longer render the crosshair if crosshair length is 0.\n[UI] No longer render crosshair dot if size is 0.\n[UI] Fixed bug where crosshair preview was visible even when you didn't have settings open.\n[UI] It now shows what room you are in when you have room settings open.\n[UI] No longer show presets and room settings if the room have no room settings.\n[UI] You now see all your friends high scores instead of just top 10.\n[Settings] You can now toggle full screen.\n[Settings] Added hitmarker options.\n[Settings] Added support for loading a static image as a crosshair.\n[Settings] Changed max allowed fps to 500.\n[Settings] You now hear a preview of the selected hit/shot sound when you change it.\n[Settings] Added brightness option.\n[Settings] Added temperature option.\n[Settings] Added tint option.\n[Settings] Added hue shift option.\n[Settings] Added saturation option.\n[Settings] Added contrast option.\n\n\n<size=125%><b>Known issues:</b><size=100%>\nCan't delete presets.\nNeed to restart game for new subscribed workshop items to load in.\nPlayer sometimes get stuck on ramps.\nTwitter feed is missing.\nWhen opening the settings for the first time, you hear the shot/hit sound.",
 "title": ""
}