{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "SS4GbQj6",
 "pasteDate": "Feb 17, 2018, 4:15:07 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "In this presentation, I am going to talk about which state, and town Im living in, myself, family, friends, school and what I do in my spare time. At last, different things about Potsdam.\nHi, my name is Alfred, and I am 16 years old. I live alone in Potsdam, but my family lives very close, so I can go to them whenever I want. I have 1 sibling. Her name is Alexandra. She lives with her parents, because shes 12 years. My dads name is Arthur, and my moms is Anne. \nI got 4 friends Im with all the time. Anton, Boris and Bianka. These are my three best friends.\nIn my spare time, I love reading, its one of the things I love the most. Second thing I love doing is petting my kitten. Shes only a 1 old. \nEnough about my family, and about myself, Im going to tell you a bit about Potsdam. In Potsdam, you can do many different things to do, especially if anybody wants to come check my town out. \nMost of Potsdam were built in the early 18-hundreds, so most of the buildings were and still are very old. \nAfter the allied bombing ended in second world war, Potsdam were in heavily damaged. This was the cause of many of the old, buildings being destroyed. In fact, it has one of the most beautiful castles in the world, which in my opinion, is a thing you want to see. A castle I really recommend, is the Sanssouci Park.\nPotsdam is the capital in the state Brandenburg. Its not a part of the city of Berlin even though its 24 kilometers away. Thats not all, Potsdam is in the north-east district and not opposite. \nOne of the last things I want to tell about Potsdam, is that it has a very popular dutch district. The reason for this is because a lot of people in the early eighteenth century were from the Netherlands, and it attracted its population.\nLast thing about Potsdam is: it has 163 668 residents.",
 "title": ""
}