{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_pl"
 ],
 "key": "swUU2nZE",
 "pasteDate": "Feb 20, 2018, 4:56:33 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": " 1. Blondynka 10/10 poprosia mnie, abym przyszed do jej domu, bo jej rodzice wyjechali a sama boi si drzewa za oknem. Przyjechaem, przyciem gazie, eby nie szuray o okno. Usiadem na kanapie, eby wypi lemoniad, ktr mi zaoferowaa. Siada przy mnie i mwi: Bardzo mikka poduszka, no nie? Jak mylisz, co jest bardziej mikkie  poduszka czy moje cycki?\nJa: Pewnie poduszka, nie ma niczego mikszego od puchu.\nOna: Bardzo dzikuj za pomoc z drzewem, czy mog si w jakikolwiek sposb odwdziczy?\nJa: Nie ma za co, to bya drobnostka\nWypiem lemoniad, wrciem do domu i graem w pasjansa pajka przez 3 godziny.\n\n2. Pierwsza noc w akademiku, laska z pokoju obok mnie mwi: W kocu noc bez rodzicw, mogabym spdzi ca noc u ciebie albo ty u mnie jeli chcesz i moi rodzice si nie dowiedz.\nJa: Brzmi interesujco, nie mylaem tak o tym.\nPoszlimy razem na imprez, wracalimy do domu okoo drugiej w nocy. Jestem w jej pokoju, ona gryzie swj kciuk i mwi: Wiem, e to zy nawyk, ale jak jestem pijana potrzebuj czego do possania.\nJa: Niedobrze, z czasem zrobi ci si krzywy zgryz. Sprbuj soku z cytryny, syszaem, e hamuje chci.\nOna: Nie martw si, ju przeszy.\nJa: Jeli wrc, sok z cytryny\n\n3. Wprowadziem si do nowego mieszkania, wspomniaem w pracy, e bardzo fajne miejsce, ale nudzi mi si, bo podcz mi kablwk dopiero za kilka dni. adna laska przypadkiem podsuchaa i powiedziaa: Na pewno znalazoby si co fajnego, masz ju jakie meble, na przykad kanap, ko?\nJa: Ta, mam dwie kanapy i nowe ko, ktre przywieli mi wczoraj.\nOna: Jeli nie masz planw na wieczr, mog wpa do ciebie i sprawdzimy, czy spryny w twoim ku s sprawne.\nJa: Nie trzeba! Kupiem prosto ze sklepu, jeli co jest zepsute to gwarancja to pokryje.\n\n4. Ta sama laska tydzie pniej przyniosa mi domowy obiad, bo taki jest najsmaczniejszy, a wie, e kupienie wszystkich potrzebnych rzeczy do kuchni chwil zajmie.\nJa: Racja, tego potrzebowaem.\nPniej tego dnia zaprosiem j do siebie, bo zaoferowaa, e ugotuje obiad u mnie. Pojawia si z arciem na wynos i butelk wina.\nJa: Mylaem, e miaa gotowa obiad?\nOna: Nie miaam czasu kupi wszystkiego, czego potrzebuj, ale jeli chcesz, mog zrobi ci niadanie.\nJa: Nie musisz, i tak jem rano patki.\nUsiada na jednej z moich kanap, ja usiadem na drugiej, w drugim kcie pokoju.\nOna: Bdzie nam si atwiej rozmawiao jak usidziesz bliej  mwic to poklepaa swoje udo.\nJa: Nie przeszkadza mi to, ale jeli jest za gono dla ciebie to mog wyczy wentylator\nOna: Trzeba byo mnie nie zaprasza, jeli masz by takim dupkiem.\nWysza i zabraa butelk wina ze sob. Nie wiedziaem wtedy co si stao i mylaem baby s dziwne.\n\n5. Domwka. Jestem zbyt pijany, eby prowadzi, wic gospodarz oferuje mi kim na kanapie. Super fajna dziewczyna, z ktr rozmawiaem jaki czas na imprezie te pyta, czy moe zosta. Gospodarz puszcza mi oczko i mwi jasne, tylko nie bdcie zbyt goni. Zaczem cieli kanap i mwi mam nadziej, e uda mi si zasn, bo zimno tu. Ona apie za moj rk, obraca si (tak, e moja rka obejmuje teraz jej tali) i mwi a, jeste gorcy.\nJa: Nom, mam wysok temperatur ciaa, obrazisz si, jeli wezm grubszy koc?\nOna: Moemy si podzieli.\nJa: Jeli chcesz to spoko. Dam rad te spa z cieszym kocem.\nPooylimy si na osobnych kanapach na okoo p godziny, po czym ona przypomniaa sobie, e ma co wanego do zrobienia rano i wysza. Cieszyem si, e bd mia oba koce dla siebie, bo byo mi dalej zimno.\n\n6. Bardzo, bardzo adna laska, z ktr przyjaniem si p roku mwi: Nie chc chopaka, po prostu chc regularnie uprawia seks z kim, przy kim czuj si bezpiecznie. Te tak masz?. Ja: Cay czas, w pracy poznaj tyle fajnych dziewczyn!\n\n7. Zaproszono mnie na grill / imprez w basenie. Z jedn lask przegadalimy cay dzie. Jestemy ju troch podpici w gorcej bali, ona topless. Jej nogi ocieraj si o moje, mwi: Wcz bbelki, to nikt nie bdzie wiedzia, co si dzieje pod wod. Ja: W kocu! Te cay czas trzymaa bka?\n\n8. Zastanawiaem si, czy nie zrobi sobie tatuau. Fajna dziewczyna z pracy powiedziaa mi, e te sobie chce zrobi i czy przeszkadzaoby mi, gdyby ze mn posza. Ja: No jasne e nie, przydaaby mi si dodatkowa rada. Zaraz pniej jeszcze jedna si wtrca: Musicie pj do xxxxxx, robiam u nich wszystkie tatuae i piercingi, poznam was z moj tatuaystk.\nTego weekendu zabraem je obie, poszlimy do salonu, ale tatuaystki akurat nie byo  zobaczyem jednak jej prace, zupenie nie spodobay mi si. Poszlimy wic zamast tego do baru, gorca laska opowiada o tatuaach i piercingach, pokazuje swoje piercingi na sutkach i mwi: Moecie ich dotkn, jeli chcecie. Druga mwi: Chciaabym takie, ale boj si, e bdzie bolao, na co gorca laska apie t drug pod bluzk i mwi: Nie boli a tak bardzo, poczujesz tylko mae uszczypnicie, wanie tak. No i podobne sytuacje przez cay wieczr. Pod koniec nocy gorca laska mwi, e chciaaby mi pokaza wszystkie piercingi, ale jej znajomy wanie przyjecha do miasta i e powinnimy powtrzy to za tydzie. Ja: Nie ma po co, aden tatua mi si nie spodoba w tym salonie.\nW kocu przespaem si z t drug, ale dopiero teraz zdaem sobie spraw z tego, co przegapiem.",
 "title": ""
}