{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_leak"
 ],
 "key": "T7wn0ET9",
 "pasteDate": "Feb 23, 2018, 1:10:12 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "####Why I'm making this appeal:\n\nHello, I'm making this unban appeal to regain access to the site after my ban of being toxic around the GModStore community, and leaking two authors scripts after the day I was banned. \n\nI have been suggested by a few friends of mine to make another attempt at making an Unban appeal, I would like to be unbanned because I would like to buy some more scripts from this, regain access to the ones I have purchased to use on a server of mine, and to in the future maybe submit some new scripts. I would also like to do a few jobs as well that people have made to help them out.\n\n####Why I was banned:\n\nI was banned for being toxic and rude around the GModStore forums, discord, and threatening to leak/chargeback as a joke. I now realise and realised after I did it how stupid of me it was to do that, I have apologized both to Threebow, CodeBlue, and have also apologized to Momox for being rude to him.\n\nI have realised how I was back then, being toxic and rude randomly for no reason, and have changed quite a lot since then. What will I do to make sure it won't happen again? I will not be involved in the community Forums or Discord as they were the main places where my toxicity was.\n\n####After I'm banned:\n\nAfter I'm banned, I'll be updating my scripts, as a few people have contacted me saying they're broken/or have some bugs. I would like to also use some scripts I have purchased on a server of mine I am developing, as well as taking a few GMod jobs. I have also been working on a few scripts over my spare time, which I might release/upload in a few months.\n\n####Other:\n\nI would also like to aplogize to the Moderator and Admin team, I was told earlier on stop being toxic, and was warned, and I failed to listen. I would like to aplogize for any hassle, and toxity I showed and did around the community.\n\nGModStore helped me fill my free time during my time at University, as well as earn some money for living, and I ruined that, and would like to start again/regain access to this site. My first ban appeal was denied, and I was told to wait six months, however six months is a long time for me, and I feel that I have changed,",
 "title": ""
}