{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_op",
  "lg_nl"
 ],
 "key": "t91jNPd7",
 "pasteDate": "Feb 20, 2018, 6:08:13 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Vandaag onze presetation gaat worden over de heer Luigi. Hij is getrouwd en hij heeft drie kinderen, ging hij naar de kleuterschool Rayo van solo toen ging hij naar de lagere school Filomena en hij woonde later Colegio Arubano, maar hij ging van school en ging naar Nederland en studeerde hij een hoge laboratorium opleiding en na & sk en studeerde hij later Organisatie Culturele en management. Zijn dromen was om een piloot te zijn, hij deed een test en de resultaten kwam naar buiten groot, maar hij ondervonden problemen. Hij kon niet studeren om piloot te worden, omdat hij de hoogte van hem. Hij besloot toen om zijn studie in Nederland voort te zetten.\nHij wilde een piloot te worden, want hij voelde zich vrij en goed toen hij in een vliegtuig en hij weet dat het kon worden wat hij lief doet als hij ouder wordt.\n\nNa dat hij niet wist wat hij wilde meer te worden, omdat de leiding die nu bestaan toen niet bestond. Hij uiteindelijk besloot om een test te doen beroepkeuze en de resultaten toonden aan dat hij graag werken met mensen en omwille van dat hij besloot om een leraar te zijn. De heer Luigi studeerde 4 jaar en dat is hoe hij om een leraar van de Organisatie Vaardigheden worden. De heer Luigi vond het werken met de kinderen, want de kinderen waren op weg naar een volwassen en hij begeleid de kinderen en liet hen de goede manier voor een goede toekomst. Naast zijn schoolloopbaan hij wil het lezen van boeken over pyschology en hij heeft zijn eigen team van honkbal. Een van zijn doel is te leren van de studenten hoe om dingen te bekijken vanuit een ander perspectief.\n\nEen van zijn doel is te leren van de studenten hoe om dingen te bekijken vanuit een ander perspectief. De heer Luigi had veel geduld als het gaat om onderwijs gaf hij de lessen met veel energie. En natuurlijk de kinderen moesten geven van hun kant om de lessen leuk te maken. Hij deed alles om de kinderen te helpen als ze niet begrijpt. We konden zien die ervoor zorgen dat hij altijd alles voor ons had klaar wanneer de lessen van de heer Luigi begint. Als docent is hij altijd gepland alles en hij had tijd voor om bij zijn familie en het geven van honkbal lessen en nog veel meer. Wat de leraar niet leuk is als zijn andere collega's behandelt de andere kinderen verkeerd. Vanwege die veel kinderen verliezen motivatie op school om verder te gaan studeren. Wat betreft de heer Luigi de manier waarop hij leert hij de voorkeur aan het doen zijn lessen met digitale voor een voorbeeld met computer en beamer.\n\n\nDe heer Luigi advies aan elke student is om te gaan voor wat je graag doet en nooit laat niemand lastig vallen of voor u bepalen wat u wilt doen in de toekomst, als u een danser een musicus of arts worden. Ga ervoor en geef nooit op. Laat nooit een droom van jou te gaan, tenzij je voltooien. In het leven zal er altijd verschillende obstakels die u demotiveren Om je dromen te laten uitkomen. Dat betekent dat nooit opgeven, als je passie voor iets je zult het bereiken!",
 "title": ""
}