{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_evil",
  "lg_en"
 ],
 "key": "TDdfWF4A",
 "pasteDate": "Feb 28, 2018, 1:22:30 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "`\nDafi bends forward and kisses a square altar.\nDafi looks up and sighs, smiling.\n>\nDafi removes a twisted gold prayer bead chain interspersed with faceted light amber beads from her wrist.\n>\nDafi clutches a twisted gold prayer bead chain interspersed with faceted light amber beads in her hand and closes her eyes in meditation.\n>\nA teak wolf bead on Dafi's prayer bead chain begins to glow faintly as she continues to meditate.\n\nA teak wolf bead suddenly detaches from Dafi's prayer bead chain, spinning eerily in midair as it continues to set off a soft silver glow.\n>\nA teak wolf bead slowly spins in the air.\n>\nThe pale glow shrouding a teak wolf bead brightens as its speed increases, spinning in midair.\n>\nDafi attaches an empty twisted gold prayer bead chain interspersed with faceted light amber beads to her wrist.\n>\nDafi lifts her voice in praise of the gods, reciting for all to hear:\n\n     \"Phelim, give me strength for my righteous vengeance\n     Chadatru, guide my sword to swing in justice\n     Everild, give me the power to conquer my enemies\n     Truffenyi, let me not lose sight of compassion and mercy\n     Else, I will become like those I despise\n     Urrem'tier, receive into your fetid grasp these wicked souls\n     May the Tamsine's realms never know their evil ways again\"\n\nDafi looks up and sighs, smiling.\n>\nDafi gets a ceremonial prayer tome embedded with a trio of night diamonds from inside her suede cloak.\n>\nDafi opens her prayer tome.\n>\nDafi turns through the pages in her prayer tome.\n>\nDafi recites:\n\n    \"*Hodierna, Mild Mistress of Life*\"\n     A prayer by the holy poet Caedmon Descendens\n>\nDafi reads:\n\n    \"Hodierna, mild mistress of life, light, and morning,\n     Turn the dark face of Asketi away.\n     Favor your folk in their budding and borning,\n     Hasten the dawning that heralds the day.\n>\nA teak wolf bead spins rapidly, sending motes of silver-grey light cascading off of its surface!\n>\nDafi continues:\n\n    \"Strengthen our hands in the season of sowing,\n     Guide where to plant, where to prune or entwine.\n     Send showers for seedlings, your West Wind a-blowing,\n     Fill hives full of honey, set flowers on the vine.\n>\nA teak wolf bead suddenly explodes into a shower of silver-grey luminance!\nDafi looks up and sighs, smiling.\n>`",
 "title": ""
}