{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_es",
  "re_url",
  "kw_dos"
 ],
 "key": "tGTLKicE",
 "pasteDate": "Feb 8, 2018, 2:48:35 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "DIET.\nusername: anilikething\nslot: PACKET HERO\n\nDON'T BE SHY.\nnombre completo: Yoon Jihyun.\nstage name: Yumatsu.\nedad: 21 aos.\nfecha de nacimiento: 29-agosto-1996.\nlugar de nacimiento: Daegu, Corea del Sur.\nsangre: AB.\n\nGONDRY.\npersonalidad: Alegre, mimosa y sobre todo animada, tiene una apariencia que nada le afecta. Siempre crea momentos divertidos para recordar, tiene una manera de hacer sonreir a cualquier persona. Pero es un poco reservada, no cuenta sus problemas por lo tanto los guarda con una sonrisa, alegando que todo est bien. Por ser la maknae tiene una personalidad infantil que todos adoran y consideran adorable. Esta chica se adapta a cualquier ambiente y siempre hay buenos tratos con ella.\nbackground: Desde que tena cinco aos ha sido conocida como la pequea que muestra su sonrisa, sus padres orgullosos de ella hasta por una minima idea que comparta de su extraa cabeza. Empezando secundaria era la alegra de sus amigas, sus maestros y todo aquel que la conoca. Cuando cumpli sus quince aos sus padres se separaron y tuvo que vivir en dos casas sin eleccin. Para disminuir el cambio, su padre le regal de cumpleaos su primera guitarra que llevaba a todas partes sin falta. Un ao ms tarde madur para poder descubrir su habilidad para cantar que decidi, con el apoyo de su madre, convertirse en idol. \nfamilia: Padre y madre divorciados. pero que la apoyan por igual.\namigos famosos: Conoci a Park Jimin en un viaje a Busan con su padre. Inmediatamente se hicieron amigos, comparten una hermosa voz y pasin por el baile.\ncon qu slot se lleva mejor?: SCRUMIZE\ntrivia: tiene una gran flexibilidad, en primaria sola caerse en cualquier lugar por lo tanto siempre tena algn raspn o herida, nunca llor en secundaria, sola ser algo oscura y aburrida en su escuela.\ngustos: Las uvas, el baile, el fro, el caf caliente, los atardeceres, los gatos blancos y las baladas. Tambin disfruta de una buena broma a sus compaeras.\ndisgustos: La tristeza, el rechazo, juzgar sin conocer, los celos y las heridas.\nfobias y miedos: Miedo a estar sola y la oscuridad.\nalergias: A la pia.\nlema: La nica manera de fracasar es nunca haberlo intentado\n\nMANNEQUIN.\nface claim+era: SONAMOOs Hong Euijin + I (knew it)\nbackups: SONAMOOs New Sun\ntalent twin: Red Velvets Yeri por su voz.\nbackups: BTSs Jeon Jungkook.\n\nHELLO.\nalgn rumor de cualquier tipo?: Debido a su estrecha amistad con Park Jimin, se cre el rumor que eran parejas pero fue negado por Big Hit Entertainment.\nha entrenado en otra compaa?: Entr por dos meses en JYP, pero se sinti incomoda y cancel.\nvdeo de audicin: https://www.youtube.com/watch?v=owNE8LfYCxQ\nespecialidad: Vocal y Baile.\nposicin en el grupo: Main Vocal y Maknae.\ntiempo de entrenamiento: 6 aos y 2 meses.\n\nRIGHT?\ninters amoroso: BTSs Min Yoongi.\nbackups: A.C.Es Jun.\nrelacin actual: son amigos, debido a Jimin; solo se han visto 3 veces pero nunca estn solos.\ncmo actan el uno con el otro?: actan de manera normal, aunque cuando estn lejos siempre hay miradas entre ambos.\nsus fans saben de su relacin o hay sospechas romnticas? explica porque: no lo saben, si se sospecha porque nunca han salido en pblico o han tenido una cita.\n\nSEE YOU.\nle gustara hacer una colaboracin con otro idol? quin?: le encantara con DEAN, considera que tiene una de las voces ms tranquilas y geniales, adems que es una fan gigante.\nconcepto deseado: uno de baladas, as con vestidos largos y todo elegante.\nmodelo a seguir: STELLARs Minhee y DEAN.\ngrupo de k-pop favorito: EXO y WANNA ONE, tambin le encanta Red Velvet.\nsi tuviera un solo, de que gnero musical sera?: balada totalmente.\n\nHUSH.\npara posterior ocasin, debut japones o chino?: est aprendiendo japons as que sera japons para practicar el idioma an ms.\nposible nombre de fandom?: OrangeCandy.\nposible nombre de primer lbum?: Sweet but Heartless.",
 "title": ""
}