{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_attacked",
  "lg_en",
  "kw_pass"
 ],
 "key": "tvLKHC3H",
 "pasteDate": "Feb 28, 2018, 3:02:42 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Morning comes and Yuri wakes up at her usual, early time. Sayori is still fast asleep on top of her, so, not wanting to be rude, Yuri decides to try to get back to sleep. But, almost as if she sensed Yuri waking up, Sayori flutters her eyes and lets out a yawn.\n\nGood morning Yuri Sayori says, still half asleep.\n\nMorning Yuri says, stroking Sayoris hair.\n\nSayori nuzzles into Yuris bosom, her eyes still closed.\n\nHey About last night Im sorry if I got weird. Guess Im a lightweight, ehehe\n\nIts ok, Sayori. I think its nice that youre saving your first kiss for Anon.\n\nSayoris eyes widen in surprise before she smiles and slowly shuts them again.\n\nHmm Did I admit to that Well, its not like its a big secret that I have feelings for him. Besides, I can trust you, right Yuri?\n\nYuri continues stroking Sayoris head.\n\nDefinitely. A few moments pass. So, Sayori, lets say we go get some breakfast, I think my mom should be about done.\n\nSayori lifts her head from Yuris chest and stretches out, her slightly too small t-shirt lifting up to reveal her belly button. She rubs her eyes before getting up out of bed. Yuri opens the door.\n\nCome on, well shower after breakfast. Its still early anyways.\n\nShuffling half asleep through the halls and down the stairs, Yuri and Sayori eventually reach the breakfast nook that sits inside the kitchen. The smell of fresh eggs, pancakes, bacon and other assorted breakfast food fill the air.\n\nGood Morning mom! Yuri says to the woman at the stove.\n\nOh! Morning Yuri! And good morning to you, Sayori!\n\nSayori is still half asleep but takes this cue that she missed greeting Yuris mom.\n\nO-oh, yeah, good morning to you too! Sayori yawns. Sorry, Im not completely awake yet.\n\nThats alright, dear, Yuri takes after me being a morning person. Unfortunately for her father he has to be to work early, so he doesnt get much choice in the matter.\n\nSayori still isnt entirely aware of her surroundings as she takes a seat. Gaining her bearing she finally notices the aproned woman standing at the kitchen counter. If she didnt know any better, Sayori would have thought Yuris older sister was making breakfast. The woman turns around, her face looks almost like Yuri, albeit a few years older. A pair of glasses frame her face and a white apron hangs over her light blue shirt, matching her jeans. As Yuris mother approaches, Sayori notices her hair is a jet black, much darker than Yuris hair. As well her chest seems to be smaller than Yuris. Otherwise theyre a near spitting image of one another, definitely looking more like siblings than mother and daughter.\n\nSo, you girls needs me to drive you to the book fair?\n\nActually, Sayori interjects, turning to Yuri, how about we take the bus?\n\nYuri gives an apprehensive look.\n\nTh-the bus? Would we even get there on time? And isnt a long walk to the bus stop and-\n\nSayori giggles.\n\nDont worry, Yuri, Ive taken the bus into the city a bunch of times. Not many people from our town go in on the weekends, so well pretty much be alone to sight see.\n\nYuris mom laughs, clasping her hands around Yuris.\n\nOh come on dear, your friend seems confident in public transportation. Its nothing to be afraid of. Why, your father and I used it when we were younger. She then turns to Sayori. Sorry, honey, Yuris never actually taken the bus into the city before. I dont know why but shes always seemed to have some phobia about it.\n\nSayori puts her arms loosely around Yuris shoulders, half using it as an excuse to try and sleep some more.\n\nDont worry, Yuri, if anything bad happens I can protect you!\n\nYuris mother laughs.\n\nHow sweet. My daughter sure knows how to pick her friends, doesnt she?\n\nSayori smiles.\n\nWell, its more like I picked her, after our club president had to move. She seemed like she knew the most about literature, so she got to be vice president after I got promoted! Suddenly Sayori remembers something and turns to Yuri. Oh, by the way, Yuri? Have you heard from Monika lately? I havent for a few days.\n\nYuri looks surprised.\n\nNo, not for a few days myself either, why?\n\nOh, no real reason I guess. She was asking Natsuki if she knew any programming and was told I tried my hand at it a little bit. I tried asking her if she made any progress with the pointers I gave her but I guess shes been too busy or something.\n\nSayori, I didnt know you did programming. Yuri says, surprised.\n\nEhehe Well Id spend so much time alone in my room, I guess one day I decided to pick up my laptop and try doing something. I dunno, its not like Im great at it, just a bit of Python and Java\n\nOh, Yuris mother interrupts, Id have thought Natuski would be the one more into computer stuff, what with all the games she brings over.\n\nNo, I think Natsuki is more into the playing aspect of that Yuri replies.\n\nHer mother smiles. Well, either way its adorable how into them she gets.\n\nSayori and Yuri finish their breakfast and clean their dishes before heading to the bathroom.\n\nSo, Yuri! Which way to the bathroom?\n\nYuri looks around, playing with her hair, avoiding eye contact. Sayori gives a concerned, inquisitive look.\n\nWhats wrong, Yuri?\n\nN-Nothing Its just The guest shower doesnt really get hot water working right.\n\nSayori contemplates what to do for a brief moment before Yuri speaks up again.\n\nI mean, if its ok with you, my bathroom is pretty big We could\n\nSayori smiles and places her hand on Yuris shoulder.\n\nNo big deal! she says, giving a thumbs up. Besides, were both girls anyways!\n\nYuri blushes as she smiles contently to herself.\n\nThe girls enter Yuris bathroom together. While Sayori was expecting a decently sized bathroom in a place like Yuris she didnt expect what she saw. The shower itself had two doors going into it, with four shower heads creating a central showering area. Two bathroom counters flanked either side of it, while a central combination table/dresser stood between them with a small chandelier hanging above. A large bathtub sat between the twin counters as well. The toilet seemed to be in a small room of its own, a sliding door separating it from the rest of the bathroom.\n\nWow! Yuri! This bathroom is really nice! Sayori says, slipping her panties down on to the floor. \n\nYuri grabs a couple of clean bathrobes and places them on the counters before she undresses. She turns on the shower heads as the two girls wait for the water to heat up. Sayori decides to sit on the raised counter central to the bathroom. Sitting on the edge she kicks her feet playfully back and forth, smiling. Sayori lays down on the counter and looks at Yuri, who was standing behind her.\n\nWhats wrong, Yuri? You look embarrassed.\n\nYuri looks slightly away and blushes.\n\nW-Well its just youre\n\nNaked? Sayori interjects. Come on, Yuri! Natsuki barged in on my shower before, and besides its not like Im coming on to you like last night! She gives Yuri a cheeky smile. Unless you actually liked that or something.\n\nYuris face turns bright red as her eyes open wide. Her heart pounds. She quickly clenches her fists and closes her eyes.\n\nN-No! I-Its not that!\n\nSayori laughs.\n\nHehe Sorry I think Im starting to pick up on Natsukis habit of teasing people\n\nYuri keeps looking away from Sayori, giving the occasional glance as she plays with her hair. Noticing the steam starting to form Sayori leaps up and goes over to Yuri, opening one of the shower doors. She motions for Yuri to go in.\n\nAhh! This waters hotter than I thought! Sayori exclaims, jumping as the first of the water jets hit her.\n\nYuri laughs to herself and turns the temperature down slightly. Sayori stands out of the water, occasionally checking it. Once it reaches the right temperature, Sayori stands under a shower head. As the water rushes over her, Sayoris face melts almost into pure ecstasy.\n\nWow.... Yuri Sayori says, enveloped by the torrent of warm water. Did I mention your bathroom is reaaally nice\n\nSayori stands under the water for a few minutes, enjoying it rather than washing herself. Yuri as well stands in the water, however shes more used to it and waits for Sayori out of politeness. Eventually Sayori notices this and decides to start shampooing her hair. Yuri follows suit. Sayori lathers up a loofah and hands it to Yuri.\n\nCan you get my back? I always feel like an idiot trying to reach all the way down there.\n\nHolding the loofah in her hands, Yuri stares apprehensively at Sayoris back, before eventually she slowly starts scrubbing. \n\nMmm That feels nice, Yuri \n\nYuri blushes, unnoticeable through the steam of the shower. After Yuri finishes, Sayori turns and grabs the loofah, adding more soap to it.\n\nOk! Your turn!\n\nYuri slowly turns for Sayori to clean her back. As she feels the soapy, scrubby surface of the loofah touch her skin, Yuri winces out of nervousness. She moves her long, violet hair over her shoulder so Sayori doesnt have to maneuver around it.\n\nYuri, I never knew you had a birthmark on your back!\n\nHuh? Oh y-yeah I guess I do\n\nIts kinda cute. Sayori says. Yuri blushes, again unseen.\n\nAfter rinsing off Yuri turns the shower faucets off and the girls exit to dry themselves. Yuri wraps her long hair in a towel on her head to dry it off. Sayori, having shorter hair, dries it off quickly with a towel, leaving it messy. Both girls put on the bathrobes Yuri laid out.\n\nSayori quickly gets her hair brushed out. Yuri unwraps her hair and begins to brush it when Sayori stops her.\n\nNot to be weird or anything, but can I brush your hair? Sayori asks.\n\nSure, I suppose so.\n\nThanks! Ive always been a little jealous of your hair since we met, to be honest Sayori admits. It must be hard to keep up.\n\nA little bit, Yuri replies, but your hair style fits you well, Sayori. Honestly Im a bit jealous of your hair color myself.\n\n\nThanks! Sayori says with a smile as she continues brushing out Yuris long hair.\n\nThe two girls leave the bathroom to pick out their outfits for the day. After putting on her underwear, Sayori goes to grab her bow. With her she brought a white blouse with lace sleeve ends and a slight v-neck. To go with it she wears denim shorts and sandals.\n\nYuri puts on a white tanktop and black leggings. For footwear she decides on a pair of white hi-top canvas sneakers. She grabs a white turtleneck sweater that she lays on the bed next to her.\n\nUntil now Sayori didnt notice, since Yuri had been wearing long sleeves, or was covered by the steam of the shower, but now her forearms are completely visible. Across them are scars, evidence of years of self harm. Thankfully no fresh cuts are present, it seems Yuris getting better in that regard.\n\nSay, Yuri Sayori begins, sitting on the bed next to where Yuri is standing, have you ever tried going out without long sleeves?\n\nYuri quickly grabs her forearms, hiding them from Sayori.\n\nNever! What would people think if they saw me like that?\n\nI dont think anyone would think much of it at all. We all have something that makes us unique.\n\nListen, Sayori, I know what youre trying to do, and I appreciate it. I really do. But todays not the day for that.\n\nSayori frowns. Despite her well intentions, she realizes its going to take a bit of time before Yuri gains more self confidence.\n\nIts ok! Sayori says, smiling as she grabs Yuris hand, Its something for you to decide when youre ready! I just think you look nice in short sleeves, ehehe\n\nYuris anger and self loathing fades as she smiles back at Sayori. She decides against the sweater and grabs a navy blue cardigan instead, wearing it open.\n\nGetting their bags together and making double sure they have everything in order, the girls head out the front door.\n\nBye mom! Yuri shouts, Ill be home in time for dinner!\n\nYuris mom rushes over to give her daughter and Sayori a goodbye hug. Before the door closes, she hands Yuri some extra money. Sayori notices that its well beyond what she even gets for Christmas.\n\nFeel free to eat out if you girls want, its no big deal! Besides, saves me time cooking! Yuris mother says with a laugh.\n\nSayori and Yuri wave goodbye as they close the door and head to the bus stop.\n\n*****\n\nAround this time is when you wake up. Even though its almost ten, this is still a bit early for you to be up on a weekend. Breakfast doesnt seem to be a priority as you just grab whatever catches your eye until you feel full. After about a half hour of watching TV you decide to get showered and dressed. Youre unsure if Natsuki is awake, but you did plan on going over to see her today. Around a quarter to eleven you decide to head to Sayoris.\n\nYou knock on the door before letting yourself in, as you normally would. The house is mostly dark, except for the light of the television. On the couch Natsuki is laying on her stomach, knees bent and her feet kicking back and forth in the air. She looks over her shoulder as she hears you entering.\n\nI dont remember saying Come in! Natsuki says, smugly.\n\nI dont remember this being your house you respond in turn.\n\nNatsuki flips herself over and sits cross legged on the couch to face you. You notice shes just wearing a cropped t-shirt and underwear.\n\nHmph! You dont have to be so mean about it! I was just joking.\n\nYeah, yeah I know.\n\nNatsuki leans towards you, smiling.\n\nSo, whatcha wanna do today? she asks. Natsuki then lays on her back. Or did you come here to take advantage of me being alone? she says, pulling her finger down across her bottom lip before giving a sly grin.\n\nYou move yourself away from her before turning your head to the door.\n\nNot at all! you insist.\n\nNatsuki sits up, still giving her sly smile.\n\nHeheh... Got you going there for a moment.\n\nHardly!\n\nOh come on, Anon, lighten up! Just because I watch anime doesnt mean Im into my big brother or anything!\n\nBig brother, huh? you say, trailing off.\n\nWell, yeah I mean Sayoris my big sis and since you two are, well you know\n\nAre what? Were just friends is all. you tell Natsuki. However she can sense the unsureness with which these words come out of your mouth. She smiles at you.\n\nOh come on! Im not an idiot, you know? The way you two are around each other, the way you talk\n\nW-Well Weve been friends for a while Its only natural! you try to insist.\n\nHmm If thats how you feel. She had a similar reaction. But youre both way too easy to read!\n\nNot knowing how to respond, the two of you sit silently for a few minutes. Eventually you decide to break the silence.\n\nSo, Natsuki I never asked, but what happened that ended up making you move in with Sayori.\n\nNatsuki looks surprised that youd ask. She brings her knees up to her chin and wraps her arms around her legs.\n\nWell, I guess I can talk to you about this. I dunno if I told you but my dad is a pretty bad alcoholic. Like most of the time hed be too drunk to remember I existed Too drunk to remember to buy food for me But I guess it was better when he forgot about me because he wouldnt be yelling at me. Or hitting me for getting in his way\n\nTears start falling down Natsukis face, but her voice remains steady. You put an arm around her to comfort her.\n\nHe wasnt always like that though But I guess after mom died he couldnt handle it. It wasnt immediately that he started drinking. I remember before he got really bad he used to say I looked like my mother. Its been so long, I cant remember.\n\nShe pauses to wipe her face.\n\nAnyways, Ive managed to be pretty independent for a while. If I couldnt sneak his card away long enough to buy food Id sometimes ask the neighbors. Sometimes Id even sell cookies and cupcakes, Natsuki smiles through her tears, guess it helps when youre this cute, huh? So yeah, the day of the festival was coming along and I managed to get together enough stuff to make the cupcakes. Little did I know you were going to have us go to Sayoris. I dont know how much I believe in fate, but she definitely saved me. My dad had been getting worse lately,yelling at me and hitting me for no reason. Not like the bastard was ever home anyways. Half the time hed be out drunk for days. Thankfully hes enough of a regular drunkard to have open tabs and Im sly enough that I could steal his card for a while. Idiot would never check his balance, so I managed to get myself food, clothes and even spent money on gacha out of spite of him.\n\nNatsuki laughs at this last part. You laugh internally as well, not at the story, but because youre curious what gacha Natsuki plays.\n\nI didnt expect Sayori to let me stay even one night, if Im being honest. Sure shes nice at school, but I didnt know anything about her other than our meetings in the literature club. Youre lucky to have known her for so long After a few days she ended up asking why I didnt go home. She wasnt wanting me to leave, she was just being curious. So I told her, and she immediately called her parents and asked if I could start living with her.\n\nSayori really is something, huh?\n\nNatsuki sniffles through her tears and smiles.\n\nShes nothing short of a saint. She even offered to help me get my things. I wish she didnt though. I didnt want her seeing that place\n\nSuddenly you remember that dream you had. The dusty, dirty home. The smell of stagnant booze. And the screams of a terrified girl, attacked by an angry drunk. And-\n\nNatsukis sobs and sniffles intensify as shes just short of breaking down crying.\n\nI thought that bastard wouldnt be home, but he was! Sayori, Im sorry you saw all that! Im sorry he hit you! Natsuki breaks down crying, burying her face in her knees. You hug her as tightly as you can, patting her back to try and calm her down.\n\nIts ok, Natsuki, its not your fault Its not your fault you assure her. \n\nThe cries of an innocent girl are never something anyone wants to experience. You can feel yourself even starting to cry. You never imagined Natsukis home life was that bad. Worse yet, the pain that affected her for years even came for Sayori. You begin to shed tears too, sharing the pain of two of your best friends.\n\nEventually Natsukis crying stops and she wipes her face.\n\nA-Anon Im sorry I didnt mean to-\n\nDont apologize, Natsuki. Theres no shame in crying in front of your big brother.\n\nNatsuki wipes her tears and smiles. She reaches up and gives you a kiss on the forehead.\n\nThanks You and Sayori, you two mean a lot to me. Natsuki composes herself a bit more and continues, My dad tried getting me to come back home, but the police pretty much told him he didnt have a chance at seeing me again. Havent even heard from him in a while. Good riddance, I say.\n\nYou continue patting Natsuki on the back.\n\nHey, Natsuki, how about I take you out around town today. Spend some time hanging out with your big bro. We can go to the park, Ill even feed you.\n\nHmm, sounds like a date to me Natsuki gives a sly grin, What would Sayori think, you going on a date with your little sister?\n\nIts not like that! Come on!\n\nNatsuki chuckles.\n\nI know, I know Alright, if youre offering, sure. Lets go see whats around town. Ive never gotten too many chances to go out anyways.\n\nNatsuki takes a quick shower and comes out in a black tank top and black denim shorts. She goes back in to her room and comes out with a gray hoodie with a black kanji character and white socks that go about halfway up her shins. In her hands she holds a pair of pink canvas hi-top sneakers. She puts them on by the front door.\n\nAlright! she exclaims, Lets get going!",
 "title": "DDLC Ex: Bonding"
}