{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_de"
 ],
 "key": "U6p8pQFw",
 "pasteDate": "Feb 21, 2018, 12:35:58 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Bei der Nummer mit dem Ei, bei dem er direkt wei dass er den Bren (die Kreatur LEL) fttern muss, sieht man einfach wieder ganz klar, dass er mit Lsungsbuch spielt\n-----> ok schlaumeier denkt mal logisch erstens ich habe das LP nachts um 1 aufgenommen. selbst wen ich ein lsungsbuch htte whre das aller hchstens am nchsten morgen angekommen. \nDavon abgesehen whre das spiel kein Blinde spiel wen ich irgendwelche lsungsbcher verwenden wrde. \nUnd das wichtigste was dir ganz offensichtlich fehlt. \nIch habe logisch gehandelt und mich umgeschaut und festgestelt das da was ist was man werfen kann. ich habe ausprobiert welche optionen ich habe so wie man das immer macht wen man keine ahnung hat wie ein spiel funktioniert\n\n\n\nWie oft bist du denn gespannt??\n-----> Immer das ist ja das schne an einem Blinde spiel.\n\n\n\nWie wrs mal mit n lets Play skyrim?\n-----> vielleicht wen ich wieder einen besseren rechner habe\n\n\n\n14tausend erreicht das kann noch mehr werden \n-----> was genau meinst du mit 14 tausend ?\n\n\n\nIch wette ab Aufnahme Session 2 hat er bereits das Lsungsbuch offen! PS: Er musste Doom lschen weil er keine SD karte fr die Switch hat =( und weil er dort eh zu schlecht war!\n-----> das ist bldsin was du da sagst.\nwen ich mit lsungsbuch spielen wrde whre es ja kein Blinde titel oder?\nhr bitte mal auf andere zu triggern oder es zu versuchen damit machst du dich nur selbst lcherlich.\n\n\nDas kann einfach nicht dein Ernst sein! Deine lets plays sind unglaublich schlecht und keine Sorge. Ich gucke sie mir ab jetzt auch nicht mehr an du fetter stinkender Buttergolem ohne Freundin\n-----> weit nicht nur das du mich beleidigst nein du sagst auch etwas was du selbst null besser kannst.\nWas? oh du kannst es besser?\nBeweis es. das einzige was ich von dir bisher mitbekommen habe ist das du astrein in Beleidigen bist besonders wen man dir nix getan hat.\nEin gromaul wie dich findet man an jeder strasenecke echt traurig wen menschen so irrelewant sind das sie der masse folgen mssen um relewant zu sein oder sich zumindest so zu fhlen.",
 "title": ""
}