{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_cracked",
  "kw_down",
  "lg_en"
 ],
 "key": "Ub8f3pSB",
 "pasteDate": "Feb 18, 2018, 9:09:23 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "    Clicking of well tailored shoes caught the attention of Catherine Dalca, causing her to look up towards the elderly caretaker. Garbed in a dress, its cloth thin and atramentous, made for a maiden who recently lost her husband, Catherines identity remained partially masked by a lacy onyx veil. The man asked if she was alright, naturally assuming Catherine was another widow in mourning. In response to his question, she fabricated crocodile tears and covered her mouth with a darkened glove. Blustering out a spurious story on how she just had buried her husband of four years, losing him to a senseless murderer. With this the elder took his leave, knowing to leave those who just lost to lament at their own pace. Catherine wiped her tears as the man was gone, tilting her chin up confidently as she cast aside her look of tragedy.\n\n    Later that day, as the town grew dark under the cloak of night, Catherine sat amidst candles and texts in her own small home. Shadows danced about the small study, the glimmer of the waxy flames leaving much of the room as dark as her faux-widows attire. With meticulous hands she flipped through the pages of a book she borrowed from the library, beside it a list she constructed from her visit to the graves. Plated eyes traipsed between the two publications, cross-referencing any sort of resemblance those in the tombs had of fame and fortune. A red medium was used to circle those Catherine had interest in, wellbornes amidst gold and jewelry. Pursed lips aided in fanning the dust off of an aging journal she found that once belonged to a deceased warden of the same mortuary. The spine of the diary cracked softly, its age showing as each page folded over the backbone.The parchment of the past keeper detailed his day to day purpose and duties for the weathered graveyard. Red circles now highlighted the hours from when the pattern of the footmen within the grounds of the undead landscape, recalling the hours of day and twilight in which they roamed. Grabbing her coat from the thin rack provided by the landlord she pulled her arms through it, wrapping it tight around her form. Adorned upon her head was a thick hat made for disguising ones self for late night rendezvous. Minas in hand she met with the orphan children who played in the alley two buildings down, offering them her hot meal for the day in exchange to purchase a list of goods needed for her heist. She trusted one in particular, Nepitrite; a little girl who lost her parents in a war between Norland and the Orenian Empire. Neph was the most loyal out of all the children upon the streets and always made sure none of the other children or homeless would steal Catherines supplies as she waited to pick them up. The faux widow found the goods where they would be, behind her home disguised in some brush.",
 "title": ""
}