{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_vulnerabilities",
  "kw_vulnerable",
  "lg_en"
 ],
 "key": "ucMGt12p",
 "pasteDate": "Feb 17, 2018, 6:53:15 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "I have an idea of where we're at as a species right now. Hope you're ready for some BULLSHIT.\n\nThe Enlightenment was a period of about 150 years or so where people really embraced practical thinking and rationalism as a means of coming to understand the world. It wasn't that people weren't using reason before this period, but this period was committed to cultivate not only more advanced means of reasoning but also to see that the populace at large embraced reasoning. Plenty of people talk about how much they \"love science xD\" but what they really mean to say is that they like consuming interesting little tidbits that are easy to digest and sound fancy at parties. They actually couldn't reason their way out of a wet paper bag. So it's still a work in progress like 170 years later. What came of the Enlightenment was the industrial revolution. That revolution was the result of a developed reasoning's discerning edge, which...\n\nHere we are.\n\nThe reason I'm telling you all this is because I think you can reasonably categorize most matters as rational matters or spiritual matters. I don't mean the spiritual that has funny associations with religion, but the spiritual matters that concern the emotional part of ourselves. Industry was great for the world. That revolution is still going today, but something else picked up right around the 60's or 70's. I think the counterculture movement marked the beginning of a period where people would begin to look inward and confront their unchanneled emotions. Trying to throw off the shackles of culture is a real game changer because to do so is to effectively re-write social order. It wasn't an event that INSTANTLY CHANGED EVERYTHING, but it shed light onto culture as a mechanism of humanity. Culture is the smoking ace playing cards behind the curtains who actually runs the show out front, and that movement threw the curtains open ever so briefly. People have been going wild trying to figure out what to do with this freedom. You get some very exotic interpretations.\n\nI think that something good that might come from all this is the next place to really develop is the emotional education of people. We like to think of ourselves as rational people who don't let emotions get in the way, but the fact of the matter is that emotion still runs the show for almost every single person. ***I think it's some immutable quality that simply cannot be escaped.*** The most common thing I've seen people do is convince themselves they're not vulnerable to the influence of emotions and run with that faade. But I dont think thats possible, so what theyve actually accomplished is somewhat blockaded themselves from developing an entire sector of being human. The description is a little dramatic. Its not a total block off since most people end up one day confronting themselves in this regard and making developments. However, because theyve had no education in handling emotions, theyre a total amateur. The cut is sloppy. It heals incorrectly. Maladaptation occurs.\nSo if its a permanent factor in our lives, maybe the next big step is developing our relationship with that part of ourselves much like we did with reasoning. Whats really important is that I think reasoning does in fact have a promising role in emotional development. As I said before, its a useful tool with a discerning edge. Reasoning cant change the way you feel on a dime, but itll aid a person in the gradual myelination for a new line of thinking. Without it, youd just be a ship with no direction. Thats exhausting and we dont have time for that in our lives if the ultimate goal is to bring this beast into tow. What people stand to gain from a real mastery of the emotional facet of their lives is an authentic way of living that avoids the vulnerabilities of amateur philosophies or the impotence that comes with neglecting proper emotional development.",
 "title": ""
}