{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "UXEfDUJ9",
 "pasteDate": "Feb 20, 2018, 4:36:32 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "V0LTA - CraftyCroc - Today at 8:28 PM\nXaph can you try find me a buyer for my nyx? Has full fit - tank, gank and travel. Few cyno ceptors sabres and a nestor. Also your fighter list\nWill try work out a rough price but I'll put a discount in\nErazor - Today at 8:29 PM\nHow come you wanna sell it? Disagreements with Chori?\nV0LTA - CraftyCroc - Today at 8:30 PM\nThe guys a wanker mate. I don't play the game to get treated like a prik and unfortunately his voice is to loud in corp.\nI'll stay but not partake in shit he is involved in\nErazor - Today at 8:30 PM\nHe is\nV0LTA - CraftyCroc - Today at 8:30 PM\nOr leave if that's what others want\nMany say it\nErazor - Today at 8:30 PM\nYou just have to learn to filter him out\nProblem is he is a big content creator\nWe all know he's a retard a lot of the times\nV0LTA - CraftyCroc - Today at 8:32 PM\nI note he gets content and I get why a corp would want that. But I also see how he rubs people up the wrong way. Delicate balance but personally hmm\nErazor - Today at 8:32 PM\nYeah for sure, we all know it too\nWe try hard to reign him in but it gets out of hand a lot of the time sadly\nIt's not ideal & believe me if we had alternatives we'd use them\nWhat was the issue? I wasn't there so I dno what happened\nV0LTA - CraftyCroc - Today at 8:33 PM\nI'll wait down my timer and see how I feel. Literally just raged at him so maybe a day or two will help.\nErazor - Today at 8:33 PM\nJust stay logged off, go play other games for a while. D/w about EVE :wink:\nV0LTA - CraftyCroc - Today at 8:33 PM\nWith me personally he plays an alpha male role. Or tries to. Straight up ignores me and then the language\nNone of us had light fighters\nAnd we are the dicks for not wanting to shred t2 fighters to 'create content'\nTech 1 fighters not lights\nAnyway I'll see on the super personally I enjoy it's use but don't trust chori to fc me whilst piloting it.",
 "title": ""
}