{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "re_url",
  "lg_en",
  "kw_illegal"
 ],
 "key": "uZZjGvYN",
 "pasteDate": "Feb 8, 2018, 8:29:49 PM",
 "relevancy": 2.0,
 "relevant": false,
 "text": "User is selling an eBook which claims to allow people to make people who buy it a minimum of $150/day. I, of course, fell for this scam. You can view where I purchased the eBook here: https://rocketr.net/buy/8d7ace3529c6 (Tracking number: 842003d6a1da | View delivery status: https://rocketr.net/track/), and a image where the seller advertised the book here: https://i.imgur.com/1ijR4G0.jpg. The seller also explained how the eBook contained no illegal items inside of it or anything unethical, which I thought was awkward to include, but shrugged it off. This is mentioned here: https://hackforums.net/showthread.php?tid=5794518&highlight=Income+Flow (Image of page here in case it is edited from Thursday, February 8th, 5:21PM EST: https://preview.ibb.co/nQGfox/screencapture_hackforums_net_showthread_php_1518128097412.png). When I open the eBook, I'm met with a poorly written 8 page eBook. One method of the eBook says to take advantage of paid software that are free for students here (http://freestudentsoftware.com) and to sell it on eBay, which I'm pretty sure is against the Terms of Service of all parties included, including but not limited to: FreeStudentSoftware's, eBay's, and the individual software's terms of service. This method is also super unethical, which is also going against how the eBook was advertised as \"100% legal and ethical\" (proven in the screenshots above). I paid for the Elite edition, which came with a \"$80 bonus\", which I'm assuming is the second method I read in the eBook, which is straight up scamming and identity theft, both of which are illegal. The eBook suggests that readers should find random images of attractive females online, to add: WITHOUT THEIR PERMISSION, and to post them to Craigslist, pretending to be this individual. Then demand that anybody who wants to see this individual naked must pay a fine 50% upfront, then take the upfront money and run with it. I received an illegal and unethical eBook, and I'm demanding my money back.",
 "title": ""
}