{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_threat",
  "lg_en"
 ],
 "key": "v9QfvAxc",
 "pasteDate": "Feb 28, 2018, 10:54:11 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "I kept heading northward for hours until I saw that sign that said  Welcome to Canada . As I crossed the line that was drawn on the ground, it hit me : I was officially a defector now, for I left my family, my kind, my people for I left my country.\n The swirling storm of my thoughts was howling. In that storm, I saw my friends; each one of them was eyeballing me in abhorrence. Then I pictured my parents in infamy. While my mother remained silent, my father stoically said: What a sham. I did not strike you as a traitor. Since I could not stand to look at them in the eyes, I flee away. The thing is one can run away from their country, but one cannot avoid their conscience. No matter how far I drove, no matter how much I accelerated, I could not leave my guilt behind. \nIt was a cold day in Canada. Luckily enough, the amount of fuel I had was sufficient for me to keep driving with the heater on until I arrived at some small town called Torkey in the territory of Saskatchewan. At first, though, I obviously did not know in which place I was; but as I ran dry on gas and had to leave the car, I encountered an old chap named Steve.\nSteve was a polite, well mannered gentleman. Despite his old age, -he must have been somewhere in between his sixties and seventies-, he was in a rather good shape. As he was standing straight, I heard his loud voice saying: Greetings, young man, and welcome here in Canada.\n-H-hi, I said, intimated. Then I promptly added.  I am Tim.\n- I am colonel Steve Warwick, I fought for the Alliance in World War Two.\n-Meeting you is an honour, sir.\nAnd it was an honour indeed\n-\"Tell me, Tim, what business brought you here in the north?\"\n-\"I...\"\nI could not tell him the truth, now could I? But for some reason, it was so tempting. I just had left everyone I cared for, I was feeling lonely and... he was so agreeable, yet so authoritarian. I tried to lie, but it all came as some mumbled words with no coherence.\nI then pulled myself together and said :\n\"The truth, sir, is that I was supposed to fight in Vietnam, but I left. I am American, and I love my country. I am ready to kill and die to protect it, but Vietnam? Its people are not a threat to us, and they are not to mankind. They are not Hitler, so why would I travel so far to die there? The truth, sir, is that I am here to start my life anew;\"\nLull in conversation.\nAfter a moment, the awkward silence I created was broken when he told me to follow him. As I did, he said that it all was but my own business, and that he was obliged to provide me food and shelter, which he did by hosting me for dinner.\nThe following day, though, I had to leave. He showed me the closest gas station, and, once more, I headed north.",
 "title": "ez"
}