{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_stole",
  "lg_en"
 ],
 "key": "vaPCXcjh",
 "pasteDate": "Feb 28, 2018, 12:26:09 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "There will never be another ontdhogwarts tinychat member quite like our dear friend <lj user=\"soundiz\">.\n\nNo one else will be the original president of Bittermore.\nNo one else will promote the shit out of Spotify like he's getting paid for every word and syllable (contributed by <lj user=\"rissa_delovely\">).\nNo one else will watch the PLL Halloween episode at 2 AM with <lj user=\"whyelse\"> even though he fucking hates PLL.\nNo one else will get people iced out (and change their lives tbqh).\nNo one else will save <lj user=\"rissa_delovely\">'s ass with a Pottermore account.\nNo one else will save a ton of other people with Pottermore accounts.\nNo one else will say stop. moro. (or is it moro. stop.?)\nNo one else will get shoved down the chute at Waverly by <lj user=\"rissa_delovely\">.\nNo one else will continue to watch Secret Circle every week despite the fact that he says it's boring.\nNo one else will play Eric Saade's Manboy just to cheer <lj user=\"whyelse\"> up.\nNo one else will promise us a chat drawing and then take 439893471 months to finish it.\nNo one else will try to troll the chat as voldemort and get detected every. fucking. time. by <lj user=\"whyelse\">\nNo one else will dream of one day adopting a Canadian orphan (just like Esther ofc).\nNo one else ask to fondle <lj user=\"alexaorz\">'s boobs and give her pills.\nNo one else will still be in the chat at 9 AM when <lj user=\"rissa_delovely\"> is going to work (well, except <lj user=\"whyelse\">).\nNo one else will stage an intervention for <lj user=\"rissa_delovely\">'s alcoholism.\nNo one else will get killed by <lj user=\"alexislex\">, stay a ghost for like a month, and then miraculously be resurrected.\nNo one else will stay up until ungodly hours of the morning watching random horror/suspense movies and It's Always Sunny with <lj user=\"whyelse\">.\nNo one else will get pressed when <lj user=\"whyelse\"> talks about figure skating and Eric Saade and threaten to leave (actually nvm other people night).\nNo one else will go missing from the chat for 3 days and get his face put on a milk carton.\nNo one else will take his sweetass time drawing on the whiteboard. (contributed by <lj user=\"caribou_cake\">)\nNo one else will ever measure up.\nNo one else will watch Playboy Club with <lj user=\"whatisurdamage\"> and <lj user=\"whyelse\">... and drool over Amber Heard with <lj user=\"whatisurdamage\">.\nNo one else will refuse to let <lj user=\"sweetdeebee\"> draw penises on the whiteboard.\nNo one else will be <lj user=\"whyelse\">'s beloved life coach. <3\nNo one else will inspire <lj user=\"sweetdeebee\"> to say \"goodbye 2 my fellow Mexican, sorry he hates on flawfree ladies like Ginny.\"\nNo one else will need a visit from Chris Hansen. (contributed by <lj user=\"caribou_cake\">)\nNo one else will witness <lj user=\"buttermell0w\">'s friends getting dirty on the sofa at 1 AM.\nNo one else will try to introduce <lj user=\"alexaorz\"> to sushi.\nNo one else will inspire <lj user=\"whyelse\"> to start whining about his impending departure and singing Peter Nalitch songs a month ahead of time.\nNo one else will refuse to give out personal info in an effort to hide the fact that he is really a 50 year old creeper.\nNo one else will help <lj user=\"rissa_delovely\"> counsel lost souls in the chat anymore.\nNo one else will ever be as pressdiz. (contributed by <lj user=\"caribou_cake\">)\nNo one else will ever suck so bad at Board Game Online. (contributed by <lj user=\"rissa_delovely\">)\nNo one else will make a flawfree birthday post for <lj user=\"alexislex\">.\nNo one else will talk about his fucking awesome smoothies and make us all jealous.\nNo one else will think he stole <lj user=\"ranidays\"> from <lj user=\"rissa_delovely\">.\nNo one else will run American Horror Story watchparties and tell us all when to hit play.\nNo one else will have blue eye envy (says <lj user=\"rissa_delovely\">).\nNo one else will get schooled by Ari on consent laws in all 50 states.\nNo one else will bitch about Dev being preggers ('cause no1curr). (contributed by <lj user=\"rissa_delovely\">)\nNo one else will make <lj user=\"rissa_delovely\"> \"kinda sorta... miss that fucker.\"\nNo one else will type\nlike\nthis\n...and make everyone else start typing that way too.\nNo one else will have the soul of a boy... no, the soul of a man.\nAnd really, more than anything else,\nNo one else is such a nice guy.\n\nYou will be missed, beloved <lj user=\"soundiz\">.  <3 <3 <3",
 "title": ""
}