{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "re_url"
 ],
 "key": "VgNLGFg6",
 "pasteDate": "Feb 28, 2018, 2:14:50 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Tuesday, February 13, 2018\nChampagne: Meow\nChampagne: What gets whiter as it gets dirtier?\nChampagne: =/\nChampagne: A black board \nChampagne: Hope your Valentine's day is great \nChampagne: Going to bible study on Valentine's day, God's the best valentine.\nThursday, February 15, 2018\nChampagne: im going to give homeless ppl food today :/\nChampagne: im weird\nChampagne: fruit and sandwiches o.o\nChampagne: after my game though\nChampagne: my hands are cold ;-; its below freezing\nChampagne: Well ppl are them o.o\nChampagne: I gave one to a guy with swollen hands\nChampagne: And a red headed chick =/\nChampagne: I don't want to go to my doctors appointment rofl tales forever to get a decent doctor and I'm like I don't wanna go ;_; I do I just don't want to travel there teleporting please\nChampagne: People ate*** mis spelled that word\nChampagne: All the guys said I was pretty =/\nChampagne: Sort of awkward going places and ppl keep saying whoa you're pretty =/ girls and guys ;_;\nChampagne: Why can't I get a good boyfriend maybe the prettiest ppl just have to wait =/\nSunday, February 18, 2018\nChampagne: i went to open worship today\nChampagne: and i got prayers, and its like ugh \"peace\" was what was prayed over me and i just feel silence.. its so nice O_O i wish it was like this all the time\nChampagne: like its so weird when i would cryt o u about how i felt D: like dying\nChampagne: i dk its like.. i hurt so much\nChampagne: but this is the complete opposite feelign its just peace\nSunday, February 25, 2018\nChampagne: meow\nChampagne: i made 5 cheese mac and cheese\nChampagne: and im like done with my life\nChampagne: im complete..\nChampagne: ughh it was too much food... i shared with my roommates :l\nChampagne:  https://steamcommunity-a.akamaihd.net/economy/emoticon/vanilla  i never want to see mac and cheese again too bad I made a caserole's worth for a week :l\nMonday, February 26, 2018\nChampagne: i told my boyfriend today im breaking up with him.\nTuesday, February 27, 2018\nChampagne: No more bf\nChampagne: He only wants sex and doesn't care about me\nChampagne: 1.5 yrs of him trying to trick me... and I'm not interested in being used....\nChampagne: I want to adopt kids becuz it's apparent relationships and guys don't work for me.... I told my ex that too cause ppl just want sex and nothing else from me it's gross\nChampagne: I dk y I'm not like everyone else\nChampagne: The worse thing is realizing other ppl might go through horrible stuff like me.\nChampagne: Ppl are so selfish =l\nChampagne: I wish there was an option for ppl to not like or comment on photos I'm so above that I don't want comments or likes... my generation was so much better....\nChampagne is now Online.\nChampagne: life just feels like its sso much harder when theres not the right match for me on this planet\nChampagne: so many guys just want a bunch of fucked up sluts.......... and its so annoying because 100% of the time guys are tryin for girl thats dont want anything to do with them anyway.......\nChampagne: shura's gf left him\nChampagne: i still talk to him...... if he wasnst a douche half the time being all sexual he'd be a decent person...... but he was sad over that\nChampagne: my exes like brandon and jon both broke up with someone.................... and brandon is still trying to get back with his ex after 6 months\nChampagne: its sooo dumbbbbbbbb\nChampagne: i hate guys that are so stupid\nChampagne: i hate that things are permanent with ppl\nChampagne: i guess davids gf left him to be correct -.-\nChampagne: I HATE DATING IN the 20's age range omg life is all about how fucked up relationships are.... its sooo stupid how fucked up guys are how stupid they are between fucking 20-30 they need to be fucking hit by a bus and be crippled and be black and blue to gain some fucking wisdom and common sense to stop being STUPID FUCK HEADS :C",
 "title": ""
}