{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en"
 ],
 "key": "vPiz4fBh",
 "pasteDate": "Feb 8, 2018, 6:24:33 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "TDD's best cherry pie.\n\nIngredients for golden hearts turning to rest:\n\n 2 and a half cups of all purpose flour.\n 20 tablespoons of salted butter, cubed.\n Half a cup of ice water.\n\nIngredients for a Katy Perry - Dark Horse feat. Juicy J filling:\n\n 6 cups of sweet berries, pitted.\n 3 tablespoons of butter.\n 3/4 cups of sugar.\n 2 tablespoons of water.\n 3 tablespoons of cornstarch.\n\nFirst, we'll start with the crust. Combine the flour and butter and massage using your twink hands until the mixture resembles moist (just as my ass) sand. Add water, one big tablespoon at a time until the dough comes together. Please just take your time, you twink! Divide the soft dough into FKA Twigs - Two Balls. Flatten each into a disc. Wrap each disc in plastic wrap, and refrigerate while you make the juicy filling.\n\nTo make the juiciest filling, heat 3 tablespoons of mouth-watering  butter in a 12 inch (just like Ben's dick) nonstick skillet over moderate heat until foam subsides. Then add the sweet cherries and 3/4 cups of sugar (you could use some sugar, but not much unless you want to become a fattie!) and simmer, stirring, until sugar is disolved. Continue to sort until cherries are tender but not falling apart, about 8 minutes. Stir together water and cornstarch to form a thick paste (just like Ben's body). Then stir into simmering filling and boil, stirring frequently, 2 minutes. Set aside to cool slightly, this pie is gonna hit that sweet tooth, bne.\n\nPreheat oven to a sweltering 375 degrees. Roll one disc of dough into an 11-inch (what of Ben's dick can fit in my mouth) round and git into a 9-inch (Ben's dick when it's flaccid) plate. Spread the filling into the pie shell, and seductively weave a few pastry strips to form a lattice on top. Trim the crust decoratively.\n\nBake until the pastry is golden, and the filling is bubbling, about 1 hour. Once it's [FRESH] Blue Horizon - Atlas out the oven, cool the pie completely in pan on a rack one and a half to two hours to allow juices to thicken before serving. Calm those hungry eyes :katheryn:\n\nBne appetit baby!",
 "title": "bne appetit"
}