{
 "espireDate": "2W",
 "format": "text",
 "jSonReasons": [
  "lg_fr",
  "re_url",
  "kw_pastebin"
 ],
 "key": "w07pahNF",
 "pasteDate": "Feb 28, 2018, 8:22:49 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "Bonjour les gens dous, je cherche de l'aide pour Grub, actuellement, mes systmes ne dmarrent plus \" normalement \".\n\nDj, beaucoup de courage  celui, ou  celle, qui prendra le temps de lire mon poste, j'ai tent d'tre prcis dans ce qui m'arrive, et d'expliquer l'objectif  atteindre.\nSi mes explications sont trops longues, peut tre que le pastebin en dira directement plus,  ceux qui savent le comprendre :\n\nhttps://pastebin.com/6px5X85a\n\n\n\nHier encore, j'avais un grub \"je pense\" plac sur mon 3me disque, qui me proposait de charger linux mint / linux mint / windows 10.\n( J'avais aussi un grub, sur mon disque 2, 1 ddi  linux, le second  windows, plusieurs partitions sur le disque 2, 2 systmes. )\nC'est d'ailleurs l'installation du 3eme disque et de mint, qui m'avait enfin permis d'avoir mon multiboot windows fonctionnel.\na a presque tenu 1 an ...\n\nVoil que Windows, je pense, vient de gacher mon plaisir. La mise  jour a redmarre plusieurs fois, et, j'ai rat le coche pour le choix du menu windows.\n( j'ai rebott sur un linux par dfaut. )\n\nJe suis actuellement repass en legacy, il me semblait d'ailleurs tre rest  legacy toute l'anne passe.\nJe crois qu'il est possible que la mise  jour de windows m'ait fait repasser en UEFI (?) Voir mon test avec boot repair.\n\nBref, depuis celle mise  jour Windows, j'ai eu un cran noir et tiret blanc statique.\nJ'ai lu que a pouvait aussi tre un soucis de kernel, et, je me suis empress de revenir en arrire de 2 kernel, sur mon 3eme disque, mais rien n'a chang.\n( Je venais aussi de faire la mise  jour des kernel .. c'tait la journe mises  jour. )\n\nAu menu de dmarrage, j'avais alors toujours l'cran noir au tiret blanc statique.\n\nPress de me dpatouiller en faisant n'importe quoi, j'ai install boot-repair, d'abord sur l'os du disque 3, puis, sur l'os du disque 2.\nUne fois, deux fois, trois fois, mes tests n'ont rien changs, cran noir tiret blanc, et, quatre fois, j'empire la situation, en le testant sur mon linux disque 3 puis encore sur mon linux disque 2 ( dont le disque est partag avec windows 10 ) ( je crois voir d'ailleurs que les partitions sont en gpt ici, il me semble. )\n\n\nLe disque 1 est un disque de stockage. J'avais choisi d'installer le systeme sur le SSD, le disque 2. De rserver le disque 1 plus important au stockage, et, j'ai pris un 3eme disque, pour me servir d'os de secours si jamais.\n\n\nBon, actuellement, dans le bios, en legacy, je ne peux pas mettre mon disque 3 en choix de dmarrage numro 1. ... Ceci explique peut etre le message d'erreur grub rescue.\nAh oui, entre temps, ce n'est plus l'cran noir au tiret blanc, mais, un grub rescue. ( Merci  boot-repair, je crois avoir cocher / dcocher des options EFI )\n( plouf plouf, ah mince, fallait peut tre pas... )\n\nSi je passe en UEFI, je peux choisir le grub de windows ( d'ailleurs, j'ai intall aussi grub2 pour windows pour tenter de rcuprer un multiboot j'ai donc 2 choix de grub windows, grub2win et grub manager windows, carrment deux ... ^ alors que ceux de windows, je n'en veux pas plus que a ... )\nSi je choisi le grub de windows, pas de soucis, je boot direct sur windows, tout a tout a ^ ... sans avoir de dual ou triple choix de boot ( pouasse )\n\nSi je choisi le grub de ubuntu propos, je \" crois \" que je retombe actuellement sur une erreur de grub rescue.\nJ'ai tent de lire le man, mais, les quelques tests effectus avec ls ne me semble pas du tout concluants.\n\nLa seule faon pour moi, actuellement, de lancer mon dualboot ( sans avoir le choix d'option de windows ) ( donc, de choisir entre linux et linux ) est de faire f12 au dmarrage et de choisir le disque 3 du mode legacy. ( il dmarre, et, me propose le choix entre linux du disque 3 et le linux du disque 2, je rappel que le disque 2 est partag avec windows. )\n\n\nJ'aimerais bien ne plus avoir de message d'erreur ( grub rescue ou avant a, cran noire tiret blanc ), quand j'allume ma machine, et, pouvoir choisir un boot linux sans avoir besoin de faire f12 ...\nEt, si j'avais les choix pour linux linux windows, ce serait encore mieux, pour revenir  la situation fonctionnelle.\n\nEn attend, je nage, avec ma boue en forme de f12, pour avoir mon grub de linux et pouvoir accder  mon systme de travail.\nLe Windows, lui, je me moque qu'il soit plac dans le 1er choix de boot en UEFI, je ne le dmarre presque plus, juste, pour faire sa mise  jour ( et voir mon grub mourir. )\nToute fois, j'aimerais toujous encore le garder, ce windows ...\n\nVoil, toi qui a lu le message jusqu'au bout, tu es sacrment courageux. Le pastebin en dbut de message doit racconter la mme chose.\nC'est pas trop grve j'espre.\n\n\nSolution potentielle pour rsoudre ce problme, je me suis dit que je peux installer debian, sur le disque 1 ( ou il n'y a aucun OS. )\nEt, compter sur lui, pour recrer un grub fonctionnel ... Mais, saura t'il trouver Windows galement, automatiquement ?\nCela me ferait 4 Os.\nDisque 1 debian\nDisque 2 Mint / Windows 10\nDisque 3 Mint.",
 "title": ""
}