{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_cracking",
  "kw_leak",
  "kw_down",
  "lg_en"
 ],
 "key": "W6Mn44Q2",
 "pasteDate": "Feb 17, 2018, 11:23:42 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "\tClose enough for Cassandra to feel her warm breath on her bruises, Shiva unleashed a ruthless barrage of blows all across her daughter's body, each one setting off new blasts of pleasure that only got stronger and stronger. They were sloppier and more uneven than the usual punches that Shiva used to beat Cassandra into submission, but they were also a lot stiffer as well. In a moment of clarity amidst the overwhelming bliss of being pummeled, Cassandra realized that the Heavenly Fist didn't work just for blows received. After all, nobody, not even Lady Shiva, could throw punches like those without hurting their hands, even if only a little. With half-closed, hazy eyes, Cassandra peered into her mother's own gaze and all her suspicions were confirmed. There was a wild fire in it, a lustful flame so much different from the dull, controlled embers that usually occupied her eyes. As the blows continued to rain, jerking Cassandra's punished body from side to side, she felt that flame embracing her, slowly burning her being down. And she welcomed it.\n\n\tAfter a dozen more unanswered punches that were dangerously close to driving Cassandra to her knees, Shiva seemed more tired than she'd ever seemed before. She was panting softly but noticeably, and beads of sweat were forming on her forehead, gently cascading down to her full lips which were still cracking a devious smile. Cassandra could only half see her, punch-drunk as she was, but she could feel the exertion, taste the effort her mother was making to keep herself from getting too excited. She was edging herself on Cassandra, delighting on the bolts of joy that flew from her fists to her core with every new strike, and if she'd slowed down her assault, it was only to savor it more. To urge her on, Cassandra lifted her arms to at least try like she was about to fight back, and Shiva responded with a sharp yell and an even sharper uppercut that plowed into her daughter's sternum.\n\n\t\"Kahh!\" Cassandra spat out, along with a short shower of spit that landed on Shiva's shoulder, and almost immediately went limp around her fist. It stayed on her, pretty much the only thing keeping her upright, until Shiva stepped back and removed her hand as if she were pulling a sword out of a slain enemy. Cassandra fell to her knees with a gasp and her forehead soon crashed into the ground, further rattling her already battered brain. Lying there, curled up into a ball with her butt sticking out and her face kissing the stone floor, humiliated beyond measure, Cassandra trembled on the edge of an orgasm. She was going to lose, and she was going to lose badly, but she was well beyond caring.\n\n\tGroping herself with shaking hands, Cassandra brought her fingers close to her completely soaked sex and let out a shrill whimper as they grazed her clitoris. She could feel the drool running from her mouth on her cheek, mixing with her own sweat and a string of blood that'd begun to leak out of her, and that only made her want to explore her lower wetness even further. But just as she was about to plunge her fingers inside of her, she felt a crushing force come down their tips, pining them and her whole hand down on the floor with an ecstatic sensation that almost made her come right there.\n\n\t\"Pitiful,\" her mother breathily growled as she stepped on the bit of fingers she could see poking from between her legs. \"Would you really end it all so quickly? My dear daughter, I have hardly even begun to break you.\"\n\n\tShiva's voice had taken in a raw, unhinged tone that sent ripples of damp fear across Cassandra's back. Without letting go of her daughter's fingers, she bent down and reached around Cassandra's back to grab her forearms. Once she'd found them and clamped them in with hands that felt like a pair of iron vises, Shiva lifted her foot and pulled back on her daughter's arms, forcing her into an upright kneeling position. And when she was there, she placed one stiff knee of her own right in the middle of Cassandra's sweaty, toned back, and slowly began to pull on her arms with just the right amount of force to get a rousing cry of endless joy from her daughter's slack-jawed mouth.\n\n\tIf Cassandra had retained enough awareness through the storm of pleasure that raged through her arms all the way to her sockets, she would've been impressed by how Shiva seemed to instinctively know the precise moment to stop pulling and give her daughter a moment to breathe, in order to keep her always inches away from her orgasm. But in her current state, all she could do was ride the ecstasy that washed over her every time she was stretched to her literal breaking point, and steal as much air as her overworked lungs would hold when Shiva eased off. Three, four, five times Shiva applied the sadistic hold, and every time Cassandra screamed louder, howling madly into the sun and scaring away the few birds that remained in the treetops. Her arms could've been popped clean off her shoulders, even ripped out of her body right then and she wouldn't have minded -- if anything, she would've welcomed it, as pain of that magnitude would've surely made her come. But Shiva had made her intentions clear. This was going to last exactly as long as she so desired, and not one second less.\n\n\tSensing her daughter going limp in her hands, Shiva gave her back one last tug, then stepped on it with her foot and kicked it lightly to the ground. Cassandra fell unceremoniously, sprawled on the stone slick with her own sweat and saliva, seeing bright spots in the parts of her view that weren't completely blacked out. Desperate to get herself off, she tried to move her hands only to find her entire body was one big dead weight. She couldn't even move her legs or her hips, so numb and unresponsive her limbs had become. To be so close and so far filled her with resigned despair. So when Shiva used her foot to turn Cassandra around and onto her back, the first thing she saw where tears rolling down her daughter's crystallized eyes.\n\n\t\"You are not getting off so easily, Cassandra,\" Shiva taunted her as she stepped roughly on her naked breasts, the stiff nipple digging into her sole, \"but perhaps I will.\"\n\n\tFrom the depths of near unconsciousness, Cassandra watched in slow motion as Shiva twisted her leg, kneading her smashed chest under her foot and making her groan pathetically, but also giving her a full view of her naked crotch. Her mother's fluids were pouring out from inside her lips, giving them a glistening sheen that made Cassandra's mouth water. She wanted nothing more in life than to get up, to shove her face between her mother's legs, and drown in her sweet juices, but even if Shiva hadn't been stepping on her, Cassandra doubted she had strength left to even move her neck. And so she stayed there, spread-eagled and helpless, consumed with desire as she watched her mother begin to rub herself off.\n\n\tTowering over her defeated daughter, Shiva cooed and moaned with delight as her fingers ran up and down her labia. She could feel Cassandra's heart pounding itself to oblivion under her foot, and see the lewd thirst in her eyes, and even when she finally slid her index and middle finger inside of her, that miserable look of dejection on her daughter's face remained the strongest turn-on. She needed to be careful, especially with her qi amplifying her pleasure tenfold, to not go overboard and just come on her. She still had so much planned for the afternoon. And so, when she felt her back stiffening and her toes beginning to shake, Shiva stopped, gave Cassandra a grin, and stepped off her.\n\n\t\"Not yet,\" she whispered as she walked away, trying to catch her breath. \"Not just yet.\"",
 "title": "Draft 1"
}