{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "kw_threat",
  "kw_vulnerable",
  "kw_kills",
  "lg_en",
  "kw_attackers"
 ],
 "key": "wBjGcRBM",
 "pasteDate": "Feb 21, 2018, 10:27:11 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "As many of you who have been playing 5th Gen Ubers for a while now know, balanced and stall teams have been the most prominent teams used for a while now. Although offensive teams are just recently starting to climb in popularity again, there's still plenty to explore about the playstyle, heavy offense and hyper offense in particular.\n\nDeoxys-S @ Focus Sash\nPressure\nTimid 252/0/4/0/0/252\n- Spikes\n- Stealth Rock\n- Taunt\n- Magic Coat / Hidden Power Fire\n\nMeet Deoxys-S, the face of offense... or at least it used to be. Deoxys-S no longer has the stranglehold over Ubers that it once did (mostly because of Team Preview), but it is still one of the best options available for a team that wants a lot of hazards quickly. Deoxys-S is almost guaranteed to get up at the very least Stealth Rock or a layer of Spikes, and usually more. Taunt, Magic Coat, and Hidden Power Fire can all act as deterrents to attempts to set up hazards alongside Deo-S, particularly from Ferrothorn and Forretress, the latter of whom can spin away all of those hard-earned hazards.\n\nDeoxys-S @ Light Clay\nPressure\nTimid 252/0/4/0/0/252\n- Light Screen\n- Reflect\n- Spikes / Stealth Rock\n- Taunt / Magic Coat / Stealth Rock\n\nDeoxys-S also fills another important role for heavy and hyper offense teams. It is the fastest user of dual screens in the game, making it very difficult for the opponent to prevent at least one screen from going up. Dual screens (and possibly entry hazard support) from this set makes setting up with sweepers much easier, and often leaves the opponent scrambling to come up with an answer.\n\nDeoxys-A @ Life Orb / Focus Sash\nPressure\nRash \n- Psycho Boost\n- Superpower / Low Kick\n- Thunder / Hidden Power Fire / Grass Knot\n- Spikes / ExtremeSpeed\n\nDeoxys-A, on the other hand, is all about power. It can consistently force switches, and take advantage of those switches to throw down a layer of Spikes, putting even more pressure on the opponent. The moves given are all up to personal preference. Would you rather have Kyogre out of the way or do you want Ferrothorn gone? Do you want hazard support or a way to revenge kill a weakened Arceus? The choice is up to you. The choice of item is also important too. Life Orb makes Deo-A brutally powerful but easy to kill, while Focus Sash gives a nearly guaranteed hit or layer of at the cost of some power. \n\nArceus @ Life Orb / Silk Scarf\nMultitype\nAdamant 112/252/0/0/0/144\n- Swords Dance\n- ExtemeSpeed\n- Shadow Claw\n- Earthquake / Brick Break / Recover\n\nArceus is hands-down one of the most threatening physical sweepers in the game. Stopping this monster without a dedicated physical wall or specialized revenge killer is almost impossible, and it is itself the biggest threat to hyper offense. It's certainly not invincible, but it fits in right at home in a physically oriented hyper offense team.\n\nMewtwo @ Life Orb\nPressure\nTimid 4/0/0/252/0/252\n- Calm Mind\n- Psystrike\n- Ice Beam \n- Fire Blast / Aura Sphere\n\nMewtwo was always a dangerous offensive force, but Psystrike brought it to a whole new level. Not much is stopping a Mewtwo backed by good prediction. It's vulnerable to priority and physical Scarfers, but can be an absolute menace agaisnt stall teams. Speaking of menaces to stall teams...\n\nDarkrai @ Life Orb / Focus Sash\nBad Dreams\nTimid 4/0/0/252/0/252\n- Nasty Plot\n- Dark Pulse\n- Focus Blast\n- Dark Void\n\nMeet Darkrai, the bane of stall. Like Mewtwo it was weekened by the increase of usage of ExtremeSpeed, but like Mewtwo it is still pretty damn the deadly. Its moveset is extremely straightforward and simple, and when brought in at the right time can cripple or kill at least a few mons. \n\nRayquaza @ Life Orb\nAir Lock\nJolly 0/252/4/0/0/252\n- Dragon Dance\n- Outrage\n- ExtremeSpeed\n- Earthquake / Overheat\n\nRayquaza can be a very destrucive force. ExtremeSpeed Arceus put a bit of a damper on it, and Scarf Palkia and Scarf Terrakion are both common, but +1 Outrages still hurt like hell. You need to be careful when using it, but it can nab 2 or 3 kills when played correctly.\n\nSalamence @ Life Orb\nIntimidate\nNaive 0/40/0/216/0/252\n- Dragon Dance\n- Outrage\n- Fire Blast\n- Draco Meteor\n\nMeet Salamence, meant specifically for partnering with Rayquaza in the famous Double Dancer combination. Mence can act as an effective lure for Rayquaza's regular counters. Groudon does not like taking a Draco Meteor to the face, for example. It also speed ties with Choice Scarf Palkia, meaning that you can take it out on a 50/50 chance, something Rayquaza greatly appreciates.\n\nIf you're going to use Mence then you need to dedicate your team to the combination. Entry hazards, Wobbuffet, and dual screens should all be included. A reliable way to deal with Extremekiller Arceus is also needed, such as the one below.\n\nTerrakion @ Choice Scarf\nJustified\nJolly 4/252/0/0/0/252\n- Close Combat\n- Stone Edge\n- X-Scissor\n- Earthquake\n\nHyper offense often has serious issues with Extremekiller Arceus, a problem Terrakion helps to alleviate. It also handles dangerous sweepers such as Mewtwo, Darkrai, etc. A Scarf set certainly isn't all Terrakion can use, but I think I'll leave that up to other posters to talk about.\n\nCloyster @ Life Orb\nSkill Link\nNaive 0/232/0/32/0/244\n- Shell Smash\n- Icicle Spear\n- Hydro Pump\n- Rock Blast\n\nCloyster is the epitome of hyper offense in Ubers. It's a bitch to set up, but once you manage to get that Smash off something is probably going to die. The top Ubers walls are almost all hit for super effective by Cloyster's mighty STAB move, and all are OHKOed after a boost. The only things that can effectively stop this set without too much collateral damage are physically defensive Kyogre / Manaphy / Ferrothorn, and ExtremeSpeed Normal Arceus. Otherwise you just have to hope that you can wear it down from LO recoil and then finish it off with weaker priority.\n\nThis set needs to have focused team support. Slapping it on any team is going to get you nowhere. It needs at a minimum a partnered Kyogre and a layer of Spikes to get through specific checks, such as Steel Arceus or specially defensive Ferrothorn. Dual screens Wobb support are also recommended. Speaking of which....\n\nWobbuffet @ Leftovers\nShadow Tag\nBold 28/0/252/0/228/0\n- Encore\n- Counter\n- Mirror Coat\n- Charm / Tickle / Safeguard\n\nWobbuffet is as good as it gets when supporting set-up sweepers. It can lock an opponent into a non-threatening move with Encore, making set-up by a partner virtually riskless. It can also deal with pesky Choice Pokemon through CounterCoat, and can also cripple physical attackers with Charm (Tickle if you have Pursuiter support) or block status with Safeguard, making set-up all the more easy.\n\n------\n\nWell, I've purposefully left some obvious sets off the list, to promote discussion. Feel free to post your own offensive sets or comment on the ones here or posted by others, but be sure to provide plenty of reasoning. I am not looking for one-liners, and I will be keeping a very close eye on this thread. That said, feel free to speak your mind. Tell us why you like hyper offense or so-and-so mon, or why you don't, or what works to stop so-and-so sweeper or break so-and-so wall. Fire away!",
 "title": ""
}