{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_attacking",
  "kw_attack"
 ],
 "key": "we1cs7bf",
 "pasteDate": "Feb 26, 2018, 1:16:45 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "have you heard from either of them or nah jw\nLittleBigness - Today at 9:47 PM\nI haven't had time to talk to them\nDarkDevil26 - Today at 9:47 PM\nnw youre good\nLittleBigness - Today at 9:47 PM\nI've been so busy with battles today I'm just gonna focus on recording tomorrow\nDarkDevil26 - Today at 9:48 PM\ni hate to sound like a dick but please try to get as many in this week as you can, otherwise theyll become unexcused\nLittleBigness - Today at 9:48 PM\nThat's the plan\nDarkDevil26 - Today at 9:48 PM\nbelieve me im not trying to be a dick at all\nits just yeah\nLittleBigness - Today at 9:48 PM\nYeah ik we just gotta keep moving\nImma do the best I can but I've definitely felt a lack of help. Not gonna lie to you on that one\nDarkDevil26 - Today at 10:02 PM\nim not trying to make an excuse as to why ive dropped the ball of late believe me i have 100% dropped the ball with recording for people but\n\nIBL\nPMC\nNPA Analyst\nCollege\nHomework\ncan only record on weekends\nill try and get my shit together\nLittleBigness - Today at 10:05 PM\nYeah the big thing is that I feel like you gotta factor in that I'm already in a deep hole and have NEEDED help\nAnd I've gotten nearly none\nEven when I've asked you\nWhen I've asked Kurt\nEveryone really\nThe only person who's really helped me at all is Pablo genning for me\nDarkDevil26 - Today at 10:07 PM\ni understand your frustrated but @ the cap card holders in chat in the recording requests room, i havent seen you do that, you ask and if one person cant you give up\njoseph and caleb have come running to help whoever is in need\nLittleBigness - Today at 10:08 PM\nThe problem is you and Kurt have said \"yeah I'll get to it eventually\"\nAnd then you don't\nYou get my hopes up and don't follow through\nAnd then when I assumed it's been done it isn't done and it's too late\nSo I'll tell Kurt the same thing, but if you say you'll do something to me, I expect you to do it just as much as you'd expect me to do something I say I'll do\nAnd when it doesn't happen it's tough for me to recover\nIf you want me to never ask you for help again because it ain't gonna work out for you and you're gonna keep blowing off my requests, then I won't ask anymore\nBut this is how it is\nDarkDevil26 - Today at 10:10 PM\nbut then i have let you know i cant do it\nLittleBigness - Today at 10:10 PM\nWhen its too late\nYou say you will\nAnd then you blow me off\nThat's what happens\nYou never tell me in advance you can't do it\nDarkDevil26 - Today at 10:12 PM\n1. its not too late, i tell you sundays you can upload mondays too @ the cap card holders and boom problem solved\n\n2. i have said i will yes, but every single time i have said i cant due to problems with my schedule, people have HOUNDED me to record games for them and i cant record for the entire community every weekend\n\n3. I dont blow you off i say, \"sorry man i cant do it something came up\"\nLittleBigness - Today at 10:14 PM\n1. You've never told me to @ cap card holders until now\n\n2. You do say yes and maybe you're saying yes too much. Put a limit on how much you can record and send people to others who will be more reliable. Also maybe factor in who talks to you first and who needs help the most.\n\n3. That's exactly my point. You tell me you can't do it anymore when I've put all my faith in you to help me out. It wouldn't be an issue if it was just once, but it happens consistently and I'm always forced to go back to square 1\nDarkDevil26 - Today at 10:17 PM\n1. people have been @'ing the cap card holders since the beginning of the season, why havent you noticed? im not trying to be a dick again but how can you miss that\n\n2. as far as im aware, youre not the only person ive had to tell that i couldnt record for them, they were cool with it, they immediately went to someone else\n\n3. i said multiple times i would be extremely busy doing college, so putting your faith in me was the absolute wrong thing to do\n\nI will take responsibility for not being consistent, however you should have checked recording requests and theres really no way around missing that chat since its right below the genning one\nLittleBigness - Today at 10:21 PM\nI don't go to the genning chat because your genners are for the most part pieces of shit and haven't helped me one bit. Pablo is the only good one, so I just go directly to him. If you're so busy, don't take so many recording requests. Also, when it comes to people recording battles, I was told back in the IPBL to not trust that chat at all because it wasn't productive. I was never told it improved, so I avoided the chat. It is a conflicting message for someone in my shoes. I will go there in the future since you're absolutely horrible at taking requests and it's all because you're putting too much pressure on yourself. It's very sad to see you putting yourself in this situation. So tell me that I shouldn't notice that chat again when it's never helped me one bit. And also stop saying \"not trying to be a dick\" because at the end of the day, you're being a dick. I know I am too, but I take responsibility for it and I'll keep fighting fire with fire if that's what it takes.\nDarkDevil26 - Today at 10:22 PM\nalright there is absolutely no need at all for half of that nonsense\npeople have absolutely no respect for recorders\nits disgusting\nim sorry drew that i cant drop everything and cater to you\ni have a life\nyou have a life\nLittleBigness - Today at 10:22 PM\nWell I haven't had a reason to respect the recorders because I've never been helped\nDarkDevil26 - Today at 10:23 PM\nso youre saying all the recorders are ass because two just happen to busy af(edited)\nLittleBigness - Today at 10:23 PM\nAnd I know you can't drop everything, but I ask multiple days in advance and no help comes to me when I'm the one who's super behind and you know that\nAnd that's not what I'm saying\nDarkDevil26 - Today at 10:23 PM\nit is\nhow do you think people have been uploading?\nthis is such bs\nLittleBigness - Today at 10:24 PM\nI'm saying my experience in your league has taught me that requesting recordings in that chat has never been reliable, and apparently it became reliable when I quit looking at it since I've had no reason to check it\nThis isn't bs\nDarkDevil26 - Today at 10:24 PM\ni try to be nice to you\nLittleBigness - Today at 10:24 PM\nYou just say that because you don't wanna deal with me\nDarkDevil26 - Today at 10:24 PM\nand you attack me\nofc i dont want to deal with you\nLittleBigness - Today at 10:24 PM\nYou came for me first lmao\nDarkDevil26 - Today at 10:24 PM\nyou approached me horribly\nEXCUSE ME\nno\nLittleBigness - Today at 10:24 PM\nYou're just digging your own hole\nDarkDevil26 - Today at 10:24 PM\ndone with this conversation\nnope\nstop typing\nLittleBigness - Today at 10:25 PM\nYou're such a whimp\nThis is pathetic\nDarkDevil26 - Today at 10:25 PM\nthrowing insults\nLittleBigness - Today at 10:25 PM\nYou're running a league and you can't help support when I'm asking nicely at all\nDarkDevil26 - Today at 10:25 PM\nyou think this is asking nicely?\nLittleBigness - Today at 10:25 PM\nAnd when I say I got a problem with what I'm doing you blame me for not knowing what else to do\nIt got mean when you took it mean\nDarkDevil26 - Today at 10:25 PM\ndude i took responsibility for it\nLittleBigness - Today at 10:26 PM\nYou didn't\nDarkDevil26 - Today at 10:26 PM\nand yet you continued to go at me'\nLittleBigness - Today at 10:26 PM\nYou blamed it all on ME\nIM the one who should've known better\nDarkDevil26 - Today at 10:26 PM\nDarkDevil26 - Today at 10:17 PM\n1. people have been @'ing the cap card holders since the beginning of the season, why havent you noticed? im not trying to be a dick again but how can you miss that\n\n2. as far as im aware, youre not the only person ive had to tell that i couldnt record for them, they were cool with it, they immediately went to someone else\n\n3. i said multiple times i would be extremely busy doing college, so putting your faith in me was the absolute wrong thing to do\n\nI will take responsibility for not being consistent, however you should have checked recording requests and theres really no way around missing that chat since its right below the genning one\nLittleBigness - Today at 10:26 PM\nIM the one who should've figured it out when I've had no instructions\nDarkDevil26 - Today at 10:26 PM\nDarkDevil26 - Today at 10:17 PM\n1. people have been @'ing the cap card holders since the beginning of the season, why havent you noticed? im not trying to be a dick again but how can you miss that\n\n2. as far as im aware, youre not the only person ive had to tell that i couldnt record for them, they were cool with it, they immediately went to someone else\n\n3. i said multiple times i would be extremely busy doing college, so putting your faith in me was the absolute wrong thing to do\n\nI will take responsibility for not being consistent, however you should have checked recording requests and theres really no way around missing that chat since its right below the genning one\nLittleBigness - Today at 10:26 PM\nYeah look at before that\nYou were an ass\nYou're still an ass\nI know I'm an ass at least\nI didn't know better\nDarkDevil26 - Today at 10:26 PM\nexplain to me how im an ass for having a life\nLittleBigness - Today at 10:27 PM\nAnd you are assuming I should know better\nDarkDevil26 - Today at 10:27 PM\nand having other shit to do\nLittleBigness - Today at 10:27 PM\nYou're assuming that I should know how to go back to an old method that didn't work when I was instructed not to use that old method\nAnd saying I disrespect recorders when I've had no reason to respect them\nDarkDevil26 - Today at 10:28 PM\nbut why should i have to tell you everything? why cant you figure it out for yourself\nwhy couldnt you take the 2 seconds to click the recording room and see what was happening\nyou didnt\ndo yk why?\nbecause you assumed\nNEVER ASSUME\nLittleBigness - Today at 10:29 PM\nI need instruction to figure out what to do\nDarkDevil26 - Today at 10:29 PM\nthan thats your problem\nLittleBigness - Today at 10:29 PM\nThat's just how people are\nDarkDevil26 - Today at 10:29 PM\ndont make your problem my problem by attacking me\nLittleBigness - Today at 10:29 PM\nIts my problem that I've been searching for solutions and asking everyone to record\nIts my problem that when I get told you just speak rudely to me and tell me I should know better\nDarkDevil26 - Today at 10:30 PM\nBrendan - Today at 10:27 PM\n@Admin drew is currently attacking me in pms because of the lack of help hes been getting with recordings\nToGOATdemaru - Today at 10:28 PM\nI gave him his W2 duiring W2, and I gave it like a week and he never got it\nAnd I never see him ask for other recordings\nI dont record for people normally, i did cause you were busy, so if he wants to bitch thats his problem\nFather Ash The Elder - Today at 10:29 PM\nHe's never asked in recording requests\nToGOATdemaru - Today at 10:29 PM\n^^\nNEW MESSAGES\nFather Ash The Elder - Today at 10:29 PM\nThat's entirely on him we have multiple people that record almost automatically\nToGOATdemaru - Today at 10:29 PM\nJoe is always on it\nFather Ash The Elder - Today at 10:29 PM\nI've never waited more than 45 minutes for a recording\nLittleBigness - Today at 10:30 PM\nIts my problem that I'm told that chat shouldn't have existed in the first place\nDarkDevil26 - Today at 10:30 PM\nthey are saying the same exact thing i am\nbut again",
 "title": ""
}