{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_patches",
  "lg_en",
  "kw_dropping"
 ],
 "key": "WZ7s2L1P",
 "pasteDate": "Feb 28, 2018, 1:15:40 AM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Oranges\n\n(hold up an orange) What is this? What does it signify? Where did its name originate: was it named after someone? Is it a color also? To answer these questions, I will be talking about oranges. Firstly, I will discuss where the name of the color/fruit originated. Then, I will talk about why this fruit is the best fruit. Finally, I will demonstrate some strategies for peeling oranges.\n\n\tAccording to the Oxford Dictionary, the name orange originated from the old French word orenge. In the 1300s, the word migrated into English (from Mental Floss). This comes from the Italian word melarancio, meaning fruit of the orange tree from Word Histories and Mysteries and The American Heritage Dictionary of the English Language. These all refer to the fruit, but it's believed that the color became a part of the English language 200 years later in the 1500s. This was apparently due to to the fact that people had no reason to refer to the color besides the fruit. Besides that they referred to the color as yellow-red, which I personally find completely absurd and disrespectful to the fruit. On a side note, all of this has nothing to do with the place Orange, which was from a Roman-Celtic settlement, according to Dictionary of the Roman Empire.\n\n\tMoving on to why the orange is clearly the best fruit: first of all, it only has 45 calories compared to the banana with 107, the apple having 95, and the grape having 62 (according to the USDA). This shows its dominance by its clear lack of calories compared to most other fruits. It is also rich in vitamin C, which not many other fruits can boast about. Its texture is very unique compared to other fruits because of its layers. If it is dropped, it does not get as easily damaged or dirty, as other fruits do, because of its orange colored peel. This means it is much easier to carry around than other fruits because it is much less fragile and dropping it is far less detrimental. Also, if the peel is clean, the peel is also edible, giving you more fruit for the same amount of money.\n\nFinally I will go through some strategies for opening oranges. To open the orange, many people try to stab it with their fingernail in the middle, but that is an inferior method. Opening it that way can cause you to pierce one of the slices before its in your mouth, which gets juice on your hands and it makes your hands sticky. To prevent this, you should open it from the top, which makes it much easier and cleaner to open, compared to continually stabbing it. Once you have a gash in the peel, you can go with a multitude of methods, of which I will mention 3. The first option is to unravel it into a spiral, which is difficult but comes out with the coolest result. Secondly, you can take away patches of the orange peel and separate them from the orange. Lastly, you can remove it in circular layers by peeling pieces of it in circular shapes and that can make for a very cool peel as well.\n\nI have discussed the origin and etymology of the orange, the reasons it is clearly superior to other fruits, and how to peel oranges in the most effective and cool ways. This will hopefully help you in your time of need when you want to pick out a fruit or peel an orange.",
 "title": ""
}