{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_es",
  "re_url"
 ],
 "key": "XtGa1Ubi",
 "pasteDate": "Feb 11, 2018, 10:53:46 PM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "[areatexto3=white]\n[CENTER][IMG]https://files.ls-rp.ovh/imagenes/logos/justicia_mediano.png[/IMG][/CENTER]\n[HR][/HR]\n\n[CENTER]Con el fin unificar la forma de actuar para todos los agentes de la autoridad de los cuerpos y organismos dependientes del departamento de justicia se establecen unos parmetros, pautas y directrices a seguir por parte de todos.[/CENTER]\n[HR][/HR]\n[LIST]\n[*] Existe una orgnica y jerarqua en el departamento de justicia la cual se debe cumplir y respetar a rajatabla. \n\n[CENTER][IMG]http://i.imgur.com/ozA37Vf.png[/IMG][/CENTER]\n\n[*] Cualquier miembro de la categora \"Cpula\" podr sancionar a otros miembros de la categora inferior, la sanciones a los miembros de la categora cpula sern impuestas por su inmediato superior jerrquico o el jefe del departamento de justicia.\n\n\n[*] Cuando se este llevando a cabo una asignacin o tarea propia de cada organismo la mandara el rango mas alto que en ese momento se encuentre en el mismo lugar, si llegara mas tarde otro rango de mayor graduacin este pedir explicaciones al que actualmente esta al mando (Hacen un pequeo relevo de mando) y tomara el control siempre y cuando la situacin lo permita. \n\n\n[*] La jurisdiccin de un agente de la autoridad dependiente del departamento de justicia ser en todo el territorio de San Andreas, respetando siempre y cuando a las autoridades locales de cada zona.\n\n\n[*] Existen diversas prioridades asignados a diferentes organismos dependientes del departamento de justicia las cuales se debern respetar por todos los integrantes, se atendern la prioridad de otro organismo siempre y cuando este no pueda atenderla.\n\n[LIST]\n[*]El departamento de Polica de Los Santos (LSPD) tiene como prioridad la ciudad de Los Santos.\n[*]El departamento del Sherifff de San Andreas tiene como prioridad el resto del territorio del estado de San Andreas.\n[*]El departamento de Correccionales de San Andreas (DCSA) tiene como nica prioridad las instalaciones penitenciarias, de forma excepcional participaran por todo el territorio cuando se est buscando a un REO fugado.\n[*]El Ejrcito de San Andreas (SATA) tiene como prioridad todo el territorio del estado de San Andreas en los casos de trficos de armas o drogas que lleguen, tambin tienen total potestad en el caso de que alguien trate de acceder de forma ilcita en alguna de sus instalaciones.\n[/LIST]\n\n\nLa atencin en lo que respecta a avisos de muerte, centralita, informes, avisos de alarma de robo de vehculos, casas, negocios, viviendas etc.. se realizara siempre respetando esta prioridad, salvo en un caso y es que una unidad este mas prxima al lugar del aviso la cual deber atender el mismo garantizando de esta forma una rpida atencin a todos los ciudadanos y mejorando los tiempos de respuesta de todos los organismos.\n\nExiste una frecuencia (canal de radio) reservado a LSPD y SASD para garantizar una ptima comunicacin entre los organismos. [B]Habr que informar por esta frecuencia (/j)[/B] cuando se vaya a responder a cualquier aviso de prioridad .\n\nA continuacin, el mapa detallado con las diferentes prioridades (LSPD = Azul) (SASD = Marrn):\n\n[IMG]http://i.imgur.com/AyFmWyP.png[/IMG]\n\n\n[*] Cualquier persecucin que se inicie ([B]254V[/B]), se deber dar parte obligatoriamente por la frecuencia que incluye a LSPD y SASD recibiendo el aviso todas las unidades, las unidades disponibles se unirn en la persecucin respetando las pautas para las mismas.\n\n(Todo el mundo se mover a uno de los canales en el TeamSpeak 3 habilitados a tal efecto (Frecuencia PD/SD) para una correcta coordinacin)\n\n\n[*] Existe una diferenciacin visual en las unidades y ropa de LSPD y SASD. \n\n[B]Vehculos[/B]\n[LIST]\n[*]Los vehculos rotulados con LSPD pertenecern de forma nica y exclusiva a LSPD y solamente sus miembros debern usarlos.\n[*]Los vehculos rotulados con SFPD pertenecern de forma nica y exclusiva a SASD y solamente sus miembros debern usarlos.\n[*]Los dems tipos de vehculos que dispone el departamento de justicia sern compartidos por todos los organismos.\n\n(Los integrantes de las unidades CIU, S.W.A.T, DSA podran coger vehiculos reservados de forma exclusiva a un organismo siempre y cuando se dispongan a patrullar en conjunto con otro integrante de su unidad que sea de ese organismo)\n[/LIST]\n\n\n[B]Uniformes[/B]\n[LIST]\n[*]Los uniformes de color negro sern usados de forma nica y exclusiva por los miembros de LSPD.\n[*]Los uniformes de color cafe/marron sern usados de forma nica y exclusiva por los miembros de SASD y DCSA.\n[*]El resto de uniformes y vestimentas que dispone del departamento de justicia sern compartidos por todos los organismos\n[/LIST]\n\n\n[*] Se aadirn una serie de Whispers, los mnimos posibles, para mejorar la comunicacin y trabajo conjunto entre todos los organismos.\n\n\n[*] Criminal Intelligence Unit [B](CIU)[/B] es una unidad del departamento de justicia, tiene jurisdiccin en todo el territorio del estado de San Andreas, siendo el principal organismo de investigacin del departamento de justicia.\n\nEl CIU est formado por integrantes provenientes de los diversos organismos del departamento de justicia, sus instalaciones principales se encuentran en la comisaria del SASD en Dillimore.\n\nLos integrantes de esta unidad pasaran a denominarse detectives salvo en casos especiales, su prioridad mxima ser la de atender los diferentes casos o tareas que esta unidad lleve, en caso de no tener ningn cometido podrn integrarse como una unidad ms en sus respectivos departamentos.\n\nCuando una asignacin sea del CIU sern ellos los que manden en la misma independientemente del rango de los que estn apoyando debern obedecer al Detective que lleve la asignacin.\n\n\n[*] Special Weapons And Tactics [B](S.W.A.T)[/B] es una unidad del departamento de justicia, tiene jurisdiccin en todo el territorio del estado de San Andreas, siendo el nico organismo encargado de atender los allanamientos, operaciones especiales o tcticas que se requieran as como los casos de terrorismo o secuestro con rehenes o sin ellos.\n\nEl S.W.A.T est formado por integrantes provenientes de los diversos organismos del departamento de justicia, sus instalaciones principales se encuentran en la comisara de LSPD en el N 72 de Verona Beach.\n\nSu prioridad mxima ser la de atender los diferentes casos o tareas que esta unidad lleve, en caso de no tener ningn cometido podrn integrarse como una unidad ms en sus respectivos departamentos.\n\nCuando una asignacin sea del S.W.A.T sern ellos los que manden en la misma independientemente del rango de los que estn apoyando debern obedecer al encargado del S.W.A.T que lleve la asignacin.\n\n\n[*] Divisin de Soporte Areo [B](DSA)[/B] es una unidad del departamento de justicia, tiene jurisdiccin en todo el territorio del estado de San Andreas, siendo el nico organismo encargado de dar apoyo a los diferentes organismos o cuerpos a travs del Aire.\n\nEl DSA est formado por integrantes provenientes de los diversos organismos del departamento de justicia, sus instalaciones principales se encuentran en la base naval del SATA en Ocean Docks.\n\nSu prioridad mxima ser la de apoyar a los otros organismos o unidades por el aire en lo que puedan necesitar, en caso de no tener ningn cometido podrn integrarse como una unidad ms en sus respectivos departamentos.\n\n\n[*] El departamento de justicia contempla que en LSPD y SASD existen unas unidades/divisin dedicadas al control del trfico denominadas Divisin Metropolitana de Transito (DMT-LSPD) San Andreas Highway Patrol (SAHP-SASD), estas sern las responsables de las diferentes tareas relacionadas con el trfico y su control.\n\n\n[*] El departamento de justicia dispone de una academia, en esta academia se preparan todos los futuros integrantes, la academia est formada por personal de todo el departamento de justicia.\n\nLa academia se abrir para cubrir las diferentes plazas propuestas en cada promocin que se necesiten en los diferentes organismos del departamento de justicia, salvo casos excepcionales la academia abrir una vez al mes. \n\n\n[*] La direccin del departamento de justicia se reunir con todos los organismos dependientes del mismo cada 2 meses salvo casos excepcionales.\n[/LIST]\n[HR][/HR][/areatexto3]\n[CENTER]\n[/CENTER]",
 "title": ""
}