{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_target",
  "kw_attacked",
  "kw_attacks",
  "lg_en",
  "kw_attack"
 ],
 "key": "XuUqWbZU",
 "pasteDate": "Feb 18, 2018, 2:32:02 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Dimsparkle Template:\n\"Dimsparkle\" is an acquired template that can be added to any fae. The creature (referred to hereafter as the base creature) must have a Charisma score of at least 12.\n\nSize and Type: Same as the base creature. A dimsparkle's type changes to Undead and it gains the Incorporeal subtype.\nHit Dice: All current and future HD become d12s.\nSpeed: All dimsparkles have a fly speed of 50ft with perfect maneuverability.\nArmor Class: A dimsparkle loses any natural armor it has, but applies it's Charisma bonus as a deflection bonus to its armor class.\nAttack: A dimsparkle retains all the attacks of the base creature.\nFull Attack: A dimsparkle full attacks as per the base creature.\nDamage: A dimsparkle uses its Charisma modifier in place of its Strength modifier when determining damage dealt with a melee weapon.\nSpecial Attacks/Qualities(all DCs use the following formula: 10 + 1/2 the dimsparkle's hit dice + the dimsparkle's Charisma modifier)\nHunter of the Ring(Su): Dimsparkles intuitively know the general location(accurate up to a 10 mile radius and distance to the Ring whenever it is held or worn by a living fae. This effect functions even if the Ring is wrapped in cloth or otherwise does not touch the skin of a living fae, and continues to function so long as a fae counts it among his/her belongings.\n\nSparkle Harming Blade(Su): The grim weapons wielded by a dimsparkle causes grevious wounds to living fae. Any weapon wielded by a dimsparkle immediately counts as a Faebane weapon. A dimsparkle may take 24 hours to taint the weapon with his spiritual presence. Any fae hit by a weapon tainted by a dimsparkle must make a Fortitude save or take a point of Constitution damage.\n\nIf a dimsparkle loses, drops or otherwise misplaces his weapon it retains the taint of the dimsparkle's presence for 1 hour per HD of the dimsparkle. Any living fae that touches a weapon tainted by a dimsparkle must make a Fortitude and a Will save. If the living fae fails its Fortitude save then it takes 1d6 points of CON drain per hour until the weapon is dropped. This drain may not reduce the fae's CON score below 1. If a living fae fails its Will save then it is rendered panicked and drops the weapon automatically. All penalties are removed when the tainted weapon is dropped.\n\nDraining Touch(Su): The touch of a dimsparkle drains the sparkle from the living. As a full-round action a dimsparkle may attempt a melee touch attack against a living fae. If it succeeds, the target gets a Fortitude save. If the target fails its Fortitude save then it takes 1d4 points of Charisma damage. A fae drained to 0 Charisma is destroyed and converted into sparkles equal in worth to 1000 gp x its HD.\n\nFrightful Scream(Su): A dimsparkle can emit a frightful scream as a standard action. All living fae within a 30-foot radius around the dimsparkle must make a Will save or be panicked for a round. This is a sonic necromantic mind-affecting fear effect. A creature that successfully saves against a frightful scream is immune to further frightful screams for 5 rounds. A dimsparkle may only make a frightful scream every 1d4+1 rounds.\n\nPhysical Presence(Su): At will a dimsparkle may touch and manipulate physical objects as if it were a corporeal creature of its size. A dimsparkle uses its Charisma score for any effects requiring a Strength score, and to determine how much it may carry. Activating or deactivating this ability is a swift action. A dimsparkle may be attacked and damaged as per a physical creature as long as this ability is active.\n\nBy the Queen's Will (Su): If a dimsparkle is reduced to 0 HP it is \"destroyed\". A dimsparkle destroyed in this manner cannot be harvested for sparkles except by the Queen, and even then only in person. The dimsparkle will reform 1d4+1 hours later at full health unless the Ring of Dimsparkles is destroyed in the meantime. The only way to permanently destroy a dimsparkle is by destroying the Ring of Dimsparkles.\n\nFavored Enemy(Fae) +2 (Ex): As per Ranger's Favored Enemy.\n\nTurn Immunity (Ex): A dimsparkle may not be turned(as per Turn Undead) unless the cleric is of level 21 or higher, in which case dimsparkles have a turn resistance of 8 plus their creator's CHA modifier.\n\nAbilities: +4 Dexterity, +4 Intelligence, -4 Wisdom and +6 Charisma. Dimsparkles have no Strength or Constitution scores.\n\nSkills: Dimsparkles have a +8 racial bonus to Hide, Listen and Spot checks. They also have a +12 racial bonus to Search and Gather Information checks concerning the Ring of Dimsparkles. They further have a racial bonus to Intimidate equal to their HD.\n\nCR: Same as base creature +4",
 "title": ""
}