{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_bots",
  "kw_shut",
  "lg_en",
  "kw_hackers",
  "kw_bypass",
  "kw_down"
 ],
 "key": "XYUm8r71",
 "pasteDate": "Feb 17, 2018, 3:41:21 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "I am gonna answer this:\n\n1. It has vigorous staff.\n2. They actually ban people who online date.\n3. The moderation team people aren't strict and actually respond to reports and ban them if enough proof is made.\n4. Better moderation team.\n5. It might be \"shit\" since it's it doesn't have scripts so they can make games WAY better, but you got to remember this, they actually scripted it and coded it and added different sound effects. They took hard work and didn't just download ROBLOX scripts and change a few things. \n6. Blinking in BrickPlanet, It's so efficient.\n7. Not immature kids that call you a noob the second you die or get killed by them.\n8. ROBLOX never responds to reports. Only streamers who are making trouble.\n9. The game gives you money per day, and doesn't force you to buy credits to buy somethings for their wardrobe so they can look good.\n10. Just because it's in development, this game is going good so far. The developers are actually working hard on the game to make it look and work the best it can.\n11. This one isn't a reason, but seriously. No fuckers here noticed ROBLOX copied Lego and that BrickPlanet might've made the game with a idea from Lego?\n12. The community. Everyone on ROBLOX has bad English, they rage quit, and everyone there is just rude.\n13. Currency. There are two currencies: Bits and Coins. ROBLOX only has one currency called ROBUX, and you have to pay real money for it. Unlike Brick Planet, Bits can be earned. Brick Planet cares about the new players.\n14. ROBLOX is a website that's money hungry, the people are terrible to people without ROBUX, they don't ban the online daters too because they want money from their bank account.\n15. People play on BrickPlanet so they can get out of the ill-mannered and unruly kids. Which is a good sign for many reasons. And with 3 words. ROBLOX is bad.\n16. No hashtags.\n17. No exploiters/hackers as far as I have seen.\n18. Filtering is actually good, but needs more work since you can bypass more words\n19. People are still rude on BrickPlanet, but most of it is sarcasm.\n20. You get replies from admins on your forum posts (when you need help, etc), while in ROBLOX, you just get trollers replying.\n21. Most accessories/hats/faces here are much better than ROBLOX's \n22. Admins ask the community what should they update (e.g the halloween items), while ROBLOX, they do whatever they want.\n23. Some Admins are friends with the people of BrickPlanet, while Admins at ROBLOX, well they have to keep their shit together if they don't want to get fired.\n24. You can type numbers in BrickPlanet, while in ROBLOX, even if you're 13+, everything is literally hashtags.\n25. Clickbait games (like ROBLOX, seriously, once, i came across a game named like slide 999,999,999 miles down or something, like who will even believe that?)\n26. No overpriced items here, and even if they are, it's probably worth it for their price.\n27. No greedy kids in BrickPlanet.\n28. No false bans so far.\n29. No pedophiles.\n30. No scammers here.\n31. Links aren't actually hashtags, and this might be useful in the future.\n32. No bullies.\n33. Admins keep track on who uploads scam videos and IP-Bans them permanently.\n34. There are no dumb simulators so far.\n35. In ROBLOX, the same games are literally everywhere - this simply causes a problem, games that aren't popular, but good, you simply find empty servers of them everywhere, and you just can't have any fun\n36. BrickPlanet shut down once due to ROBLOX (right?), just because they couldn't handle the truth; The community, is everything.\n37. In ROBLOX, online daters and rich greedy kids are like \"haha you got no ROBUX you poor\"\n38. Nobody uses grammar, nor knowns good English in ROBLOX, you barely understand anything they say.\n39. Greedy kids everywhere in ROBLOX. you're having fun playing, and then someone calls you a noob for no reason, that's what happens every time I play.\n40. No spam bots.\n41. Everyone on BrickPlanet is friendly. But people from ROBLOX, well they come onto games going insanely mad over a game that they couldn't make.\n42. You can create shirts without having to be upgraded in BrickPlanet. Now that's what I call good communication between your players.\n43. They keep up to date with the players and help them with their problems.\n44. No online dater games since people who work for BrickPlanet actually delete them and ban the people who created it.\n45. No alexnewtron. Thanks fucking god that little piece of shit isn't in the better community.\n46. BrickPlanet listens to what the players want, not what they want.\n47. No Anthro. Thanks BrickPlanet for thinking about the community and not keep to your own brain like ROBLOX's brain.\n48. No cringe Logangers or Jake Paulers. Or any other bad clickbait YouTubers that call you a bitch or a \"kid\" when you say you hate those people.\n49. The ROBLOX community doesn't want people that don't have good clothes. This reminds me of real life. BrickPlanet is like a really good and friendly earth while ROBLOX is a fucking piece of shit earth. I have to go for the first one.\n50. Game creators can't wait for scripting abilities, which means games will be better than shitty ROBLOX games. \n51. Game creators play with their community and talk to them.\n52. People that moved here from ROBLOX to get out of the shit community is actually good since they are friendly and want to be treated how they want to be.\n53. Nobody on BrickPlanet is a fucking annoying cunt and MIGHT as well help other members if they need help with what they don't know.\n54. This game has a opportunity, unlike ROBLOX which ruined it's own opportunity by updating the game how they want.\n55. More reasons why it has opportunity? They do all the good things that ROBLOX doesn't.\n56. Haters come here saying BrickPlanet copied ROBLOX, but guess what? ROBLOX copied Lego and made it a virtual game. BrickPlanet didn't make things so close to Lego since it has ovals and circles and triangles and whatever you want. \n57. I don't think people who made BrickPlanet such a good game would delete it since they put their hearts into it and their players. Remember, haters come here for what? You have to remember BrickPlanet doesn't force you to buy things so you can be noticed or even treated kindly.\n58. Game creators work as hard as they can and all they get is hate from other cringe ROBLOX players. I don't think this might be as true, but haters are a motivation for people since they know the haters can't make better games than you can.\n59. BrickPlanet works on fixing glitches so fair/legitimate people don't have to deal with other people who didn't play legit and get a lot of fortune.\n60. BrickPlanet never copied ROBLOX. It was designed to be it's own game. So let's say, I made a game with squares as the objects and blocky players, the only thing you are gonna get is a lot of fucking hate and It's stupid and annoying.\n\nThanks for reading the entire list. Most of this list I made myself but some of it I got ideas from some other people.",
 "title": ""
}