{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_insecure"
 ],
 "key": "yJA44FqT",
 "pasteDate": "Feb 24, 2018, 2:25:00 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "HAPPINESS IS JUST MOMENTARY\n\n username ; QUEEN-IU\n\n full name ; Belle Song / Song Baekhee\n\n stage name ; Belle\n\n age ; 22\n\n birth date ; November 1st, 1995\n\n height ; 164 cm\n\n weight ; 43 kg\n\n nationality ; American\n\n ethnicity ; Korean-American\n\n hometown ; LA, California, USA + Busan, South Korea\n\n birthplace ; LA, California, USA\n\n languages ; \nKorean\nEnglish\n\nIT HURTS BECAUSE YOU'RE STILL YOUNG\n\n personality ; She is a very creative and artistic person who is really into arts of any kind, it doesn't matter if it's music, drawing, writing...She likes it all. Belle is very kind and selfless, and doesn't hesitate to help anyone; she prefers others' happiness over her own. She's pretty reserved, shy, timid and insecure; she really doubts herself a lot, often about her talents, her looks and her weight. Belle is pretty much an introvert who would rather stay in their room, listen to music and write lyrics than go out and party. She's a very hardworking and precise person who won't stop until they've practiced something they wanted to perfection. Her natural kind, sweet and cute personality and looks makes everyone swoon over her. Belle is very gullible and naive, and that's a big flaw of hers, since she would believe everyone and anything, she often gets manipulated. She loves to write and compose music, to write and to draw. She doesn't like arguing or any conflict, and she's pretty calm and tolerant about a lot of things. She's very loyal and honest, and she's the friend you go to when you're sad or you have some problems you need to talk about. \n\n background ; Belle Song was born in LA, California, USA next to an older brother James on November 1st, 1995. When she was 4, her younger sister, Sarah was born. When Sarah was born, Belle felt kind of abandoned since her parents were ignoring her the majority of time, but she just brushed it off as her parents had to give more love to the newborn baby. When she was 8, her family had decided to move to Busan, South Korea; to her father's hometown. Even when she was there, and Sarah had grown up a little, her parents still payed more attention to Sarah and James. She was a cheerful and happy child who was very friendly and was always running around and jumping, but after she got less and less attention from her parents, she had started to be more closed and shy. She didn't have that many friends throughout her childhood, she had her best friend Joohyun along with her, and 2 more friends, in high school. She has a very beautiful, calming voice that everyone loved, so she was kind of popular through the school for that, but she didn't really like the popularity and only sang when she was alone and with her best friend; she would sometimes sing Joohyun to sleep with some songs. After she discovered her love for singing and dancing, she decided she should apply for some companies. She was pretty insecure about her looks and her weight, because a lot of girls around the school would gossip about her because she was pretty chubby at the time, but still decided to try it out. Even though she wasn't a rapper, she decided to try to audition at YG Entertainment, her favorite company. Belle was very surprised when she got in, and she thought she was really lucky.\n\n likes ; \ncoffee\noversized hoodies and sweaters\ncold weather\nrain\ntaking pictures of things and people\nwriting and composing music\nreading\nwriting\njewerly \n\n dislikes ; \nbugs\nrude people\nhot and sunny weather\ntea\ndirty and messy things and rooms\npeople ignoring her\nstrong smells\n\n talents ; \nfigure skating\ncooking\nwriting and composing music\nwriting (stories, novels, songs..)\n\n trivia ;\nshe likes her stuff organized and clean\nshe LOVES jewelry, and is usually seen with two rings or more on each hand\nshe has a kitten called Cleo who is \"the cutest cat ever!!\"\nsurprisingly, she is very good at video games, being a child who grew up with a brother who loves gaming\nher parents don't approve of her choice of job at all\nshe loves spicy food\nallergic to peanuts\nplays the guitar and the piano\nshe's a BIG BIG fangirl of a lot of groups like SNSD, BIGBANG, SUPER JUNIOR....\n\nDON'T GET SCARED WHEN DARKNESS COMES\n\n slot ; STAY\n\n backup slot ; BOOMBAYAH\n\n face claim ; Seulgi of Red Velvet\n\n backup face claim ; Kei of LOVELYZ\n\n love interest ; EXO Baekhyun\n\n backup love interest ; EXID Hani\n\n sexuality ; bisexual, in the closet\n\n pre debut activities ; \nBackup singer for SISTAR and 2NE1\n\n training years ; 3 years\n\n requested scenes ; \nher doing aegyo on some variety show and everyone freaking out\nher doing a vlive and doing covers of some songs \nher and baekhyun doing lives together and just laying around, being lazy\n\n anything else? ; nope",
 "title": ""
}