{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_fr"
 ],
 "key": "yjTrQt71",
 "pasteDate": "Feb 26, 2018, 12:08:55 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "-Reconfinement:\n\nLes MTF doivent reconfiner les SCPs et les classes-D sans les tuer (si une classe-D droit de l'abatre /droit d'utilis une classe-D pour reconfiner SCP-106).\n\nIDC n'existe pas .\n\nLes Scientifiques doivent se mettre en scurit en sortant du site.\n\nLes Classes-D doivent s'chapper du site mais sont obligs de suivre les ordres des MTFs qui les menace avec une arme(sauf si vous avez une arme de mme taille).\n\nLes SCPs doivent tuer les perssonnes qu'ils voyent sinon essayent de s'enfuir par la mme sortie que pour les scientifiques.\n(modifi)\nketer4\nsafe8\nAXSword29 - 21/01/2018\n@everyone \n-Pr-Breach:\n\nLes NTFs font des rondes dans le site et 2/3 qui sont en exprience  SCP-049.\n\nLes IDCs doivent sauver les classes-D.\n\nLes Scientifiques font l'exprience avec SCP-049 et doivent sortir du site une fois que l'incident setransforme en breach gnral.\n\nLes Classes-D font l'exprience sur SCP-049/attendent l'incident.\n\nLes SCPs attendent que SCP-079 soit branch pour sortir de leur confinements.\n(modifi)\nsafe9\nketer6\nAXSword29 - 21/01/2018\n@everyone \n-Rvolte MTF:\n\n+[Les IDC seront choisit par le(s) maitre(s) du jeux !]\n\nLes MTFs font des rondes comme si tout tait normal.\n\nLes IDCs (ne spawn pas IDC mais MTF) devront tuer les MTFs et activer SCP-079 pour activer une breach total enfin de pouvoir librer les Classes-D.\n\nLes Scientifiques se baladent dans la EZ et font semblant de travailler jusqu' tre alerts de devoir sortir.\n\nLes SCPs attendent que SCP-079 soit branch pour sortir de leur confinements.\n(modifi)\nketer2\nsafe14\n@everyone \n-Rvolte Classes-D:\n\nLes MTF font des rondes comme si tout tait normal.\n\nLes IDCs sont avec les classes-D et les arment pour pouvoir s'echapper.\n\nLes Scientifiques se baladent dans le site.\n\nLes Classes-D ont des armes grce aux IDCs et essayent de sortir du site.\n\nLes SCPs attendent qu'on les libre ou que SCP-079 soit actif.\n(modifi)\nketer2\nsafe13\n@everyone \n-Prise d'otage : \n\nLes MTFs doivent ngocier les vies des scientifiques contre celles des Classes-D.\n\nLes IDCs doivent ngocier les vies des Classes-D contre celles des scientifiques.\n\nLes Scientifiques sont des otages (Doivent nerver les IDC's).\n\nLes Class D sont des otages (Doivent nerver les MTFs).\n\nLes SCPs n'existent pas.\n(modifi)\nketer4\nsafe11\n@everyone \n-Assaut majeur d'ICs.\n\n2/3 des joueurs sont des MTF. Ils se trouvent dans la fondation, au niveau des gates (surface) et suivent leur routine. Une partie peut aussi se trouver en intrieur.\n\n1/3 des joueurs sont donc IC. Ils arrivent en une premire vague, peu nombreux, histoire d'alerter les MTF's.\n\nIl n'y aura pas de renfort MTF, uniquement des renforts IC.\n\nL'objectif des MTF's est de repousser 3 vagues d'IC. (La premire vague d'alerte ne compte pas, sauf si l'alerte est donne par le MJ avant mme l'arrive des IC.).\n\nL'objectif des IC's est de prendre la fondation d'assaut, et de neutraliser toute prsence MTF a l'intrieur.\n\nLes MTF's peuvent soit se retrancher dans le site, soit se poster a l'extrieur.\n(modifi)\nketer3\nsafe16\nAXSword29 - 21/01/2018\n@everyone \n-SCP containement breach:\n\n+Les MTFs sont 3 max qui doivent reconfiner les SCPs qu'ils rencontrent et doivent executer les classes-D qu'ils voient (sauf une si il y a 106).\n\nLes IDCs n'existent pas.\n\nLes Scientifiques n'existent pas.\n\nLes Classes-D doivent s'chapper du site.\n\nLes SCPs fuient et les NTFs ne peuvent pas les tuer/les envoyer dans la dimension de 106 et doivent tuer les Classes-D.\n\n(SCP-173 est oblig de se reconfiner si 2 MTF minimum le regarde/SCP-049 est obliger de cooprer si 2 MTF minimum le pointent avec leur armes).\n(modifi)\nketer5\nsafe10\nAXSword29 - 21/01/2018\n@everyone \n-Sauvetage de Class-D\n\nEnviron 1/4 des joueurs sont des NTF entrain d'enmmener des Class-D pour une exprience sur un SCP au hasard.\n\nEnviron 3 joueurs sont des Class-D, Les NTF ne doivent pas tuer les Class-D et les Class-D ne doivent pas s'enfuir.\n\nLe reste des joueurs sont des IC dploys aux Gate A ou B aprs le signal des NTF qui sont dans la HCZ.\n\n5 IC doivent sauvs les Class-D et en vitant le SCP qui est tester (Ils ne PEUVENT PAS tuer le SCP).\n\nLes joueurs restant sont des Scientifiques qui joue Rp pour l'exprience.\nketer6\nsafe11\nAXSword29 - 21/01/2018\n@everyone\n-Escorter le(s) VIP(s):\n\n+Un groupe de FIM doit escorter un ou plusieurs scientifiques du point le plus loigner du site vers la sortie avec un assaut de deux SCP-106.\n\nL'quipe FIM commence avec le ou les scientifiques dans le site.\n\nLes SCP-106 ne peuvent pas revenir  leurs points de dpart.\n\nLes SCP ne peuvent pas attaquer en mme temps l'escort.\n\nLes FIM ne peuvent pas reconfiner les SCP.\n\nLes SCP ne font pas des attaques continues ils attaquent un temps dfini par les joueurs de la partie puis repartent via la dimension de poche qu'ils auront plac  un endroit qui ne leur fera pas recroiser obligatoirement les FIM.",
 "title": ""
}