{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_sv"
 ],
 "key": "YPAhSuKu",
 "pasteDate": "Feb 11, 2018, 3:38:49 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Efter torsdagens lektion bad Benjamin om att f vara den som skickar in dokumentet, d han ville skriva mer. Vi frstod detta, d han var den som hade gjort verlgset minst under lektionerna, bde skriftligt och muntligt. Vi hade drfr inga problem med detta.\n\nVi mrkte nyss att de saker Benjamin har lagt till tydligt visar att han inte har lyssnat under vra diskussioner, trots att vi frskt f honom att engagera sig. Han skriver t.ex. att vi ska ha lastbilar som plockar upp soporna, trots att vi klargjort bda under diskussioner och i texten att vr stad r bilfri. Han upprepar ven saker som vi redan skrivit tidigare i texten, som t.ex. att vi utnyttjar hustaken till att plantera vxter. Detta visar att det inte bara var diskussionerna han inte lyssnade p, utan ven att han inte ens har lst igenom texten ordentligt. Det visar ven att han verkligen r desperat efter att fr skriva fler ord i texten, d han inte vill att det ska vara tydligt hur lite han faktiskt gjort. Ett tydligt exempel p detta r de vakuumtunnlar som han freslr fr vra tg. Det finns ingenting att tjna p att ha vakuumtunnlar i en s liten stad, d det endast r lnsamt ver stora strckor, och det skapar bara mer problem n det lser. Detta r ngot som han sjlv insett, d han avslutar stycket med att skriva \"Eftersom vran stad r relativt liten s kanske detta inte behvs\". Jag, Amanda och Wilhelm har pratat om de tillgg som Benjamin har gjort till texten, och vi r verens om att de verkligen frsmrar projektets kvalit. Om Benjamin ville vara till hjlp hade han gjort ngot tidigare, och inte frskt undvika arbete trots att vi frskte motivera honom. Vi r alla tre verens om att han enbart gjort dessa tillgg i ett desperat frsk att hja sitt betyg, d det r tydligt att han inte brytt sig om sjlva innehllet verhuvudtaget.\n\nVi har frskt prata med Benjamin om det, men vi har inget stt att kontakta honom just nu. Vi bestmde oss drfr fr att skriva ett meddelande till dig, och sga vad vi tycker. Benjamin har bokstavligt talat inte gjort ngonting fr att hjlpa gruppen, och vi tycker inte att det r rtt att han i sista sekund skriver till flera tillgg som frsmrar arbetets kvalit bara fr att frska hja sitt eget betyg, utan att prata med ngon av oss om det.",
 "title": ""
}