{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_pt"
 ],
 "key": "YVDezv8V",
 "pasteDate": "Feb 20, 2018, 6:36:16 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": " \n\n- Yoshiyuki Sadamoto-san has previously said that \"Tsurumaki understands moe better than I do.\" When I read the definition you wrote - \"the individual act of compensating for a lack of information in regards to a particular character\" - I thought it was absolutely right.\n\n \n\nTsurumaki: I wrote that about three years ago. I feel like the meaning of the word moe has become fragmented in the course of its becoming popular, but I think that, in the beginning, the phenomenon of moe was an act of compensation. I don't think it was the case that moe was [something] depicted in works. I think that moe existed on the side of the audience, and it was an impetus that grew spontaneously within audiences. I feel that recent anime, in trying to incorporate moe [directly] into the works, has come to an unfortunate state. \n\n \n\nI don't think [moe is] like that. I'm sure you've had an experience where it's just as if a \"serious work\" unrelated to moe causes all the more moe feelings precisely on account of its being \"serious.\" I thought it was essentially the sort of activity [that came] solely from the the side of the audience. \n\n \n\n- As long as the characters in a story only exist in that story, the [amount of] information [available about them] is smaller by far compared to people in real life. So, [moe] is the enjoyment of compensating for that with one's imagination. Compared with characters in novels, anime characters have a visual image, so it's easy to form a mental image [of them]. Compared to real-life talents, [anime characters] are a product of the imagination, so there is a great deal of room for the imagination to work. I wonder if [moe] was a word that emerged in order to express the difference between characters from such other genres [and characters from anime]. \n\n \n\nTsurumaki: The term \"mecha moe\" exists as well, so it surely isn't simply a feeling directed towards cute girls. \n\n \n\nI think my thinking this is probably due to the fact that I myself have been a \"good viewer.\" Meaning that, in the eyes of those who create the works, I am a \"suitable audience.\" I completely imagine by myself those things that are not depicted. On my own, I involve myself emotionally with the characters, and I work out the consistency of the undepicted parts. Among the viewers of anime, there were many more or less like this, in a sense, \"dilligent people.\" Maybe you could say that, filled with my imaginings concerning these characters, I fell in love with them in my own way. (laughs) You're not intending to make [the audience] fall in love with this character, you're not presenting [that character] with the intention to make them fall in love, but there are viewers who develop romantic feelings for [that character] in their own way; those people, I think, are otaku. So I imagine that moe has its origins in anime as a genre. \n\n \n\nIt might be that a work like Sailor Moon was self-conscious [of this]. After that, Evangelion made it into a system. From the beginning [Eva] intentionally produced gaps and made the audience fill them. Eva was the most powerful moe anime. \n\n12 \n\nNowadays, it's a real mess, with [scenarios?] like, \"twelve younger sisters.\" Insofar as [people] try to make moe because \"moe sells,\" moe disappears. Now the meaning of moe has changed. Only the word is left, and the meaning has been hijacked. [Moe] is no longer moe.",
 "title": ""
}