{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_down",
  "lg_en"
 ],
 "key": "yXgj8WkH",
 "pasteDate": "Feb 26, 2018, 2:00:28 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "[17:57:18] DeltaMajor: To be honest - I'm not really sure that if you guys should trust me (cause that's really up to y'all decisions and I can't say anything really. - My apologies If I seem arrogant here - but I'm not. Just stating the fact and the point).\n[17:57:22] DeltaMajor: But I think that I've changed/improved - thanks to my in-activeness as I've been taking quite few days break and what not - even though I was online quite a few times - a few days back to feel better and to improve myself?\n[17:57:32] DeltaMajor: Hm.. Just want to state my honest opinion here from what you've said - and I do hope it's not against anyone or anybody personally or if it means as 'shade' and what not - it's clearly not and I'm not fighting back or whatever.\n[17:57:42] DeltaMajor: So, DISCLAIMER. Just my honest opinion, I understand what happened to Lionyx is none of my or our business and what not.\n[17:57:50] DeltaMajor: But I feel like we've been friends in PS for quite sometime and as a true friend - he/she would probably be on his side or his listening ear no matter what happens. And I understand that 'shittalk' part.\n[17:57:58] DeltaMajor: Yes, I did and my apologies if it got y'all upset and pissed or whatever and I'm really sorry for that.\n[17:58:04] DeltaMajor: But I feel like as a person or whatever - everyone shittalks to anyone or everybody - so I feel like it's not like I'm the one who shittalks - I'm sure everyone shittalks about everything (it's just a matter of directness, etc)\n[17:58:10] DeltaMajor: and I feel like I've been pretty straightforward and maybe that's why I got y'all offended and I'm really sorry for that which I could've tone it down a lot.\n[17:58:11] DeltaMajor: As for 'team works' - yep, I absolutely agree. But I don't feel like I've been included - or probably I feel left out in cosmo and mayb that's why as a team, we should prolly foster a good environment.",
 "title": ""
}