{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_operations",
  "kw_down",
  "re_us_phone",
  "re_sql",
  "lg_en"
 ],
 "key": "z8qeFmCB",
 "pasteDate": "Feb 12, 2018, 5:12:09 PM",
 "relevancy": 0.0,
 "relevant": false,
 "text": "Ingame Name: \n\nSanders\n\nPlayer ID: \n\n76561198196324355\n\nAge: \n\n16\n\nCan you speak fluent English: \n\nYes\n\nHow long have you been with RebornRoleplay:\n\nOver a year\n\nCountry + Timezone: \n\nGlasgow, Scotland GMT\n\nPrevious RebornRoleplay bans: \n\nN/A\n\nPrevious Police blacklisting (if yes, why): \n\nN/A\n\nAbout you (50 words +) : \n\nI am a fine chap from Glasgow Scotland. I have been playing reborn roleplay for well over a year now and I have gained multiple positions that I am proud of within reborn such as General, Chief Constable, Deputy SFU and Deputy of DIU. I've lived in Glasgow for most of my life and have been involved in multiple situations when I've lived here. I am expecting to join the Police in real life for Police Scotland in a few years time.\n\nCharacter Roleplay Background (150 words +): \n\nWhen I was 8 years old, my family moved away from the city of Glasgow to Liverpool, we were hunted down by a gang from Edinburgh. We were running and running from city to city, where we realised there was a massive reason for why we're being chased. BT Phone Book. Our names were quite simple still! My family got approached by the Police and were given the idea to change our names and be ready to move. My mother changed her name to Serenity and became a stripper, and my father's name was changed to Hamedi, and my name was Nox was an endless cycle. 1 year later we got a phone call for a free first class flight to Altis. We took it in a heartbeat, for 3 years we were homeless for around 5 years at a time. Our home was located in Kavala, stringing with violence and robberies, not a difference from home really. A year later my father saved up for a small house near Kavala PD, we stayed there for most of our lives and I noticed all the activities from the PD. Decided. a couple years later I decided to join the police. This got me to this position here.\n\nWhy do you want to join the Police Force (100 words +): \n\nI have been apart of the Police before on reborn which I have reached several positions within the faction such as Chief Constable of Kavala, Deputy Chief of the Firearms unit (SFU), Deputy Chief of the Drugs unit (DIU), Squad Leader of the National Police Air Service. I do miss the Police and recently stepping down from my old position of the General of the Vanguard as it wasn't my style of situations. I want to return and make a positive impact to the Police once more.\n\nWithin Kavala as I was CC I believe I made a positive impact by remaking the constabulary back end and also marking the future of our officers within the Constabulary, which Is why I have returned to the constabulary.\n\nPlease explain how you will work to make Altis a safer place (150 words +): \n\nI plan to impact how much the Police listen to members of the public and stop ignoring them, I have ideas to get community involvement at a high once more. I also plan to rejoin SFU and have better weapons to protect the greater good of the crown lands. I have experience with the Police and I am a good mentor and will be able to rub off my good cop skills within the Lower ranks and trainees. I am a good role member and a good leader and will be able to communicate well and direct members of the Police to help the public improve the image of the Police.\n\nI plan also to create small operations to stop people robbing legal runs and also control rogue factions such as the Vanguard to stop their ways of robbery and terror without Altis. Illegal weapons are at a rise on the street and no matter what I will try and make sure that they are taken off our streets.\nThanks for reading\n- Sanders\n\nPlease acknowledge you have read and understand Server Rules / Teamspeak Rules / Forum Rules: \n\nYes\n\nPlease acknowledge you understand once accepted into the Police Force, you can no longer play as Rebel: \n\nYes\n\nPlease remember all replies must be submitted by PM.",
 "title": ""
}