{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "kw_secure",
  "re_sql",
  "re_email",
  "re_url",
  "kw_pass",
  "lg_en",
  "kw_down"
 ],
 "key": "z9mgRPDx",
 "pasteDate": "Feb 11, 2018, 4:38:49 AM",
 "relevancy": 2.0,
 "relevant": false,
 "text": "\"Everyday Life With Guardsmares\"\nby The Man From Another Time\nthemanfromanothertime@gmail.com\n\nWritten for the Royal Guard Mare thread on /mlp/\n\nCharacter art: http://imgur.com/a/IEcnJ (characters in order of appearance; possible spoiler warning)\n\nCHAPTER 3\n\n> You are *huff* Sergeant Purity *puff* Ebonshield, and *huff* this is *puff* quite a *huff* workout.\n> The Royal Engineer had spent all of the evening, both before and after the supper, working at his desk.\n> Only when the sky was black and the Moon shone down upon Equestria did he get up and announce that it was time for the physical exercise.\n> So here you are, now, 'jogging' alongside the Great Lord, having deliberately decided to run, rather than fly.\n> With his tall stature giving him a great stride, and his hairless body allowing him great endurance, keeping up with your VIP was quite a challenge.\n> As he strides confidently onwards, sweating profusely, you are reminded of the early days of your tutelage under the Master of the Shining Stellar Dance, Draxon.\n> You remember quickly becoming tired galloping alongside him as well.\n> 'Dominar!', you protested. 'Why do you make me run on my hooves so?'\n> The old Master simply looked back at you, the whiskers of his moustache swaying with each step he took.\n> 'Student, how else wilt thou chase down they prey, thou who wouldst dance among the shining stars?'\n> Huffing and puffing, you struggled to hustle up beside him, kicking up grey moon-dust behind you.\n> 'Master, why with the wings that the Mother-of-Stars has, in her wisdom, given us.'\n> Draxon chuckled as he leaped effortlessly over a small crater.\n> 'Ha! But has the Mother not given us hooves as well? Dost thou propose to ignore these gifts?'\n> You had had to go around the same crater, believing yourself unable to make the jump without flapping your wings and earning the ire of your Master.\n> For he decreed that you may hold your wings during this exercise as you pleased, provided that you did not at any point use them to propel yourself.\n> And you were certain he would notice even the slightest flutter.\n\n> 'No, Master! But, having been blessed with these wings, shall we not find better uses for our hooves instead than treading dust?'\n> The supreme Master of your school nickered.\n> 'Pnnggh-h-h-h-h! Thou wouldst do well to stay thy tongue and keep thy mind to the task before thee...'\n> Once again launching himself across a deep crater that you were forced to circle around, he shouted at you from above.\n> '... But, I can see that thy questions are as numerous as the stars above. So I will speak only this wisdom:'\n> Landing on his hooves far ahead of you, he looked back over his shoulder and spoke, still coursing ahead.\n> '... When a Dancer fights, he does so without the shackles of rules and restrictions. Therefore, those who aspire to join the Stars high above had best prepare themselves down to the very bottom of their soles!'\n> And with that, he had found some new reserve of strength and galloped off, leaving you choking upon his dust.\n> This had not seemed very enlightening at the time, but later, when you finally caught up with him, sitting calmly atop a small mesa, he invited you to sit.\n> Master Draxon then proceeded to critique every aspect of your running technique.\n> Trying to lengthen your gait instead of keeping to your natural stride.\n> Throwing your hooves against the ground in advance of your knees, over-stretching yourself.\n> Keeping your wings held too tightly against your flanks, preventing them from serving to cool your body.\n> Allowing your head to bob, as if that would propel you forward instead of wasting energy and motion.\n> And, the worst sin of all, trying to carry on a conversation instead of focusing on the race.\n> Just then, the Royal Engineer interrupts your reminiscence.\n> \"I've been thinking, Sergeant.\"\n\"Yes, Great Lord?\"\n\n> Your human VIP swallows in-between hurried breaths.\n> \"About the combat training. I was wondering if we're going about it the right way.\"\n\"If the Great Lord has concerns, his humble servant will gladly hear them.\"\n> The two of you quickly hustle around a corner, keeping the main hedge on your left as you use the rose-garden of the Princess of the Sun for a purpose most unintended.\n> \"Well...\"\n> He gulps, then coughs as some spittle goes down the wrong way.\n> It as if the spirit of Draxon was here, punishing your Great Lord for speaking during a run, just as he would switch you with his stick when you disobeyed him.\n> And what does your ephemeral Master have in store for you for indulging your VIP, hmm?\n> \"... Sorry. I meant to say, I *huff* was wondering if we should go straight into fighting with weapons and armour. Shouldn't we start with, like, more basic exercises first?\"\n> Now, this is a sentiment most curious.\n> When you were but an initiate under the Master and his senior *estelares*, how you thirsted to be allowed the thrill of the true battle, instead of the seemingly pointless exercises and rote individual forms demanded of you instead.\n> Of course, these things had not been pointless at all, serving as the foundation of what was to come later, but that truth was beyond your understanding when you were first initiated.\n> Yet here is your VIP, to whom you have proposed to teach combat in its fullest, and before you have even begun, he expresses the concern that perhaps you are already moving too quickly.\n> Is he possessed of some wisdom unseen?\n> You decide to check.\n\"If the Great Lord would prefer this, it may certainly be arranged.\"\n> Grunting as he hustles, step by step, up the long staircase to the terrace central of rose-garden, the two legs of the Royal Engineer have to work twice as hard as your four.\n> Despite this, he is still close on your heels when you reach the top first.\n\n> \"I'm not saying I'd necessarily prefer it, Sergeant. I'm just throwing it out there that I'm not desperate to get straight to spears and blades...\"\n> Pausing for a moment, he nods his head to the right, and you both take off in that direction.\n> \"... If I'm going to learn to fight, and I mean to *really* fight, I'd like to do it properly. So I don't want you to take any shortcuts on my account, even if it means leaving my armour off and doing some boring stuff first.\"\n> Fascinating!\n> How overjoyed your master would have been to receive such a student whose head is already so populated with the wisdom.\n> But then you also consider that your VIP is a decade or more older than the vast majority of those who show up at the steps of any of the Star-temples.\n> Still, you can recall a few who entered the School of Shining Stellar Dance with the knowledge that naturally comes with age, yet without the wisdom or the patience.\n> And a few of them were already trained warriors, having departed another school to learn the Dance instead.\n\"Of course, Great Lord. Please rest assured that your humble servant shall not allow the appearance of vanity to get in the way of proper training...\"\n> As you ponder the source of this apparent wisdom, a thought enters your head.\n\"... But, may I ask: has the Great Lord previously received any kind training in combat?\"\n> A curious smile appears on the face of the Royal Engineer.\n> \"Not unless you count a summer weakly punching air for half-an-hour once a week, as a chubby pre-adolescent, at Master Mike's Midtown Mixed Martial Arts...\"\n> 'Master Mike'?\n> Before you can inquire further, he laughs.\n> \"... And you shouldn't. So, no, I haven't.\"\n> Curious.\n\"Then may I ask, how do the people of the Great Lord train to fight, to '*really* fight'?\"\n> The smile disappears.\n\n> \"My people don't fight with swords and shields, Sergeant -- not any more, not unless it's for sport. For modern soldiers, physical training is still important, like being able to jog, run, and crawl, all while carrying a heavy load on their backs. And they do a little training in hand-to-hand combat, though it's mostly to build aggressiveness and determination.\"\n> Exiting the rose-garden, you both continue to jog back towards the palace.\n> \"... My people fight with *tools*, Sergeant; tools so complex they can take tens of thousands of people hundreds upon hundreds of hours to build. But with these tools, a mere flick of a finger can kill an enemy a mile away -- or worse.\"\n> The people of the Great Lord are powerful indeed.\n> There is, however, something about the tone your VIP is using -- it is not just merely exhaustion from running around in the garden.\n> It is a certain seriousness mixed with a kind of sadness.\n> You feel also as if he is holding something back.\n> Before you finish processing his statement, the Royal Engineer bounds ahead of you, hustling up to the patio behind his chambers, then coming to a stop.\n> Doubling over forwards, he places his hands on his knees, taking several deep breaths.\n> You arrive shortly after him, panting as well, with your wings softly beating to clear the heat.\n> There is much humidity in the air tonight, for a mid-spring day, and the sky to the west is beginning to cloud over.\n> Perhaps it shall rain tomorrow night.\n> Oh, well.\n> So long as tonight is clear, you should hopefully have success at the clubs once again.\n> Perhaps even you will see the same colt as this morning!\n> He said he would be there.\n> And what a delightful young stud he was...\n> Your VIP slowly stands up again, exhausted and drenched with sweat, then walks over to the small cocktail-table where he had placed the water jug and two of the glasses from his room.\n> Filling both, he takes a deep drink from one even as he hands one to you.\n\n> You sit down and refresh yourself, looking up at your VIP.\n> There is something quite attractive about a sweaty colt, panting and tired.\n> You can just imagine gliding back and forth across his slick, steaming-hot body...\n> Hmmm...\n> Yes, you definitely must strive to find some companionship tonight.\n> It is not good to leave the appetites unsated.\n\"When the Great Lord spoke of 'boring stuff', was there some thing in particular which he had in mind?\"\n> The Royal Engineer sighs and shrugs as you take another sip.\n> \"I dunno. Physical exercises in general, I suppose. I guess sparring is out since pony hooves are much stronger than human fists. What about grappling? Do ponies wrestle?\"\n> You lower the glass.\n\"Ponies do wrestle, Great Lord. However, I should point out that the Great Lord has a significant advantage in such an activity, owing both to his hands and to his greater size, stature, and reach. I think he would quickly find it all too easy to seize a pony opponent and wrestle them into submission.\"\n> Your VIP looks at you quizzically.\n> \"Isn't that a point in favour of it, then? Shouldn't you teach me to wrestle, first?\"\n> Oh, and how you dearly *would* like to teach him to wrestle!\n> Just a different kind of wrestling; one not so useful on the battlefield.\n\"I beg the forgiveness of the Great Lord, but I must point out that any pony trained in combat will be certain to strive most strenuously to keep out of the grasp of any enemy possessed of the hands or the claws. It is known that such enemies are most dangerous when they can take hold of us. I do not therefore think it will serve in any way as a means to fight in itself...\"\n\n> After flapping your wings to dissipate the unbearable heat build-up at your flanks, you continue.\n\"... Since the Great Lord appears to be in a shape most excellent already, and has expressed a desire to remain an engineer first and foremost, I believe that it may be possible to proceed straightaway with the conducting of the training in his armour and with his weapons.\"\n> The Royal Engineer nods.\n> \"All right. And I appreciate the compliment...\"\n> With a deep, final breath as he's fully recovered from the fast pace of the exercise, he looks up at the stars.\n> \"... By the way, Sergeant, where are we going to conduct the training? Are we just going to use the palace's grass fields outdoors? Because we should probably get permission from Her Royal Highness's landscapers beforehand.\"\n> You smile.\n\"It shall not be necessary to disturb the gardeners of the palace, Great Lord. While the Specialist Featherhooves was finding for the Great Lord a blacksmith able to provide him with armaments, his Sergeant did secure for him a suitable training ground.\"\n> \"Oh, good. Where?\"\n> Putting down the glass, you bow.\n\"If it pleases the Great Lord, we shall train in the Grand Hall of Stars, in the Night Guard rookery, underneath Canterlot Mountain.\"\n> The Royal Engineer's brow furrows almost imperceptibly.\n> \"A batpony training ground? Hmm...\"\n> As he takes another sip of water, you wonder if he is perhaps not so accepting of your kind as he has previously let on.\n> This would be strange since, as the Mother-of-Stars pointed out, he has not been raised with any sort of prejudice...\n> \"... I suppose it might be a good idea if you instructed me in your people's ways first. I don't want to make any gaffes in etiquette while we're there.\"\n> Ah, clever!\n> You bow again.\n\"The Great Lord is most considerate; it is clear that his manners are already impeccable, but his humble servant shall certainly make such instructions as are necessary...\"\n\n> Lifting your head, you look him in the eyes.\n\"... However, as I have planned for us to use these facilities during the *day*, when the Night Guard normally rests, it is unlikely that we shall have many encounters with the other Children. Beyond, of course, the servants and attendants of the Grand Hall itself.\"\n> The Royal Engineer nods.\n> \"Alright... Although, with a name like 'Grand Hall of Stars', you have me expecting a pretty formal atmosphere, Sergeant. And Her Royal Highness did effectively ask me to try to help bridge the gap between your kind and the rest of Equestria. I'm not averse to some lessons beforehand.\"\n> Hrm.\n> Despite his casual wording, it appears that your VIP is insistent on this point.\n> How much should you tell him?\n> It is, after all, an awkward subject.\n> You had known how Equestrian society functions, and in the past five days, had gotten to see it first-hoof as well.\n> And it was known to you that the native society of the Royal Engineer functioned in a way far more similar to that of Equestria than to that of the Moon.\n> Will he understand what you tell him?\n> Will it upset him?\n> If you had grown up in Equestrian society, you certainly believe that it would upset *you*.\n> But then again, Anonymous has displayed a certain kind of patient wisdom.\n> And since you are all but forbidden to lie to him, the question was really only how much to try to hide.\n> Just then, a cloud passes in front of the moon, and the grey patio stones grow dark.\n> As your eyes open wide, banishing the shadows that would cloud any other kind of pony's sight, you regard your Royal Engineer.\n> Despite lacking the iridescent eyes of a batpony, he still looks casually back at you with wide retinas, as if able to see just as well in the gloom as you can.\n> And, most importantly, unafraid of the encroaching shadows.\n\nSuggested background music: https://www.youtube.com/watch?v=SWkEKhK2CXs (Mark Morgan & Richard Band - 'Bones of the Night', from 'Planescape: Torment' [1999])\n\n\"Such lessons have not, to my knowledge, ever been given, but since the Great Lord asks, I shall try.\"\n> You take a deep breath and try to find somewhere to begin.\n\"... The first thing that the Great Lord should know is that from the moment we enter the rookery, he shall be a Great Lord no longer.\"\n> The Royal Engineer raises an eyebrow, and you carry on.\n\"... You are not a warrior, Great Lord, and neither can you claim to be a Priest. Therefore you are beneath both, so, unless you wish to issue a challenge, you must yield completely and utterly to anyone of such ranks.\"\n> You do not have to wait long for the inevitable rebuttal.\n> \"My title was given to me by *both* Princesses. Doesn't that mean something?\"\n> Licking your lips, you continue.\n\"It means a little, yes. Being so recognized, you shall at least not be treated as an outsider, a Shadow. And some of the Children may see you as more than what you appear to be. They may choose to show you respect, but it is not required. Therefore, you must prepare to be disrespected. Although I am sworn to defend you, under the mountain, I shall outrank you. If you see me yield to another pony, you must yield as well. And it would be preferable if you do not speak unless I invite you to do so.\"\n> \"What about the other members of my quaternion? Are they outsiders, too?\"\n> Ah!\n> He catches on quickly; very perceptive.\n\"They are my comrades-in-arms, my battle-siblings. Therefore they are not Shadows, either, but are Stars as I am.\"\n\n> The Royal Engineer bends over and puts his glass down on the low wall that encloses the patio, then wipes his arm across his sweaty forehead.\n> \"'Shadows' are outsiders, 'Stars' are warriors... These sound like social classes, or even castes, and you mentioned 'priests' distinctly as well. What class do I fall into, if I'm not a Shadow?\"\n> You blink.\n> It appears that your VIP is far more understanding than you thought.\n> Perhaps his world is not so homogeneous in its societies.\n> Or, perhaps his people once behaved as your kind still do.\n> At this point, it might be easiest to tell him everything.\n> You take a breath and clear your throat.\n\"As the Moon has five shapes, so there are five ranks among the Children, Great Lord...\"\n> Understanding implicitly that you have more than just a few things to say, the Royal Engineer steps over to the wall and turns around to sits down, still listening attentively.\n\"... When the moon is dark, the Shadows cover the land. Those who dwell in the darkness are outcasts, and count among their number outsiders, exiles, those whose work is foul and impure... and, at the very bottom of this darkest pit, anyone not of the Children.\"\n> Before you can continue on, your VIP whispers a word.\n> \"Untouchables.\"\n> Forgetting your place in Equestria, you nod, rather than bow.\n\"Yes, Great Lord. A succinct description.\"\n> \"Go on.\"\n\"The slim crescent moon belongs to those who work its thin soil, and so they are called the Dust. They are farmers, miners, labourers, and the failures unworthy of being banished quite so far as the Shadows.\"\n\n> The Royal Engineer nods silently, and you continue.\n\"... A half moon is something greater, as when the moon-dust is collected into something greater, into the Rock. These are those who work with skill; artisans and artists, tradesponies, smiths, tailors, and others.\"\n> The clouds blacking out the moon finally pass by, and the white semi-circle shines down upon you both.\n\"... When the moon is stronger still, gibbous and great, it shines in harmonious accordance with the Stars, and calls warriors to its banner. I count myself among their number.\"\n> \"These classes -- sorry to interrupt again -- are they assigned at birth?\"\n> You shake your head.\n\"No, Great Lord. We do not have the concept of 'noble birth' as here in Equestria. A Child's place in society is determined by his profession, and he may change it by his actions or have it changed by circumstance.\"\n> \"But where does he start?\"\n> Drawing a deep breath, you glance up respectfully at the almost-full moon.\n\"He starts where his taken; when it is time to leave the *guardera*, the nursery-crche, the different classes of his House will bid for him, making him different offers and promises based on his apparent value to them. He may accept whichever bid he pleases.\"\n> \"Houses? This is more involved than just class, doesn't it?\"\n> Of course he immediately picked up on that; perhaps you should have left it out.\n> Oh, well.\n> You remember to actually bow this time.\n\"Yes, Great Lord. But as the distinctions of House are moot outside of the moon, we need not discuss them at this time. All of the Children who are here in the Rookery have sworn to serve the Mother-of-Stars without regards for their House.\"\n> \"I see.\"\n\n> Clearing your throat, you complete the lesson.\n\"The final phase is when the moon is full and brightest, and in this brief moment it outshines the Stars and truly takes the centre stage in the night. As the League of Stars supported the Mother-of-Stars, so the Lunars are her priests among the Children, and they serve as the guardians of the next generation, as well as the ambassadors and messengers between the Houses of the moon.\"\n> The Royal Engineer nods.\n> \"Shadow, Dust, Rock, Star, and Lunar. And where do I fall?\"\n> You inhale sharply.\n\"As the Great Lord is an engineer, a worker of fine things, he should number among the Rocks. But if you learn to fight as a warrior should, you may be counted among the Stars. And, because of your endorsement by the Mother-of-Stars, particularly as a kind of ambassador to the Children as a whole, it is also possible that you may be a Lunar...\"\n> You lick your lips.\n\"... However, such acknowledgements are normally made by the members of a House. Since the Great Lord is not formally a member, this complicates matters.\"\n> \"But you belong to one, don't you?\"\n> You bow.\n\"S. And, if the Great Lord wishes it, I would gladly endorse him as a Star when I feel it would be appropriate. This would, however, have certain implications that we may discuss at a later date.\"\n> There was another option for his class as well, but it would be best not to overwhelm your charge with too much information at once.\n> In any case, despite the obvious similarities in your mind, it is unlikely that *they* would welcome him among their number.\n> The Royal Engineer sighs.\n> \"I think I'm getting the idea. A strict hierarchy of social classes, but fairly fluid movement between them. And I'll need to bow and yield to soldiers and priests.\"\n\n> You gather up the two empty glasses and flap over to the water-jug to fill them both back up.\n\"Neither of which we are likely to encounter during the training, Great Lord. But, yes, you must do this. And you must do likewise with other members of the Rock caste, since, without any specific acknowledgement among their number, you must count yourself as the lowest apprentice.\"\n> Your VIP laughs as you hoof him his water-glass.\n> \"Hah, of course! Well, it's all right. I don't mind kowtowing to bigwigs if that's what's needed to get my work done. I did it when I first arrived here, too -- and I'm still a little uncomfortable with the social promotion I received as a result. I still apply what Chancellor Strings calls an 'oversupply of humility'.\"\n> You bow.\n\"A most practical attitude, Great Lord.\"\n> Another shadow passes over the patio as another cloud -- bigger, and puffier this time -- moves in to obscure the moon as it covers the whole sky.\n> Yes, it will rain tomorrow.\n> A breeze comes sweeping in across the gardens, rustling the trees and shrubs that are just reaching the peak of their efflorescences.\n> The Royal Engineer takes a sip and looks over the grounds.\n> \"Looks like we're due for some rain. You might as well call it a night now, Sergeant. I'm going to take a shower and then turn in.\"\n> You bow.\n\"Gracias, Great Lord, many thanks. But I will remain at my post until the shift is formally ended.\"\n> Corporal Bound has asked all of you not to give in to his requests for early dismissal -- at least not for a little while, lest he accidentally make a mistake.\n> \"Sure. Come on, let's get inside before the heavens open up.\"\n\n> 'Heavens open up'.\n> What a curious turn of phrase.\n> And yet, how appropriate.\n> With an unusual new sense of appreciation for the wisdom and intelligence of your VIP, you enter his chambers behind him, shutting and latching the glass door behind his desk as he trundles off to the washroom.\n> You are in need of a shower yourself, to be sure, but you can wait another hour or two until midnight.\n> Perhaps the Royal Engineer will have more questions when he emerges from his bath.\n> At the very least, it will give you time to consider what else you should tell him.\n> As you settle in at your post in front of the main doors, you are reminded of something Master Draxon always liked to say.\n> 'A Dancer must not settle into one form; he must adapt it and build his own, and let it grow.'\n> Surely, if you are the first batpony to walk openly in the streets of Canterlot, you are considerably liquid already.\n> However, lubricating the graceful entrance of your VIP into batpony society...\n> Now, this is a task requiring a fluidity most supreme.",
 "title": "MLP: Everyday Life With Guardsmares, Chapter 3 (/RGM/)"
}