{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "lg_en",
  "kw_sec",
  "kw_down",
  "kw_protection",
  "kw_operations"
 ],
 "key": "zDFHs77z",
 "pasteDate": "Feb 28, 2018, 6:53:28 AM",
 "relevancy": 1.0,
 "relevant": false,
 "text": "POWER SYSTEMS\nComprehensive Viva- Multiple Choice Questions\n1\tWhich of the following regulation is considered to be the best\n\tA\t 2% \n\tB\t 30% \n\tC\t 70% \n\tD\t 98%. \n2\tWhen the power is to be transmitted over a distance of 500 km, the transmission voltage should be in the range\n\tA\t33 kV \n\tB\t66 kV \n\tC\t110 kV \n\tD\t150kV \n3\tIn order to reduce skin effect at UHF\n\tA\tconductors are painted \n\tB\tconductors are anodized \n\tC\tcopper lubes with silver plating are used\n\tD\tcopper rods with silver plating are used. \n4\tWhen two conductors each of radius r are at a distance D, the capacitance between the two is proportional to\n\tA\tloge (D/r) \n\tB\tloge (r/D) \n\tC\t1/loge (D/r) \n\tD\t1/loge (r/D).\n\t\t\n\t\t\n5\tThe fault clearing time of a circuit breaker is usually\n\tA\tfew minutes \n\tB\tfew seconds \n\tC\tone second \n\tD\tfew cycles of supply voltage.\n\t\t\n\t\t\n6\tWhich of the following is not a type of the contactor for circuit breakers ?\n\tA\tElectro-magnetic \n\tB\tElectro-pneumatic \n\tC\tPneumatic \n\tD\tVacuum.\n\t\t\n\t\t\n7\tThe pressure of SF6 gas in circuit breakers is of the order of\n\tA\t100 mm Hg \n\tB\t1 kg/cm2 \n\tC\t3 to 5 kg/cm2 \n\tD\t30 to 50 kg/cm2.\n\t\t\n\t\t\n8\tIn a HRC fuse the time between cut-off and final current zero, is known as\n\tA\ttotal operating time \n\tB\tarcing time \n\tC\tpre-arcing time \n\tD\tsettling time.\n\t\t\n\t\t\n9\tIn a circuit breaker if the insulation resistance between phase terminal and earthed frame is less than the specified limit, the probable cause could be\n\tA\tmoisture \n\tB\tdirty insulation surface \n\tC\tcarbon or copper particles sticking to the internal surface\n\tD\tAll the answers are correct.\n\t\t\n\t\t\n10\tFor carrying a 100 A (rms) current the cross-sectional area of aluminium bus bar should be at least\n\tA\t1 mm2 \n\tB\t10 mm 2 \n\tC\t25 mm 2 \n\tD\t50 mm2 \n\t\t\n\t\t\n11\tWhich device automatically interrupts the supply in the event of surges\n\tA\tEarthing switch \n\tB\tSeries reactor \n\tC\tIsolator \n\tD\tCircuit breaker. \n\t\t\n\t\t\n12\tWhich bus bar scheme offers the lowest cost ?\n\tA\tSingle bus bar scheme \n\tB\tRing bus bar scheme \n\tC\tBreaker and a half scheme \n\tD\tMain and transfer scheme. \n\t\t\n\t\t\n13\tWhich of the following correctly represents the sequence of operations of isolator circuit breaker and earthing switch while opening a circuit\n\tA\tClose earthing switch \n\tB\tOpen isolator \n\tC\tOpen circuit breaker \n\tD\tClose circuit breaker \n\t\t\n\t\t\n14\tIn a balance 3  , 4 wire AC system, the phase sequence is RYB. If the voltage of R phase is. 230 < 0 V, then for Y phase\n\tA\t230 < 0 V \n\tB\t230 < 60 V \n\tC\t230 < 90V \n\tD\t230 < 120 V.\n\t\t\n\t\t\n15\tVoltages under Extra High Voltage are\n\tA\t1 kV and above \n\tB\t11 kV and above \n\tC\t132 kV and above \n\tD\t330 kV and above.\n\t\t\n\t\t\n16\tIf the height of transmission towers is increased, which of the following parameters is likely to change ?\n\tA\tResistance \n\tB\tInductance \n\tC\tCapacitance \n\tD\tAll answers are correct.\n\t\t\n\t\t\n17\tThe ratio of capacitance from line to line capacitance from line to neutral is nearly\n\tA\t1/4 \n\tB\t\n\tC\t1 \n\tD\t2. \n\t\t\n\t\t\n18\tTransient state stability is generally improved by\n\tA\tusing high speed governors on machines\n\tB\tusing low inertia machines \n\tC\tdispensing with neutral grounding\n\tD\tusing high inertia machines\n\t\t\n\t\t\n19\tWhich of the following contributes to the improvement of efficiency of Rankine cycle in a thermal power plant ?\n\tA\tReheating of steam at intermediate stage \n\tB\tRegeneration use of steam for heating boiler feed water \n\tC\tUse of high pressures\n\tD\tAll answers are correct. \n\t\t\n\t\t\n20\tWhat is the maximum size of steam turbine usually being installed, for thermal power plants ?\n\tA\t120 MW\n\tB\t250 MW \n\tC\t500 MW \n\tD\t1000 MW. \n\t\t\n\t\t\n21\tIn regenerative cycle, bled steam is\n\tA\t discharged to atmosphere \n\tB\t condensed in steam condenser\n\tC\tused to beat feed water for boiler \n\tD\tmixed with steam supplied to turbine.\n\t\t\n\t\t\n22\tA single phase transmission line of impedance j0.8 ohm supplies a resistive load of 500 A at 300 V. What is the sending end power? \n\tA\t0.8 lag\n\tB\t0.6 lag\n\tC\t0.4 lag\n\tD\tUnity\n\t\t\n\t\t\n23\tThe resistance and inductance found to be equal in a short transmission line. What will be the power factor of the load to obtain zero regulation?\n\tA\tZero power factor\n\tB\tUnity power factor\n\tC\t0.7 lagging power factor\n\tD\t0.7 leading power factor\n\t\t\n\t\t\n24\tA conductor is composed of seven identical copper strands, each having radius 'r'. The self GMD of the conductor will be\n\tA\t2.366r\n\tB\t2.177r\n\tC\t3.177r\n\tD\t3.366r\n\t\t\n\t\t\n25\tThe main criterion for selection of the size of a distribution for a radial distribution system is\n\tA\tTemperature rise\n\tB\tCorona loss\n\tC\tVoltage drop\n\tD\tCapital cost\n\t\t\n\t\t\n26\tA synchronous generator connected to infinite bus delivers power at lagging power factor. If its excitation is increased\n\tA\tThe terminal voltage and  current increase\n\tB\tThe terminal voltage and  current decrease\n\tC\tThe voltage angle and current increase\n\tD\tThe voltage angle and current decrease\n\t\t\n\t\t\n27\tFor a fault at the terminals of a synchronous generator, the fault current is maximum for \n\tA\t3 phase fault\n\tB\t3 phase to ground fault\n\tC\tLine to ground fault\n\tD\tLine to line fault\n\t\t\n\t\t\n28\tZero sequence current can flow from a line into a transformer bank if the windings are in\n\tA\tStar/star\n\tB\tStar/delta\n\tC\tDelta/star\n\tD\tDelta/delta\n\t\t\n\t\t\n29\tWhen a line to ground fault occurs, the current in the phase is 100 A. What is the zero sequence current?\n\tA\t33.3.A\n\tB\t66.6 A\n\tC\t0 A\n\tD\t100 A\n\t\t\n\t\t\n30\tA 3-phase, 33 kV oil circuit breaker is rated 1200 A, 2000 MVA, 3s. The symmetrical breaking current is\n\tA\t75 kA\n\tB\t35 kA\n\tC\t63.75 kA\n\tD\t45.32 kA\n\t\t\n\t\t\n\tThe bus admittance matrix of a three-bus three-line system is\nY=j\nIf each transmission line between the two buses is represented by an equivalent p\nnetwork, the magnitude of the shunt susceptance of the line connecting bus 1 and 2 is\n\t4\t\t\t (B)2\n (C)1\t\t\t(D)0\n\tA two-phase load draws the following phase currents : i1(t) = Im sin(wt - 1),\ni2(t) = Im cos (wt - 2). These currents are balanced if 1 is equal to.\n        (A) -2 \t\t\t(B) 2\n         (C) (/2 - 2) \t\t(D) ( /2 + 2)\n\tA two-phase load draws the following phase currents : i1(t) = Im sin(wt - 1),\ni2(t) = Im cos (wt - 2). These currents are balanced if 1 is equal to.\n        (A) -2 \t\t\t(B) 2\n         (C) (/2 - 2) \t\t(D) ( /2 + 2)\n\tThe figure shows a two-generator system applying a load of PD = 40MW,\n connected at bus 2.\n \nThe fuel cost of generators G1 and G2 are :\nC1(PG1) = 10000 Rs/MWh and C2(PG2) = 12500 Rs/MWh and the loss in the line\nis Ploss(pu) =0.5PG1(pu),where the loss coefficient is specified in pu on a 100MVA\nbase. The most economic power generation schedule in MW is\n(A) PG1 = 20,PG2 = 22\t (B) PG1 = 22,PG2 = 20\n(C) PG1 = 20,PG2 = 20 (D) PG1 = 0,PG2 = 40\n34. A negative sequence relay is commonly used to protect\n(A) an alternator \t(B) an transformer\n(C) a transmission line \t(D) a bus bar\n\tPower is transferred from system A to system B by an HVDC link as shown in\nthe figure. If the voltage VAB and VCD are as indicated in figure, and I > 0, then\n \n\tVAB<0,VCD<0,VAB>VCD (B)VAB>0,VCD>0,VAB<VCD\n( C ) VAB>0,VCD>0,VAB>VCD \t(D) VAB>0,VCD<0\n\tConsider a step voltage of magnitude 1 pu travelling along a lossless transmission\nline that terminates in a reactor. The voltage magnitude across the reactor at the\ninstant travelling wave reaches the reactor is\n \n\t-1 pu \t\t(B) 1pu\n (C)2pu \t\t(D) 3pu\n\tA three-phase, 33 kV oil circuit breaker is rated 1200 A, 2000 MVA, 3 s. The\nSymmetrical breaking current is\n(A) 1200 A \t\t(B) 3600 A\n(C) 35 kA \t\t(D) 104.8 kA\n\tTwo regional systems, each having several synchronous generators and loads are\ninter connected by an ac line and a HVDC link as shown in the figure. Which of\nthe following statements is true in the steady state :\n \n(A) Both regions need not have the same frequency\n(B) The total power flow between the regions (Pac+ Pdc) can be changed by\ncontrolled the HDVC converters alone\n(C) The power sharing between the ac line and the HVDC link can be changed\nby controlling the HDVC converters alone.\n(D) The directions of power flow in the HVDC link (Pdc) cannot be reversed\n\tThe figure below shows a three phase self-commutated voltage source converter\nconnected to a power system. The converters dc bus capacitor is marked as C\nin the figure. The circuit in initially operating in steady state with  = 0 and the\ncapacitor dc voltage is equal to Vdc0. You may neglect all losses and harmonics.\nWhat action should be taken to increase the capacitor dc voltage slowly to a new\nsteady state value.\n \n(A) Make  positive and maintain it at a positive value\n(B) Make  positive and return it to its original value\n(C) Make  negative and maintain it at a negative value\n(D) Make  negative and return it to its original value\n40. A 500 MW, 21 kV, 50 Hz, 3-phase, 2-pole synchronous generator having a rated\np.f = 0.9, has a moment of inertia of 27.5103 kg-m2 .The inertia constant (H\n) will be\n(A) 2.44 s \t(B) 2.71 s\n(C) 4.88 s \t(D) 5.42 s\n\tAt an industrial sub-station with a 4 MW load, a capacitor of\n2 MVAR is installed to maintain the load power factor at 0.97 lagging. If the\ncapacitor goes out of service, the load power factor becomes\n(A) 0.85\t\t (B) 1.00\n(C) 0.80 lag \t\t(D) 0.90 lag\n\n\tThe p.u. parameter for a 500 MVA machine on its own base are:\ninertia, M = 20 p.u. ; reactance, X = 2 p.u.\nThe p.u. values of inertia and reactance on 100 MVA common base, respectively,\nare\n(A) 4, 0.4\t (B) 100, 10\n(C) 4, 10 \t(D) 100, 0.4\n\n\tAn 800 kV transmission line has a maximum power transfer capacity of P. If it\nis operated at 400 kV with the series reactance unchanged, the new maximum\npower transfer capacity is approximately\n(A) P\t\t (B) 2P\n(C) P/2 \t\t(D) P/4\n\n\tA balanced delta connected load of (8 + j6) per phase is connected to a 400 V,\n50 Hz, 3-phase supply lines. If the input power factor is to be improved to 0.9 by\nconnecting a bank of star connected capacitor the required kVAR of the of the\nbank is\n(A) 42.7 \t(B) 10.2\n(C) 28.8\t (D) 38.4\n\n\tThe A, B, C , D constants of a 220 kV line are : A = D = 0.9410, B = 130730\n, C = 0.001900 If the sending end voltage of the line for a given load delivered\nat nominal voltage is 240 kV, the % voltage regulation of the line is\n(A) 5\t\t (B) 9\n(C) 16 \t\t(D) 21\n\n\tAt a 220 kV substation of a power system, it is given that the three-phase fault\nlevel is 4000 MVA and single-line to ground fault level is 5000 MVA Neglecting\nthe resistance and the shunt suspectances of the system.\nThe positive sequence driving point reactance at the bus is\n(A) 2.5  (B) 4.033 \n(C) 5.5  (D) 12.1 \n\n\tA loss less transmission line having Surge Impedance Loading (SIL) of 2280 MW\nis provided with a uniformly distributed series capacitive compensation of 30%.\nThen, SIL of the compensated transmission line will be\n(A) 1835 MW  \t\t (B) 2280 MW\n(C) 2725 MW \t\t(D) 3257 MW\nAns: B\n\n\tA loss less single machine infinite bus power system is shown below\n \nThe synchronous generator transfers 1.0 per unit of power to the infinite bus. The\ncritical clearing time of circuit breaker is 0.28 s. If another identical synchronous\ngenerator is connected in parallel to the existing generator and each generator is\nscheduled to supply 0.5 per unit of power, then the critical clearing time of the\ncircuit breaker will\n(A) reduce to 0.14 s\n(B) reduce but will be more than 0.14 s\n(C) remain constant at 0.28 s\n(D) increase beyond 0.28 s\n\n\tSingle line diagram of a 4-bus single source distribution system is shown below.\nBranches e1,e2,e3 and e4 have equal impedances. The load current values indicated\nin the figure are in per unit.\n \nDistribution companys policy requires radial system operation with minimum\nloss. This can be achieved by opening of the branch\n(A) e1\t\t (B) e2\n(C) e3 \t\t(D) e4\n  50. In a biased differential relay the bias is defined as a ratio of\n(A) number of turns of restraining and operating coil\n(B) operating coil current and restraining coil current\n(C) fault current and operating coil current\n(D) fault current and restraining coil current\n\tA generator is connected through a 20 MVA, 13.8/138 kV step down transformer,\nto a transmission line. At the receiving end of the line a load is supplied through\na step down transformer of 10 MVA, 138/69 kV rating. A 0.72 pu. load, evaluated\non load side transformer ratings as base values , is supplied from the above\nsystem. For system base values of 10 MVA and 69 kV in load circuit, the value of\nthe load (in per unit) in generator will be\n(A) 36 \t\t\t(B) 1.44\n(C) 0.72 \t\t(D) 0.18\n52.  In the thermal power plants, the pressure in the working fluid cycle is developed by\n(A) condenser\t\t (B) super heater\n(C) feed water pump \t(D) turbine\n\n\tThe network shown in the given figure has impedances in p.u. as indicated. The\ndiagonal element Y22 of the bus admittance matrix YBUS of the network is\n \n(A) -j19.8\t\t (B) +j20.0\n(C) +j0.2\t\t (D) -j19.95\n\tChoose two appropriate auxiliary components of a HVDC transmission system\nfrom the following\nP. D.C line inductor Q. A.C line inductor\nR. Reactive power sources\nS. Distance relays on D.C line\nT. Series capacitance on A.C. line\n(A) P and Q \t(B) P and R\n(C) Q and S \t(D) S and T\n\tA list of relays and the power system components protected by the relays are\ngiven in List-I and List-II respectively. Choose the correct match from the four\nchoices given below:\nList-I List-II\nP. Distance relay \t\t1. Transformers\nQ. Under frequency relay \t2. Turbines\nR. Differential relay \t\t3. Busbars\nS. Buchholz relay\t\t4. Shunt capacitors\n5. Alternators\n6. Transmission lines\nCodes:\nP Q R S\n(A) 6 5 3 1\n(B) 4 3 2 1\n(C) 5 2 1 6\n(D) 6 4 5 3\n\tFor harnessing low variable waterheads, the suitable hydraulic turbine with high\n              percentage of reaction and runner adjustable vanes is\n(A) Kaplan \t(B) Francis\n(C) Pelton\t (D) Impeller\n\n\tA power system consist of 300 buses out of which 20 buses are generator bus,\n25 buses are the ones with reactive power support and 15 buses are the ones\nwith fixed shunt capacitors. All the other buses are load buses. It is proposed to\nperform a load flow analysis in the system using Newton-Raphson method. The\nsize of the Newton Raphson Jacobian matrix is\n(A) 553 553 (B) 540 540\n(C) 555 555 (D) 554 554\n\tIncremental fuel costs (in some appropriate unit) for a power plant consisting of\nthree generating units are\nIC1 = 20 + 0.3P1, IC2 = 30 + 0.4P2, IC3 = 30\nWhere P1 is the power in MW generated by unit i for i = 1,2 and 3. Assume\nthat all the three units are operating all the time. Minimum and maximum loads\non each unit are 50 MW and 300 MW respectively. If the plant is operating on\neconomic load dispatch to supply the total power demand of 700 MW, the power\ngenerated by each unit is\n(A) P1 = 242.86MW;P2 = 157.14MW; and P3 = 300MW\n(B) P1 = 157.14MW;P2 = 242.86MW; and P3 = 300MW\n(C) P1 = 300MW;P2 = 300MW; and P3 = 100MW\n(D) P1 = 233.3MW;P2 = 233.3MW; and P3 = 233.4MW\n\n\n\tThe purpose of slack bus in the power system is to .\n\tSupply  the losses in the system\t (B) Act as load (C) improve the power factor (D) none of the above \n\n60.Which method of finding load flow solution converge fast in large scale transmission system.\n(A) GS Method (B) NR Method (C) FD Method\t (D) Contingency Analysis \n\n\n\nQuestions\n\tThe figure shows a two-generator system applying a load of PD = 40MW, connected at bus 2.\n \nThe fuel cost of generators G1 and G2 are :\nC1(PG1) = 10000 Rs/MWh and C2(PG2) = 12500 Rs/MWh and the loss in the line is   where the loss coefficient is specified in pu on a 100MVA base. The most economic power generation schedule in MW is\n\tPG1 = 20,PG2 = 22\n\tPG1 = 22,PG2 = 20\n\tPG1 = 20,PG2 = 20\n\tPG1 = 0,PG2 = 40\n\tThe sequence components of the fault current are as follows:I positive = j1.5 pu,I negative = j0.5 pu, Izero = j1 pu. The type of fault in the system is\n\tLL\n\tLG\n\tLLG\t\n\tLLLG\n\n\tA cylinder rotor generator delivers 0.5 pu power in the steady-state to an infinite bus through a transmission line of reactance 0.5 pu. The generator no-load voltage is 1.5 pu and the infinite bus voltage is 1 pu. The inertia constant of the generator is 5MW-s/MVA and the generator reactance is 1 pu. The critical clearing angle, in degrees, for a three-phase dead short circuit fault at the generator terminal is\n\t53.5\n\t60.2\n\t70.8\n\t79.6\n\n\tFor enhancing the power transmission in along EHV transmission line, the mostpreferred method is to connect a\t\n\tSeries inductive compensator in the line\n\tShunt inductive compensator at the receiving end\n\tSeries capacitive compensator in the line\n\tShunt capacitive compensator at the sending end\n\n\tA loss less transmission line having Surge Impedance Loading (SIL) of 2280 MW is provided with a uniformly distributed series capacitive compensation of 30%.Then, SIL of the compensated transmission line will be\n\t1835 MW\n\t2280 MW\n\t2725 MW\n\t3257 MW\n\n\tThe concept of an electrically short, medium and long line is primarily based on the\t\n\tnominal voltage of the line\n\tphysical length of the line\n\twavelength of the line\n\tpower transmitted over the line\n\n\tHigh Voltage DC (HVDC) transmission is mainly used for\t\n\tbulk power transmission over very long distances\n\tinter-connecting two systems with same nominal frequency\n\teliminating reactive power requirement in the operation\n\tminimizing harmonics at the converter stations\n\n\tWhich of the following is usually not the generating voltage?\n\t6.6 kV\n\t9.9 kV\n\t11kV\n\t13.2 kV.\n\n\tBoosters are basically\n\tinductors\n\tcapacitors\n\ttransformers\n\tSynchronous motors.\n\n\tConductors for high voltage transmission lines are suspended from towers\n\tto reduce clearance from ground\n\tto increase clearance from ground\n\tto reduce wind and snow loads\n\n\tThe fact that a conductor carries more current on the surface as compared to core, is known as\n\tskin effect\n\tcorona\n\tpermeability\n\tunsymmetrical fault.\n\n\tThe material used for fuse wire must have\n\tlow melting point and low specific resistance\n\tlow melting point and high specific resistance\n\thigh melting point and low specific resistance\n\tlow melting point with any specific resistance.\n\n\n\tThe Buchholz relay is used to protect the\n\talternators against all internal faults\n\toil immersed transformers against all internal faults\n\tsynchronous motors against all internal faults\n\ttransmission line against all types of faults.\n\n\tThe location of the lightning arresters is\n\tnear the transformer \n\taway from the transformer\n\tnear the circuit breaker \n\taway from the circuit breaker. \n\n\tWhich of the following distribution systems gives the greater reliability\n\tradial system \n\tring system\n\tDC three wire system \n\topen loop system.\n\n\tIn overhead transmission lines the effect of capacitance can be neglected when the length of line is less than\n\t200 km\n\t160 km\n\t100 km\n\t80 km. \n\n\tA relay used on long transmission lines is\n\tmho's relay\n\treactance relay\n\timpedance relay\n\tno relay is used.\n\n\tLitz wires are used for intermediate frequencies.to overcome\n\tcorona effect\n\tskin effect\n\tradio interference\n\tall of the above.\n\n\tThe chances of corona are maximum during\n\tsummer heat\n\twinter\n\tdry weather\n\thumid weather. \n\n\tIf the height of the transmission tower is decreased, the capacitance of the line will\n\tincrease \n\tdecrease\n\tremain same \n\tdecrease exponentially.\n\n\tthe load must not be connected directly on\n\ttransmission line \n\tdistributor \n\tservice mains \n\tL.T. 220 volt line.\n\n\tIn aluminium conductors steel reinforced, the insulation between aluminium and steel conductors is\n\tany insulator\n\tbitumen\n\tinsulin\n\tno insulation is required. \n\n\tThe main advantage of ac. transmission system over d.c. transmission system is\n\tEasy transformation\n\tLess losses in transmission over long distances\n\tLess insulation problems\n\tLess problem of instability.\n\n\tStep-up substations are associated with\n\tdistributors\n\tconsumer location\n\tconcentrated load\n   d)   generating stations\n\tThe safe working life of the underground cable is taken as\n\t2 years \n\t5 years\n\t40 years \n\t100 years.\n\n\tBase load plants are designed to supply power at\n\tlow capital cost and low operating cost\n\thigh capital cost and low operating cost\n\tlow capital cost and high operating cost\n\thigh capital cost and high operating cost.\n\n\tRegulating transformers are used in power system to control\n\tpower factor \n\tload flow \n\tvoltage \n\tnone of these\n\n88. The cause of transient stability is\n\talternator loosing its excitation \n\tswitching ON and OFF in the line\n\tshort circuit fault in the lines \n\tall of the above. \n\n\tLoad that depends on the supply frequency is of\n\tfan type \n\theating and welding type\n\tsynchronous condenser\n\tcentrifugal pumps.\n\n\tThe turbine used for high head in hydro plant is\n\tFrancis turbine \n\tKaplan turbine \n\tPelton wheel \n\tnone of these.\n\t\n\tMost economic load on an overhead line is\n\tgreater than the natural load \n\tless than the natural load\n\tequal to the natural load \n\tnone of the above.\n\n\n\n\n\tA wave will not experience any reflection when impedance of line is equal to\n\na surge impedance\nb load impedance\nc surge impedance\nd All answers are correct\n\n\n\tAt present how many HVDC lines are there in india?\n\na none \nb one \nc two \nd more than two\n\n\tOn no load in EHV lines what is the relation between receiving and sending end voltage?\n\na receiving end voltage > sending end voltage\nb receiving end voltage < sending end voltage\nc receiving end voltage = sending end voltage\nd none\n\n\n\tWhat is the surge impedance loading of 400kv line with surge impedance given as 160 ohms\n\na 1000 MW\nb 1000 KW\nc 256 MW\nd 256 KW\n\n\n\tQ.Where is the hydro power plant located in following places?\n\na Raamagundam\nb Tarapur\nc Kalpakam\nd Srisailam\n\n\n\tSelf GMD is used in the calculation of_______\n\na inductance only\nb inductance and capacitance\nc capacitance only\nd none\n\n\tWhat is the GMD if the distance between the lines are 6m,6m,12m?\n\na 7.55m\nb 6m\nc 12m\nd 8.56m\n\nZero sequence current doesn't exist in the following fault\n\na L-G\nb L-L\nc L-L-G\nd L-L-L-G\n\n\n\tTo avoid arcing connect suitable value of ________ in earthing.\n\na capacitance\nb indunctance\nc resistance\nd susceptance\n\n\n\tIn the following type of conductors the corona is minimum\n\na circular\nb stranded\nc helical\nd rectangular\n\n\n\n\tAt what frequency corona loss is more?\n\na 50Hz\nb 60Hz\nc 25Hz\nd 100Hz\n\n\n\n\n\tWhat is the line current of a circuit when the current transformer of 1000:5 rating measures 4Amperes?\n\na 5000 A\nb 1000 A\nc 400 A\nd 800A\n\n\n\n\tIf the time delay of relay with TMS setting 0.1 is 10 sec, then what is the time delaty when the TMS setting is changed to 0.5\n\na 2 sec\nb 20 sec\nc 100 sec\nd 5 sec\n\n\n\tIn distribution lines_____\n\na X/R<0.1\nb X/R>10\nc X/R<1\nd X/R<0.01\n\n\n\tIn EHV lines _____\n\na X/R=10\nb X/R=100\nc X/R>3\nd X/R<3\n\n\n\tThe machine used in windmills is______\n\na Alternator\nb Induction generator\nc Synchronous generator\nd All\n\n\n\n\n\tInsulators in EHV lines are designed based on_____\n\na switching voltages\nb peak voltages\nc corona\nd lightning voltages\n\n\n\n\n\tThe value of restriking voltage depends on______\n\na inductance of line\nb capacitance of line\nc both\nd none\n\n\n\n\tHRC fuse and circuit-breaker combination is used CB operates for\n\na low over-load currents\nb high over-load currents\nc combination is never used\n\n\n\n\n\tReflection coefficent of current of an open ended line.\n\na 1\nb -1\nc 2\nd -2\n\n\n\n\tPositive sequence terminal voltage is zero in\n\na L-L\nb L-L-G\nc L-G\nd L-L-L\n\n\n\n\n\tMost economical load in underground cable is\n\na less than surge impedance\nb equal to surge impdance\nc more than surge impedence\nd any load\n\n\n\n\n\tMaximum power transfer through line V1= 110 kv, V2= 100kv, X=22 ohm is\n\na 500 MW\nb 500 KW\nc 250 MW\nd 250 KW\n\n\n\n\n\tBase load of a power station stands for \n\na 2-4 hours/day\nb 4-8 hours/day\nc 8-12 hours/day\nd 12-24hours/day\n\n\n116..A wire is placed on the top of a transmission line to protect from\n\na surge high voltage\nb Direct lightning strokes\nc indirect lightning strokes\nd Switching over voltages\n\n\n\n\n\n\tFeeder is designed mainly from the point of view of\nA. Its current carrying capacity \nB. Voltage drop in it \nC. Operating voltage \nD. Operating Frequency \n\n\n\tDistributors are designed from the point of view of \nA. Its current carrying capacity \nB. Operating voltage \nC. Voltage drop in it \nD. Operating frequency \n\n\n\n\tThe main drawback of overhead system over underground system is-\nA. Underground system is more flexible than overhead system \nB. Higher charging current \nC. Surge problem \nD. High initial cost \n\n\n\n\n\tBy increasing the transmission voltage to double of its original value the same power can be dispatched keeping the line loss-\nA. Equal to original value \nB. Half the original value \nC. Double the original value \nD. One fourth of original value \n\n\n\tFor the same voltage drop, increasing the voltage of a distributor n time-\nA. Reduces the cross section of the conductor by n times \nB. Increases the cross section of the conductor by n times \nC. Reduces the cross section of conductor by n^2 times \nD. Increases the cross section of the conductor by n^2 times \n\n\tImproving power factor\nA. Reduces current for a given output \nB. Increases losses in line \nC. Increases the cost of station equipment \nD. None \n\n\n\n\tCorona is\nA. Partial breakdown of air\nB. Complete breakdown of air\nC. Sparking between lines\nD. None of these\n\n\n\tBundled conductors reduce\nA. Surface electric stress of conductor\nB. Increases the line reactance\nC. Decrease the line capacitance\nD. All\n\nGATE QUESTIONS\n\tFor a fixed value of complex power flow in a transmission line having a sending end voltage V, the real power loss will be proportional to [GATE 2009]\n(a) V\n(b) V2\n(c) 1/V2\n(d) 1/V\n\n\n\tHow many 200W/220V incandescent lamps connected in series would consume the same total power as a single 100W/220V incandescent lamps? [GATE 2009]\n(a) Not possible\n(b) 4\n(c) 3\n(d) 2\n\n\n\n\tConsider two buses connected by an impedance of (0+j5). The bus 1 voltage is 10030 V, and bus 2 voltage is 1000 V. The real and reactive power supplied by bus 1, respectively are\n\n   A. 1000W, 268Var\n   B. -1000W,-134Var\n   C. 276.9W,-56.7Var\n   D. -276.9W,56.7Var\n\n\n\tFor enhancing the power transmission in a long EHV transmission line, the most preferred method is to connect a\n   A. Series inductive compensator in the line\n   B. Shunt inductive compensator at the receiving end\n   C. Series capacitive compensator in the line\n   D. Shunt capacitive compensator at the sending end\n\n\n\n\n\nPower Systems\nS.No\tQuestion\n129\tBoosters are basically\n(A) inductors\n(B) capacitors\n(C) transformers\n(D) synchronous motors.\n\n\t\n130\t Conductors for high voltage transmission lines are suspended from towers\n(A) to reduce clearance from ground\n(B) to increase clearance from ground\n(C) to reduce wind and snow loads\n(D) to take care of extension in length during summer.\n\n\t\n131\tTransmission efficiency increases as\n(A) voltage and power factor both increase\n(B) voltage and power factor both decrease\n(C) voltage increases but power factor decreases\n(D) voltage decreases but power factor increases.\n\n\t\n132\tWhen alternating current passes through a conductor\n(A) it remains uniformly distributed throughout the section of conductor\n(B) portion of conductor near the surface carries more current as compared to the core\n(C) portion of conductor near the surface carries less current as compared to the core\n(D) entire current passes through the core of the conductor.\n\n\t\n133\tThe fact that a conductor carries more current on the surface as compared to core, is known as\n(A) skin effect\n(B) corona\n(C) permeability\n(D) unsymmetrical fault.\n \n\n\t\n134\tThe effective resistance of a conductor will be the same as ohmic resistance when\n(A) current is in true sine wave form\n(B) voltage is low\n(C) power factor is unity\n(D) Current is uniformly distributed in the conductor cross-section.\n\n\t\n135\t\tThe skin effect of a conductor will reduce as the\n(A) diameter increases\n(B) frequency increases\n(C) permeability of conductor material increases\n(D) resistivity of conductor material increases.\n\n\t\n136\tFeeder is designed mainly from the point of view of-\n\nA. Its current carrying capacity \nB. Voltage drop in it \nC. Operating voltage \nD. Operating Frequency\n\t\n137\tImproving power factor-\n\nA. Reduces current for a given output \nB. Increases losses in line \nC. Increases the cost of station equipment \nD. None\n\t\n138\tThe disadvantage of constant voltage transmission is\n(A) short circuit current of the system is increased\n(B) load power factor in heavy loads\n(C) large conductor area is required for same power transmission\n(D) air of the above.\n \n\n\t\n139\tThe effect of corona is\n(A) increased energy loss\n(B) increased reactance\n(C) increased inductance\n(D) all of the above.\n\n\t\n140\t Presence of ozone as a result of corona is harmful because\n(A) it gives bad odor\n(B) it corrodes the material\n(C) it transfers energy to the ground\n(D) reduces power factor.\n \n\n\t\n141\t Between two supports, due to sag the conductor takes the form of\n(A) catenary\n(B) triangle\n(C) ellipse\n(D) semi-circle.\n\n\t\n142\tThe effect of wind pressure is more predominant on\n(A) transmission lines\n(B) neutral wires\n(C) insulator\n(D) supporting towers.\n\n\t\n143\t When transformers or switchgears are to be installed in a transmission line, the poles used are\n(A) I type\n(B) J type\n(C) H type\n(D) L type.\n\n\t\n144\tACSR conductor implies\n(A) All conductors surface treated and realigned\n(B) Aluminum conductor steel reinforced\n(C) Anode current sinusoidally run\n(D) Anodized Core Smooth Run.\n\n\t\n145\tDuring storm the live conductor of public electric supply breaks down and touches the earth. The consequences will be\n(A) supply voltage will drop\n(B) supply voltage will increase\n(C) current will flow to earth\n(D) no current will flow in the conductor.\n\n\t\n146\t For transmission lines the standing wave ratio is the ratio of\n(A) maximum voltage to minimum voltage\n(B) maximum current to minimum voltage\n(C) peak voltage to rms voltage\n(D) maximum reactance to minimum reactance.\n \n\n\t\n147\tThe bundling of conductors is done primarily to\n(A) reduce reactance\n(B) increase reactance\n(C) increase ratio interference\n(D) reduce radio interference.\n\n\t\n148\tShunt capacitance is usually neglected in the analysis of\n(A) Short transmission lines\n(B) Medium transmission lines\n(C) Long transmission lines\n(D) Medium as well as long transmission lines.\n\n149\t In the following figure, which component ensures the safety of the line from damage?\n \na. Relay\nb. Circuit breaker\nc. Bus bar\nd. Current transformer\n\n150\t What is the purpose of back up protection?\na. To increase the speed\nb. To increase the reach\nc. To leave no blind spot\nd. To guard against failure of primary\n151\tThe isolators used in the transmission lines are capable of breaking\n\na. Fault current\nb. supply current\nc. Charging current\nd. Load current\n\n152\tWhat is the making to breaking current ratio for an extra high voltage circuit breaker?\na. More than 1\nb. Equal to 1\nc. Less than 1\nd. A negative value\n\n153\tWhich of the following circuit breaker is highly reliable and has a least maintenance?\n\na. Oil circuit breakers\nb. Air blast\nc. Vacuum circuit breakers\nd. SF6 circuit breakers\n\n154\tWhat does protective relay provide?\n\na. Provide additional safety to the circuit breaker in its operation.\nb. Close the contacts when the actuating quantity attains a certain predetermined value.\nc. Limit the arcing current during the circuit breaker operation.\nd. Earth or ground any stray voltage.\n\n155\tKeeping in view the cost and the overall effectiveness, which of the following circuit breaker is best suited for capacitor bank switching?\n\na. Vacuum circuit breaker\nb. Air blast CB\nc. SF6\nd. Oil CB\n\n156\tSF6 gas is imported in _____________.\na. Air cylinders\nb. Gas cylinders\nc. Liquid form in cylinders\nd. Solid form.\n\n157\tWhat is the normal pressure at which the SF6 gas is maintained in the closed position of the breaker?\na. 2 kg / cm2\nb. 2.5 kg /cm2\nc. 2.8 kg / cm2   \nd. 3 kg / cm2\n\n158\tWhat is the breaking capacity of the air blast circuit breaker?\na. 5000 MVA\nb. 6000 MVA\nc. 7000 MVA\nd. 10000 MVA",
 "title": ""
}