{
 "espireDate": "N",
 "format": "text",
 "jSonReasons": [
  "re_sql",
  "lg_en"
 ],
 "key": "zXMQRWps",
 "pasteDate": "Feb 11, 2018, 3:58:31 AM",
 "relevancy": -1.0,
 "relevant": false,
 "text": "b'You will die. You will not live forever.'                                                                                                                                                 \nb'Nor will any man nor any thing. Nothing is immortal.'                                                                                                                                     \nb'But only to us is it given to know that we must die.'                                                                                                                                     \nb'And that is a great gift: the gift of selfhood.'                                                                                                                                          \nb'For we have only what we know we must lose, what we are willing to lose...'                                                                                                               \nb'That selfhood which is our torment, and our treasure, and our humanity, does not endure.'                                                                                                 \nb'It changes; it is gone, a wave on the sea.'                                                                                                                                               \nb'Would you have the sea grow still and the tides cease, to save one wave, to save yourself?'                                                                                               \nb'- Ursula K. Le Guin, The Farthest Shore'                                                                                                                                                  \nb''                                                                                                                                                                                         \nb\"Love doesn't just sit there, like a stone, it has to be made, like bread; remade all the time, made new.\"                                                                                 \nb'- Ursula K. Le Guin, The Lathe of Heaven'                                                                                                                                                 \nb''                                                                                                                                                                                         \nb'People who deny the existence of dragons are often eaten by dragons.'                                                                                                                     \nb'From within.'                                                                                                                                                                             \nb'- Ursula K. Le Guin, The Wave in the Mind: Talks & Essays on the Writer, the Reader, & the Imagination'                                                                                   \nb''                                                                                                                                                                                         \nb'We read book to find out who we are.'                                                                                                                                                     \nb'What other people, real or imaginary, do and think and feel... is an essential guide to our understanding of what we ourselves are and may become.'                                       \nb'- Ursula K. Le Guin'                                                                                                                                                                      \nb''                                                                                                                                                                                         \nb\"We're each of us alone, to be sure.\"                                                                                                                                                      \nb'What can you do but hold your hand out in the dark?'                                                                                                                                      \nb\"- Ursula K. Le Guin, The Wind's Twelve Quarters, Volume 1\"                                                                                                                                \nb''                                                                                                                                                                                         \nb'When you light a candle, you also cast a shadow.'                                                                                                                                         \nb'- Ursula K. Le Guin'                                                                                                                                                                      \nb''                                                                                                                                                                                         \nb'Light is the left hand of darkness and darkness the right hand of light.'                                                                                                                 \nb'Two are one, life and death, lying together like lovers in kemmer, like hands joined together, like the end and the way.'                                                                 \nb'- Ursula K. Le Guin, The Left Hand of Darkness'                                                                                                                                           \nb''                                                                                                                                                                                         \nb'It is our suffering that brings us together.'                                                                                                                                             \nb'It is not love.'                                                                                                                                                                          \nb'Love does not obey the mind, and turns to hate when forced.'                                                                                                                              \nb'The bond that binds us is beyond choice.'                                                                                                                                                 \nb'We are brothers.'                                                                                                                                                                         \nb'We are brothers in what we share.'                                                                                                                                                        \nb'In pain, which each of us must suffer alone, in hunger, in poverty, in hope, we know our brotherhood.'                                                                                    \nb'We know it, because we have had to learn it.'                                                                                                                                             \nb'We know that there is no help for us but from one another, that no hand will save us if we do not reach out our hand.'                                                                    \nb'And the hand that you reach out is empty, as mine is.'                                                                                                                                    \nb'You have nothing.'                                                                                                                                                                        \nb'You possess nothing.'                                                                                                                                                                     \nb'You own nothing.'                                                                                                                                                                         \nb'You are free.'                                                                                                                                                                            \nb'All you have is what you are, and what you give.'                                                                                                                                         \nb'- Ursula K. Le Guin, The Dispossessed'                                                                                                                                                    \nb''                                                                                                                                                                                         \nb'I do not care what comes after; I have seen the dragons on the wind of morning.'                                                                                                          \nb'- Ursula K. Le Guin, The Farthest Shore'                                                                                                                                                  \nb''                                                                                                                                                                                         \nb'For we each of us deserve everything, every luxury that was ever piled in the tombs of the dead kings, and we each of us deserve nothing, not a mouthful of bread in hunger.'             \nb'Have we not eaten while another starved?'                                                                                                                                                 \nb'Will you punish us for that?'                                                                                                                                                             \nb'Will you reward us for the virtue of starving while others ate?'                                                                                                                          \nb'No man earns punishment, no man earns reward.'                                                                                                                                            \nb'Free your mind of the idea of deservind, the idea of earning, and you will be able to think.'                                                                                             \nb'Ursula K. Le Guin, The Dispossessed'                                                                                                                                                      \nb''                                                                                                                                                                                         \nb''                                                                                                                                                                                         \nb''",
 "title": ""
}